Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/BACKUPRESTOREES.xlf
Languages: es

# ERR_bkrs_100
source: Incompatible data store format (waExtra file found)
es: Formato de almacenamiento incompatible (se encontró archivo waExtra)

# ERR_bkrs_200
source: Failed to retrieve journaling info
es: Error al recuperar la información del historial

# ERR_bkrs_201
source: Journal file not found: {path}
es: El archivo de historial no se encontró: {path}

# ERR_bkrs_202
source: Failed to perform backup
es: No se pudo realizar la copia de seguridad

# ERR_bkrs_203
source: Failed to create backup folder: {path}
es: No se pudo crear la carpeta de la copia de seguridad: {Path}

# ERR_bkrs_204
source: Failed to backup journal
es: Error en el historial de backup

# ERR_bkrs_205
source: Invalid journal path: {path}
es: Ruta de historial no válida: {Path}

# ERR_bkrs_206
source: Invalid backup folder: {path}
es: Carpeta de backup no válida: {Path}

# ERR_bkrs_207
source: Failed to backup data folder
es: Fallo al respaldar la carpeta de datos

# ERR_bkrs_208
source: Next active journal path is invalid
es: La ruta del siguiente historial es inválida

# ERR_bkrs_209
source: Invalid backup settings
es: Configuración de copia de seguridad inválida

# ERR_bkrs_210
source: Failed to store backup manifest
es: Error al guardar el manifiesto de la copia de seguridad

# ERR_bkrs_211
source: backup configuration property '{p1}' not found
es: Propiedad de configuración de backup '{p1}' no encontrada

# ERR_bkrs_212
source: Invalid type for backup configuration property '{p1}', Folder expected
es: Tipo inválido para la propiedad de configuración de backup '{p1}', se esperaba una carpeta

# ERR_bkrs_213
source: Invalid type for backup configuration property '{p1}', String expected
es: Tipo inválido para la propiedad de configuración de backup '{p1}', se esperaba una cadena

# ERR_bkrs_214
source: Invalid type for backup configuration property '{p1}', bool expected
es: Tipo inválido para la propiedad de configuración de backup '{p1}', se esperaba un booleano

# ERR_bkrs_215
source: Invalid type for backup configuration property '{p1}', number or string expected
es: Tipo inválido para la propiedad de configuración de backup '{p1}', se esperaba un número o una cadena

# ERR_bkrs_216
source: Invalid value for backup configuration property '{p1}'
es: Tipo inválido para la propiedad de configuración de backup '{p1}'

# ERR_bkrs_217
source: Backup folder {path} is not empty
es: Carpeta de backup {path} no está vacía

# ERR_bkrs_218
source: Failed to open backup registry {path}
es: Fallo al abrir el registro de backup {path}

# ERR_bkrs_401
source: Cannot restore data folder from {pathsrc} to {pathdst}
es: Cannot restore data folder from {path1} to {path2}
