Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/BACKUPRESTORECS.xlf
Languages: cs

# ERR_bkrs_100
source: Incompatible data store format (waExtra file found)
cs: Nekompatibilní formát ukládání dat (nalezen soubor waExtra)

# ERR_bkrs_200
source: Failed to retrieve journaling info
cs: Selhalo obnovení informací ze žurnálu

# ERR_bkrs_201
source: Journal file not found: {path}
cs: Soubor žurnálu nenalezen: {path}

# ERR_bkrs_202
source: Failed to perform backup
cs: Selhalo provádění zálohy

# ERR_bkrs_203
source: Failed to create backup folder: {path}
cs: Selhalo vytvoření složky zálohy: {path}

# ERR_bkrs_204
source: Failed to backup journal
cs: Selhalo vytvoření zálohy žurnálu

# ERR_bkrs_205
source: Invalid journal path: {path}
cs: Neplatná cesta k žurnálu: {path}

# ERR_bkrs_206
source: Invalid backup folder: {path}
cs: Neplatná složka zálohy: {path}

# ERR_bkrs_207
source: Failed to backup data folder
cs: Selhalo zálohování složky dat

# ERR_bkrs_208
source: Next active journal path is invalid
cs: Další aktivní cesta k žurnálu je nepalatná

# ERR_bkrs_209
source: Invalid backup settings
cs: Neplatné nastavení zálohy

# ERR_bkrs_210
source: Failed to store backup manifest
cs: Selhalo uložení manifestu zálohy

# ERR_bkrs_211
source: backup configuration property '{p1}' not found
cs: Vlastnost konfigurace zálohy '{p1}' nenalezena

# ERR_bkrs_212
source: Invalid type for backup configuration property '{p1}', Folder expected
cs: Neplatný typ pro vlastnost konfigurace zálohy '{p1}', očekávána složka

# ERR_bkrs_213
source: Invalid type for backup configuration property '{p1}', String expected
cs: Neplatný typ pro vlastnost konfigurace zálohy '{p1}', očekáván řetězec

# ERR_bkrs_214
source: Invalid type for backup configuration property '{p1}', bool expected
cs: Neplatný typ pro vlastnost konfigurace zálohy '{p1}', očekáván logický arg

# ERR_bkrs_215
source: Invalid type for backup configuration property '{p1}', number or string expected
cs: Neplatný typ pro vlastnost konfigurace zálohy '{p1}', očekáváno číslo nebo řetězec

# ERR_bkrs_216
source: Invalid value for backup configuration property '{p1}'
cs: Neplatný typ pro vlastnost konfigurace zálohy '{p1}'

# ERR_bkrs_217
source: Backup folder {path} is not empty
cs: Složka zálohy {path} není prázdná

# ERR_bkrs_218
source: Failed to open backup registry {path}
cs: Selhalo otevření registru zálohy {path}

# ERR_bkrs_400
source: Cannot restore journal from {pathsrc} to {pathdst}
cs: Nelze restaurovat žurnál z {pathsrc} do {pathdst}

# ERR_bkrs_401
source: Cannot restore data folder from {pathsrc} to {pathdst}
cs: Nelze restaurovat složku z {path1} do {path2}

# ERR_bkrs_402
source: Cannot create safety copy for data folder {pathsrc} to {pathdst}
cs: Nelze vytvořit bezpečnostní kopii složky dat z {pathsrc} do {pathdst}

# ERR_bkrs_403
source: Cannot create journal safety copy from {pathsrc} to {pathdst}
cs: Nelze vytvovořit bezpečnostní kopii žurnálu z {pathsrc} do {pathdst}
