Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/BACKUPRESTOREDE.xlf
Languages: de

# ERR_bkrs_100
source: Incompatible data store format (waExtra file found)
de: Inkompatibles Datenformat (waExtra Datei gefunden)

# ERR_bkrs_200
source: Failed to retrieve journaling info
de: Fehler beim Lesen der Journaling-Informationen

# ERR_bkrs_201
source: Journal file not found: {path}
de: Journal Datei nicht gefunden: {path}

# ERR_bkrs_202
source: Failed to perform backup
de: Fehler beim Ausführen des Backups

# ERR_bkrs_203
source: Failed to create backup folder: {path}
de: Fehler beim Erstellen des Backup-Ordners: {path}

# ERR_bkrs_204
source: Failed to backup journal
de: Fehler beim Sichern des Journals

# ERR_bkrs_205
source: Invalid journal path: {path}
de: Ungültiger Pfad zum Journal: {path}

# ERR_bkrs_206
source: Invalid backup folder: {path}
de: Ungültiger Backup-Ordner: {path}

# ERR_bkrs_207
source: Failed to backup data folder
de: Fehler beim Sichern des Datenordners

# ERR_bkrs_208
source: Next active journal path is invalid
de: Neuer Pfad zum aktiven Journal ist ungültig

# ERR_bkrs_209
source: Invalid backup settings
de: Ungültige Backup-Einstellungen

# ERR_bkrs_210
source: Failed to store backup manifest
de: Fehler beim Sichern des Backup-Manifest

# ERR_bkrs_211
source: backup configuration property '{p1}' not found
de: Backup Konfigurations-Eigenschaft '{p1}' nicht gefunden

# ERR_bkrs_212
source: Invalid type for backup configuration property '{p1}', Folder expected
de: Ungültiger Typ für Backup Konfigurations-Eigenschaft '{p1}', Ordner erwartet

# ERR_bkrs_213
source: Invalid type for backup configuration property '{p1}', String expected
de: Ungültiger Typ für Backup Konfigurations-Eigenschaft '{p1}', Text erwartet

# ERR_bkrs_214
source: Invalid type for backup configuration property '{p1}', bool expected
de: Ungültiger Typ für Backup Konfigurations-Eigenschaft '{p1}', Boolean erwartet

# ERR_bkrs_215
source: Invalid type for backup configuration property '{p1}', number or string expected
de: Ungültiger Typ für Backup Konfigurations-Eigenschaft '{p1}', Zahl oder Text erwartet

# ERR_bkrs_216
source: Invalid value for backup configuration property '{p1}'
de: Ungültiger Wert für Backup Konfigurations-Eigenschaft '{p1}'

# ERR_bkrs_217
source: Backup folder {path} is not empty
de: Backup Ordner {path} ist nicht leer

# ERR_bkrs_218
source: Failed to open backup registry {path}
de: Backup Verzeichnis {path} konnte nicht geöffnet werden
