Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/BACKUPRESTOREFR.xlf
Languages: fr

# ERR_bkrs_100
source: Incompatible data store format (waExtra file found)
fr: Format de datastore non compatible (fichier waExtra trouvé)

# ERR_bkrs_200
source: Failed to retrieve journaling info
fr: Impossible de récupérer les informations du journal

# ERR_bkrs_201
source: Journal file not found: {Path}
fr: Fichier journal introuvable: {Path}

# ERR_bkrs_202
source: Failed to perform backup
fr: Impossible d'effectuer la copie de sauvegarde

# ERR_bkrs_203
source: Failed to create backup folder: {Path}
fr: Echec à la création du répertoire de sauvegarde : {Path}

# ERR_bkrs_204
source: Failed to backup journal
fr: Impossible d'effectuer une copie de sauvegarde du journal

# ERR_bkrs_205
source: Invalid journal path: {Path}
fr: Chemin d'accès au journal non valide : {Path}

# ERR_bkrs_206
source: Invalid backup folder: {Path}
fr: Répertoire de sauvegarde non valide : {Path}

# ERR_bkrs_207
source: Failed to backup data folder
fr: Impossible d'effectuer la copie de sauvegarde du répertoire de données

# ERR_bkrs_208
source: Next active journal path is invalid
fr: Le chemin d'accès du journal suivant non valide

# ERR_bkrs_209
source: Invalid backup settings
fr: Réglages de sauvegarde non valides

# ERR_bkrs_210
source: Failed to store backup manifest
fr: Impossible d'écrire le manifeste de sauvegarde

# ERR_bkrs_211
source: backup configuration property '{p1}' not found
fr: Propriété '{p1}' de la configuration de sauvegarde introuvable

# ERR_bkrs_212
source: Invalid type for backup configuration property '{p1}', Folder expected
fr: Type invalide pour la propriété de configuration de sauvegarde '{p1}', Folder attendu

# ERR_bkrs_213
source: Invalid type for backup configuration property '{p1}', String expected
fr: Type invalide pour la propriété de configuration de sauvegarde '{p1}', String attendu

# ERR_bkrs_214
source: Invalid type for backup configuration property '{p1}', bool expected
fr: Type invalide pour la propriété de configuration de sauvegarde '{p1}', bool attendu

# ERR_bkrs_215
source: Invalid type for backup configuration property '{p1}', number or string expected
fr: Type invalide pour la propriété de configuration de sauvegarde '{p1}', numérique ou chaine attendu

# ERR_bkrs_216
source: Invalid value for backup configuration property '{p1}'
fr: Type invalide pour la propriété de configuration de sauvegarde '{p1}'

# ERR_bkrs_217
source: Backup folder {path} is not empty
fr: Le répertoire de sauvegarde {path} n'est pas vide

# ERR_bkrs_218
source: Failed to open backup registry {path}
fr: Impossible d'ouvrir le registre de sauvegarde {path}
