Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DFR.xlf
Languages: fr

source: Compacting list of deleted records in table {p1}
fr: Compactage de la liste des enregistrements supprimés dans la table {p1}

source: Compact bit tables for segment {SegNum}
fr: Compactage de la table des bits du segment {SegNum}

source: Compacting index pages on {p1}
fr: Compactage des pages d’index de l'{p1}

source: Compacting index page addresses on {p1}
fr: Compactage des adresses des pages d’index de l'{p1}

source: Compacting list of deleted index pages on {p1}
fr: Compactage de la liste des pages d’index supprimés de l'{p1}

source: Compacting clusters on {p1}
fr: Compactage des clusters de l'{p1}

source: Compacting list of deleted clusters on {p1}
fr: Compactage de la liste des clusters supprimés de l'{p1}

source: Compacting index {p1}
fr: Compactage de l'index sur {p1}

source: Extra properties stream has been repaired
fr: Le flux des propriétés additionnelles a été réparé

source: The table of relations has been repaired
fr: La table des liens a été réparée

source: The index definition has been repaired
fr: La définition d’index a été réparée

source: Compacting records of table {p1}
fr: Compactage des enregistrements de la table {p1}

source: Compacting BLOBs of table {p1}
fr: Compactage des BLOBs de la table {p1}

source: Indexing
fr: Indexation
