Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DPT-*.xlf
Languages: pt_br

source: bit table # {param3} of directory # {param2}
pt_br: tabela de bits # {param3} do diretório # {param2}

source: auto sequence header # {param1}
pt_br: cabeçalho de sequencia automática # {param1}

source: data table header # {param1}
pt_br: cabeçalho tabela de dados # {param1}

source: index header # {param1}
pt_br: cabeçalho índice # {param1}

source: table definition # {param1}
pt_br: definição de tabela # {param1}

source: relation definition # {param1}
pt_br: definição de relação # {param1}

source: BLOB # {param1} of {TableName}
pt_br: BLOB # {param1} de {TableName}

source: record # {param1} of {TableName}
pt_br: registro # {param1} de {TableName}

source: address table
pt_br: tabela de endereços

source: records address table of {TableName}
pt_br: tabela de endereços dos registros de {TableName}

source: BLOBs address table of {TableName}
pt_br: tabela de endereços dos BLOBs de {TableName}

source: index address table of {IndexName}
pt_br: tabela de endereços dos índices de {IndexName}

source: clusters address table of {IndexName}
pt_br: tabela de endereços dos clusters de {IndexName}

source: extra property
pt_br: propriedade extra

source: index page # {param1} of {IndexName}
pt_br: página do índice # {param1} de {IndexName}

source: index cluster # {param1} of {IndexName}
pt_br: índice agrupado # {param1} de {IndexName}

source: part # {param2} of index cluster # {param1} of {IndexName}
pt_br: parte # {param2} do índice agrupado # {param1} de {IndexName}

# default_table_name
source: Table_{id}
pt_br: Tabela_{id}

# default_field_name
source: Field_{id}
pt_br: Campo_{id}

# default_many_to_one_name
source: Link_{id}
pt_br: Relacao_{id}

# default_one_to_many_name
source: Link_{id}_return
pt_br: Relacao_{id}_retorno

source: Compacting data table definitions
pt_br: Compactando as definições de tabelas de dados

source: Compacting chained list of deleted table definitions
pt_br: Compactando a lista encadeada de definições de tabelas eliminadas

source: Compacting index definitions
pt_br: Compactando as definições do índice

source: Compacting chained list of deleted index definitions
pt_br: Compactando lista encadeada de definições de índices eliminados

source: Compacting backup index definitions
pt_br: Compactando definições de índice de backup

source: Compacting chained list of deleted backup index definitions
pt_br: Compactando a lista encadeada de definições do índice de backup excluído

source: Compacting relation definitions
pt_br: Compactando as definições de relações

source: Compacting chained list of deleted relation definitions
pt_br: Compactando a lista encadeada de definições de relações eliminadas

source: Compacting auto sequence number definitions
pt_br: Compactando as definições da numeração automática

source: Compacting chained list of deleted auto sequence number definitions
pt_br: Compactando a lista encadeada de definições da numeração automática eliminada

source: Compacting data table headers
pt_br: Compactando cabeçalho da tabela de dados

source: Compacting chained list of deleted data table headers
pt_br: Compactando a lista encadeada de cabeçalhos de tabela de dados excluídos

source: Compacting BLOBs in table {p1}
pt_br: Compactando os BLOBs na tabela {p1}

source: Compacting list of deleted BLOBs in table {p1}
pt_br: Compactando a lista dos BLOBs excluídos na tabela {p1}

source: Compacting records in table {p1}
pt_br: Compactando registros na tabela {p1}

source: Compacting list of deleted records in table {p1}
pt_br: Compactando a lista de registros excluídos na tabela {p1}

source: Compact bit tables for segment {SegNum}
pt_br: Compactar tabelas de bit para o segmento {SegNum}

source: Compacting index pages on {p1}
pt_br: Compactando páginas de índice de {p1}

source: Compacting index page addresses on {p1}
pt_br: Compactando páginas de índice de {p1}

source: Compacting list of deleted index pages on {p1}
pt_br: Compactando lista de páginas de índice excluídas em {p1}

source: Compacting clusters on {p1}
pt_br: Compactando grupos (clusters) em {p1}

source: Compacting list of deleted clusters on {p1}
pt_br: Compactando a lista de grupos (clusters) excluídos em {p1}

source: Compacting index {p1}
pt_br: Compactando índice {p1}

source: Extra properties stream has been repaired
pt_br: O fluxo das propriedades adicionais foi reparado

source: The table of relations has been repaired
pt_br: A tabela de relações foi reparada

source: The index definition has been repaired
pt_br: A definição do índice foi reparada

source: Compacting records of table {p1}
pt_br: Compactação de registros da tabela {p1}

source: Compacting BLOBs of table {p1}
pt_br: Compactação de BLOBS de tabela {p1}

source: Indexing
pt_br: Indexação

source: Modify record
pt_br: Modificar registro

source: Delete record
pt_br: Excluir Registro

source: Start backup
pt_br: Iniciar backup
