Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DPT-*.xlf
Languages: pt_br

# ERR_dbmg_1181
source: Keys are not unique in index {IndexName}
pt_br: As chaves não são únicas no índice {IndexName}

# ERR_dbmg_1182
source: Cannot create log file for database {BaseName}
pt_br: Não é possível criar o arquivo de histórico para o banco {BaseName}

# ERR_dbmg_1183
source: Cannot write into log file of database {BaseName}
pt_br: Não é possível escrever no arquivo de histórico do banco de dados {BaseName}

# ERR_dbmg_1184
source: Cannot drop table {TableName} in database {BaseName}
pt_br: Não é possível excluir a tabela {TableName} no banco de dados {BaseName}

# ERR_dbmg_1185
source: Remote database cannot be opened
pt_br: Não é possível abrir o banco de dados remoto

# ERR_dbmg_1186
source: Log file cannot be integrated into database {BaseName}
pt_br: O arquivo histórico não pode ser integrado ao banco de dados {BaseName}

# ERR_dbmg_1187
source: Internal Computation on Set cannot be completed
pt_br: Não foi possível completar o cálculo interno no conjunto

# ERR_dbmg_1188
source: Array cannot be saved
pt_br: O array não pode ser salvo

# ERR_dbmg_1189
source: Array cannot be loaded
pt_br: O array não pode ser carregado

# ERR_dbmg_1190
source: Sequence number header cannot be loaded
pt_br: O número de sequência do cabeçalho não pode ser carregado

# ERR_dbmg_1191
source: Cannot select record
pt_br: Não é possível selecionar o registro

# ERR_dbmg_1192
source: Record cannot be created
pt_br: Não é possível criar o registro

# ERR_dbmg_1193
source: Cannot complete selection to array in table {TableName} of database {BaseName}
pt_br: Não é possível completar a seleção do array na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1194
source: Cannot complete array to selection in table {TableName} of database {BaseName}
pt_br: Não é possível completar o array da seleção na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1195
source: Cannot complete sequential sort
pt_br: Não é possível realizar a ordenação sequencial

# ERR_dbmg_1196
source: Selection cannot be locked
pt_br: Não é possível bloquear a seleção

# ERR_dbmg_1197
source: Index key cannot be loaded
pt_br: Não é possível carregar a chave do índice

# ERR_dbmg_1198
source: Index key cannot be saved
pt_br: Não é possível salvar a chave do índice

# ERR_dbmg_1199
source: Index key cannot be built
pt_br: Não é possível construir a chave do índice

# ERR_dbmg_1200
source: Query cannot be completed
pt_br: Não é possível completar a consulta

# ERR_dbmg_1201
source: Query cannot be analyzed
pt_br: Não é possível analisar a consulta

# ERR_dbmg_1202
source: Formula could not be processed on this column
pt_br: Não é possível processar a fórmula nesta coluna

# ERR_dbmg_1203
source: Query could not be completed
pt_br: Não é possível terminar a consulta

# ERR_dbmg_1204
source: Query could not be analyzed
pt_br: Não é possível analisar a consulta

# ERR_dbmg_1205
source: Could not get all distinct values of table {TableName} of database {BaseName}
pt_br: Não foi possível obter todos os valores distintos da tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1206
source: Cannot build array of values in table {TableName} of database {BaseName}
pt_br: Não é possível construir arrays de valores da tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1207
source: Selection cannot be loaded
pt_br: Não é possível carregar a seleção

# ERR_dbmg_1208
source: Cannot send data
pt_br: Não é possível enviar dados

# ERR_dbmg_1209
source: Cannot receive request reply
pt_br: Não é possível receber solicitação de resposta

# ERR_dbmg_1210
source: Cannot send request
pt_br: Não é possível enviar solicitude

# ERR_dbmg_1211
source: Cannot create connection
pt_br: Não é possível criar conexão

# ERR_dbmg_1212
source: Index {IndexName} cannot be quickly created in database {BaseName}
pt_br: O índice {IndexName} não pode ser criado rapidamente no banco de dados {BaseName}

# ERR_dbmg_1213
source: Cannot build distinct index keys
pt_br: Não é possível construir chaves de índices diferentes

# ERR_dbmg_1214
source: Selection cannot be sorted in table {TableName} of database {BaseName}
pt_br: A seleção não pode ser ordenada na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1215
source: Address table cannot loaded
pt_br: A tabela de endereços não pode ser carregada

# ERR_dbmg_1216
source: Address table cannot modified
pt_br: A tabela de endereços não pode ser modificada

# ERR_dbmg_1217
source: Cannot allocate new entry into address table
pt_br: Não é possível alocar uma nova entrada na tabela de endereços

# ERR_dbmg_1218
source: Cannot allocate free entry from address table
pt_br: Não é possível alocar uma entrada vazia da tabela de endereços

# ERR_dbmg_1219
source: Transaction temporary record cannot be saved
pt_br: Não é possível salvar o registro temporário da transação

# ERR_dbmg_1220
source: Transaction temporary blob cannot be saved
pt_br: Não é possível salvar o blob temporário da transação

# ERR_dbmg_1221
source: Transaction temporary record cannot be loaded
pt_br: Não é possível carregar o registro temporário da transação

# ERR_dbmg_1222
source: Transaction temporary blob cannot be loaded
pt_br: Não é possível carregar o blob temporário da transação

# ERR_dbmg_1223
source: Transaction cannot be started
pt_br: Não é possível iniciar a transação

# ERR_dbmg_1224
source: Transaction cannot be commited
pt_br: A transação não pode ser validada

# ERR_dbmg_1225
source: Cannot get extra property
pt_br: Não é possível ler a propriedade adicional

# ERR_dbmg_1226
source: Cannot set extra property
pt_br: Não é possível escrever a propiedade adicional

# ERR_dbmg_1227
source: Table name is already used
pt_br: O nome da tabela já foi utilizado

# ERR_dbmg_1228
source: Cannot get list of NULL keys from index {IndexName}
pt_br: Não é possível ler a lista de chaves NULL do índice {IndexName}

# ERR_dbmg_1229
source: Cannot modify list of NULL keys of index {IndexName}
pt_br: Não é possível modificar a lista de chaves NULAS do índice {IndexName}

# ERR_dbmg_1230
source: Invalid key for index {IndexName}
pt_br: Chave incorreta para o índice {IndexName}

# ERR_dbmg_1231
source: Cannot set log file
pt_br: Não é possível escrever o arquivo de histórico

# ERR_dbmg_1232
source: Context is NULL
pt_br: O contexto é NULL

# ERR_dbmg_1233
source: Database {BaseName} cannot be locked
pt_br: O banco de dados {BaseName} não pode ser bloqueado

# ERR_dbmg_1234
source: Wrong field reference in record# {RecNum} of table: {TableName} of database: {BaseName}
pt_br: Referência de campo incorreta no registro# {RecNum} da tabela: {TableName} do banco de dados: {BaseName}

# ERR_dbmg_1235
source: Wrong field reference in table: {TableName} of database: {BaseName}
pt_br: Referência de campo incorreta na tabela: {TableName} do banco de dados: {BaseName}

# ERR_dbmg_1236
source: Cannot read data from temporary transaction file
pt_br: Não é possível ler os dados do arquivo de transações temporais

# ERR_dbmg_1237
source: Cartesian Product failed
pt_br: O produto cartesiano falhou

# ERR_dbmg_1238
source: Cannot merge selections
pt_br: Não é possível mesclar seleções

# ERR_dbmg_1239
source: The format of the {BaseName} database cannot be upgraded in read only mode
pt_br: O formato do banco de dados {BaseName} não pode ser atualizado em modo leitura

# ERR_dbmg_1240
source: Wrong Header
pt_br: Cabeçalho incorreto

# ERR_dbmg_1241
source: Wrong CheckSum
pt_br: CheckSum incorreto

# ERR_dbmg_1243
source: Cannot load data tables of database: {BaseName}
pt_br: Não é possível carregar as tabelas de dados do banco de dados: {BaseName}

# ERR_dbmg_1244
source: The list of foreign key constraints is not empty for table: {TableName} of database: {BaseName}
pt_br: A lista de restrições de chaves estrangeiras não está vazia para a tabela: {TableName} do banco de dados: {BaseName}

# ERR_dbmg_1245
source: Address entry is not empty
pt_br: A entrada do endereço não está vazia

# ERR_dbmg_1246
source: Cannot pre-allocate address
pt_br: Não é possível pré-alocar endereços

# ERR_dbmg_1247
source: Cannot update new record in table {TableName} of database {BaseName}
pt_br: Não é possível atualizar o novo registro na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1248
source: Cannot save new record in table {TableName} of database {BaseName}
pt_br: Não é possível salvar o novo registro na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1249
source: Cannot save subrecord
pt_br: Não é possível salvar o subregistro

# ERR_dbmg_1250
source: Cannot save record
pt_br: Não é possível salvar o registro

# ERR_dbmg_1251
source: Cannot lock structure object definition
pt_br: Não é possível bloquear a definição de objeto de estrutura

# ERR_dbmg_1252
source: Cannot unlock structure object definition
pt_br: Não é possível desbloquear a definição de objeto de estrutura

# ERR_dbmg_1253
source: Invalid relation number
pt_br: Número inválido de relação

# ERR_dbmg_1254
source: Circular Reference in records address table of table {TableName} of database {BaseName}
pt_br: Referência circular da tabela de endereços nos registros da tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1255
source: Circular Reference in blobs address table of table {TableName} of database {BaseName}
pt_br: Referência circular da tabela de endereços nos BLOBs da tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1256
source: Duplicated Schema Name in database {BaseName}
pt_br: Nome de esquema duplicado no banco {BaseName}

# ERR_dbmg_1257
source: Schema cannot be saved in database {BaseName}
pt_br: Não é possível salvar o esquema no banco {BaseName}

# ERR_dbmg_1258
source: Schema cannot be deleted in database {BaseName}
pt_br: Não é possível eliminar o esquema no banco {BaseName}

# ERR_dbmg_1259
source: Schema cannot be renamed in database {BaseName}
pt_br: Não é possível renomear o esquema no banco {BaseName}

# ERR_dbmg_1260
source: Selected log file is too recent for database {BaseName}
pt_br: O histórico selecionado é muito recente para o banco {BaseName}

# ERR_dbmg_1261
source: Selected log file is too old for database {BaseName}
pt_br: O histórico selecionado é muito antigo para o banco {BaseName}

# ERR_dbmg_1262
source: Some DataTables do not have matching table definitions for database {BaseName}
pt_br: Algumas tabelas de dados não tem uma tabela de definições correspondentes para o banco (BaseName)

# ERR_dbmg_1263
source: Given stamp does not match current one for record# {RecNum} of table {TableName}
pt_br: O selo dado não corresponde ao atual do registro# "{RecNum}" de tabela "{TableName}"

# ERR_dbmg_1264
source: A primary key is needed and missing in table {TableName}
pt_br: Uma chave primária é necessária e não foi encontrada na tabela "{TableName}"

# ERR_dbmg_1265
source: Invalid field
pt_br: Campo inválido

# ERR_dbmg_1266
source: Unknown field type (this version of 4D is perhaps too old)
pt_br: Tipo de campo desconhecido (talvez esta versão de 4D seja muito antiga)

# ERR_dbmg_1267
source: Stack Overflow
pt_br: Estouro de pilha

# ERR_dbmg_1268
source: DataTable cannot be regenerated for database {BaseName}
pt_br: La tabla de datos no puede regenerarse para la base {BaseName}

# ERR_dbmg_1269
source: DataTable cannot be found
pt_br: A tabela de dados não pode ser encontrada

# ERR_dbmg_1270
source: Missing structure could not be rebuild
pt_br: A estrutura que falta não pode ser reconstruída

# ERR_dbmg_1271
source: Invalid REST request handler
pt_br: Controlador de pedidos REST inválido

# ERR_dbmg_1272
source: Some records are still locked in table {tableName} in database {BaseName}
pt_br: Alguns registros da tabela {tableName} no banco {BaseName} seguem bloqueados

# ERR_dbmg_1273
source: Cannot drop table {TableName} in database {BaseName}
pt_br: Não é possível excluir a tabela {TableName} no banco {BaseName}

# ERR_dbmg_1274
source: The current journal file of database {BaseName} is not available. For data security reasons, write operations are stopped. Please contact your administrator as soon as possible.
pt_br: O arquivo de histórico atual do banco {BaseName} não está disponível. Por razões de segurança as operações de escrita estão detidas. Por favor, entre em contato com seu administrador o mais rápido possível.

# ERR_dbmg_1275
source: "(" is missing at the beginning of the Javascript statement in this query.
pt_br: Falta "(" ao início da instrução Javascript nesta petição.

# ERR_dbmg_1276
source: Datastream has an invalid header.
pt_br: O fluxo de dados tem um cabeçalho inválido.

# ERR_dbmg_1277
source: The database journal integration failed at entry# {Param1} (operation id {Param2}).
pt_br: A integração do arquivo de histórico falhou na entrada # {p1} (operação número {Param2}).

# ERR_dbmg_1278
source: Javascript code not allowed in the query.
pt_br: Javascript não é permitido no pedido.

# ERR_dbmg_1279
source: The query placeholder {Param1} is missing or null.
pt_br: O contentor de pesquisa {Param1} está ausente ou nulo

# ERR_dbmg_1280
source: The query placeholder {Param1} is not a valid type.
pt_br: O tipo do contentor de pesquisa {Param1} é inválido.

# ERR_dbmg_1281
source: Table {TableName} needs a primary key in order to be logged.
pt_br: A tabela {TableName} precisa de uma chave primária, a fim de ser registrada no histórico.

# ERR_dbmg_1282
source: Cannot find any record with that primary key in table {TableName}.
pt_br: Não foi possível encontrar qualquer registro com a chave primária na tabela {TableName}.

# ERR_dbmg_1283
source: A primary key definition is missing for table {TableName}.
pt_br: Não existe uma definição de chave primária da tabela {TableName}.

# ERR_dbmg_1284
source: The given primary key of table {TableName} is malformed.
pt_br: A chave primária da tabela {TableName} é incorreta.

# ERR_dbmg_1285
source: Non-unique primary key found in table {TableName}.
pt_br: A chave primária da tabela {TableName} não é única.

# ERR_dbmg_1286
source: Null primary key found in table {TableName}.
pt_br: Chave primária nula encontrada na tabela {TableName}.

# ERR_dbmg_1287
source: Log file was created with an older version of the database {BaseName}
pt_br: O histórico foi criado com uma versão mais antiga do banco de dados {BaseName}

# ERR_dbmg_1288
source: Constraints on database {BaseName} cannot be disabled while journaling is active.
pt_br: As restrições no banco de dados {BaseName} não pode ser desativado enquanto o historial é ativo.

# ERR_dbmg_1289
source: A destination folder was not chosen to record the database journal for {BaseName}.
pt_br: A pasta de destino para gravar o histórico de banco de dados {BaseName} não foi escolhida.

# ERR_dbmg_1290
source: Cannot open the database journal for {BaseName}.
pt_br: Não é possível abrir o histórico do banco de dados {BaseName}.

# ERR_dbmg_1300
source: Invalid Selection Type
pt_br: Tipo de seleção inválida

# ERR_dbmg_1301
source: Array is too big
pt_br: Array é muito grande

# ERR_dbmg_1302
source: Array size does not match
pt_br: Tamanho de Array não corresponde

# ERR_dbmg_1303
source: Invalid Selection ID
pt_br: ID de seleção inválido

# ERR_dbmg_1304
source: Invalid Selection Part
pt_br: Parte de seleção inválido

# ERR_dbmg_1550
source: Script statement is empty
pt_br: Instrução de script vazia

# ERR_dbmg_1551
source: Script kind is missing
pt_br: Falta o tipo de script

# ERR_dbmg_1552
source: Script kind is unknown
pt_br: Tipo de script desconhecido

# ERR_dbmg_1553
source: Wrong permission reference
pt_br: Referência de permissão errada

# ERR_dbmg_1555
source: Users and Groups directory is missing
pt_br: Falta o diretório de usuários e grupos

# ERR_dbmg_1562
source: JavaScript execution error
pt_br: Erro de execução do JavaScript

# ERR_dbmg_1563
source: Method name is missing
pt_br: Falta o nome do método

# ERR_dbmg_1564
source: Method type is invalid
pt_br: Tipo de método inválido

# ERR_dbmg_1565
source: Method definition is invalid
pt_br: Definição de método inválida

# ERR_dbmg_1566
source: Method statement is empty
pt_br: Instrução do método está vazia

# ERR_dbmg_1567
source: Method parameter name is invalid
pt_br: Nome do parâmetro do método inválido

# ERR_dbmg_1570
source: Entity fails validation
pt_br: A entidade falhou a validação

# ERR_dbmg_1571
source: Value does not match the "{Param1}" pattern
pt_br: Valor não corresponde ao padrão "{Param1}"

# ERR_dbmg_1572
source: The "{Param1}" datastore class name already exists
pt_br: O nome de tabela "{Param1}" já existe

# ERR_dbmg_1573
source: The "{Param1}" method name is unknown
pt_br: O nome do método "{Param1}" é desconhecido

# ERR_dbmg_1576
source: The relation based on "{Param1}" is not N-to-1
pt_br: A relação baseada em "{Param1}" não é N para 1

# ERR_dbmg_1577
source: The relation based on "{Param1}" is not 1-to-N
pt_br: A relação baseada em "{Param1}" não é 1 para N

# ERR_dbmg_1578
source: The {Param1} attribute is not a relation attribute
pt_br: O atributo {Param1} não é um atributo de relação

# ERR_dbmg_1579
source: "{Param1}" is not a valid relation
pt_br: "{Param1}" não é uma relação válida

# ERR_dbmg_1580
source: The relation path is empty
pt_br: A rota da relação está vazia

# ERR_dbmg_1581
source: Cannot resolve "{Param1}" as a relation path
pt_br: Não é possível resolver "{Param1}" como uma rota de relação

# ERR_dbmg_1582
source: Event's kind is missing or invalid
pt_br: O tipo do evento falta ou é inválido

# ERR_dbmg_1583
source: Event's method is missing or invalid
pt_br: O método do evento falta ou é inválido

# ERR_dbmg_1584
source: Alias attributes can only return scalar values
pt_br: Os atributos alias só podem devolver os valores escalares

# ERR_dbmg_1585
source: An error occurred during JavaScript execution
pt_br: Ocorreu um erro durante a execução JavaScript

# ERR_dbmg_1586
source: Not a valid entity collection
pt_br: Esta não é uma coleção de entidades válida

# ERR_dbmg_1587
source: The entity collections come from incompatible datastore classes
pt_br: As coleções de entidades vêm de classes de dados incompatíveis

# ERR_dbmg_1588
source: The "{Param1}" attribute is duplicated
pt_br: O atributo "{Param1}" está duplicado

# ERR_dbmg_1589
source: The "{Param1}" attribute is from another datastore class
pt_br: O atributo "{Param1}" é de outra classe de dados

# ERR_dbmg_1594
source: The "{Param1}" attribute in the "{EntityModelName}" datastore class cannot be used for sorting
pt_br: O atributo "{Param1}" na classe "{EntityModelName}" não pode ser usado para ordenar

# ERR_dbmg_1595
source: The "{Param1}" remote datastore class cannot be created locally
pt_br: A classe "{Param1}" não pode ser criada localmente

# ERR_dbmg_1596
source: The command "addRemoteStore" or "openRemoteStore" cannot be used in that context
pt_br: Os comandos "addRemoteStore" ou "openRemoteStore" não podem ser utilizados neste contexto

# ERR_dbmg_1597
source: The remote catalog log file is missing.
pt_br: O arquivo de log do catálogo remoto está ausente.

# ERR_dbmg_1610
source: A remote request to host: "{Param1}" has failed
pt_br: Um pedido remoto para o host: "{Param1}" falhou

# ERR_dbmg_1611
source: You must log into the Admin group to obtain information regarding your project.
pt_br: Você deve fazer login para o grupo de administração para obter informações sobre o seu projeto.

# ERR_dbmg_1806
source: URL is not well formed
pt_br: A URL não está bem formada

# ERR_dbmg_1807
source: Received a '&' and was expecting a '?' in the URL
pt_br: Recebeu um '&' e espera de um '?' na URL

# ERR_dbmg_1808
source: Opening single quote does not have a matching closing one in the URL
pt_br: Faltam as aspas simples de fechamento correspondente na URL

# ERR_dbmg_1809
source: Opening double quote does not have a matching closing one in the URL
pt_br: Faltam as aspas duplas de fechamento correspondente na URL

# ERR_dbmg_1810
source: Cannot order by "{Param1}" for the "{Param2}" datastore class
pt_br: Não é possível ordenar por "{Param1}" para a classe de armazenamento "{Param2}"

# ERR_dbmg_1811
source: "{Param1}" is an unknown REST keyword
pt_br: "{Param1}" é uma palavra chave REST desconhecida

# ERR_dbmg_1812
source: "{Param1}" is an unknown REST method
pt_br: "{Param1}" é um método REST desconhecido

# ERR_dbmg_1813
source: "{Param1}" REST method is not applicable here
pt_br: "{Param1}" O método REST não aplica aqui

# ERR_dbmg_1815
source: "$subentityset" cannot be applied to the REST request
pt_br: "$subentityset" não se pode aplicar ao pedido REST

# ERR_dbmg_1816
source: At least one attribute must be specified
pt_br: Pelo menos um atributo deve ser especificado

# ERR_dbmg_1817
source: "{Param1}" is not a valid compute action
pt_br: "{Param1}" não é uma ação válida de cálculo

# ERR_dbmg_1818
source: "{Param1}" is not a valid logical operator
pt_br: "{Param1}" n’est pas un opérateur logique valide

# ERR_dbmg_1819
source: Second collection reference is missing
pt_br: A segunda referência da coleção está faltando

# ERR_dbmg_1820
source: "{Param1}" is not a valid collection reference
pt_br: "{Param1}" não é uma referência válida de coleção

# ERR_dbmg_1821
source: "{Param1}" is not a valid transaction command
pt_br: "{Param1}" não é um comando válido transação

# ERR_dbmg_1822
source: REST login failed
pt_br: Erro na conexão REST

# ERR_dbmg_1823
source: Maximum number of sessions has been reached
pt_br: Foi alcançado o número máximo de sessões

# ERR_dbmg_3000
source: The replication database is not valid
pt_br: O banco de dados de replicação não é válido

# ERR_dbmg_3001
source: The replication database is missing a table and is not valid
pt_br: Falta uma tabela no banco de dados de replicação e não é válido

source: Fully wrong
pt_br: Totalmente incorreto

source: Partially wrong
pt_br: Parcialmente incorreto

source: Invalid checksum
pt_br: CheckSum incorreto

source: Invalid header
pt_br: Cabeçalho incorreto

source: Invalid header version
pt_br: Versão de cabeçalho incorreto

source: Data segment directory header is invalid
pt_br: O cabeçalho do diretório do segmento de dados é incorreto

source: Data segment end of file is invalid
pt_br: O final do arquivo de segmento de dados é incorreto

source: Address of primary directory of bit table is invalid
pt_br: O endereço do diretório primário da tabela de bits é incorreto

source: Primary directory of bit table is invalid
pt_br: O diretório primário da tabela de bits é incorreto

source: Address of secondary directory of bit table is invalid
pt_br: O endereço do diretório secundário da tabela de bits é incorreto

source: Secondary directory of bit table is invalid
pt_br: O diretório secundário da tabela de bits é incorreto

source: Address of bit table is invalid
pt_br: O endereço da tabela de bits é incorreto

source: Bit table is invalid
pt_br: A tabela de bits é incorreta

source: Cannot open data segment
pt_br: Não é possível abrir o segmento de dados

source: Directory of data tables is invalid
pt_br: O diretório de tabelas de dados é incorreto

source: Number of records is invalid
pt_br: O número de registros é incorreto

source: Address of primary directory of record addresses is invalid
pt_br: O endereço do diretório primário de endereços de registros é incorreto

source: List of deleted records is invalid
pt_br: A lista de registros eliminados é incorreta

source: Number of BLOBs is invalid
pt_br: O número de BLOBs é incorreto

source: Address of primary directory of BLOBs addresses is invalid
pt_br: O endereço do diretório primário de endereços de BLOBs é incorreto

source: List of deleted BLOBs is invalid
pt_br: A lista de BLOBs eliminados é incorreta

source: Address of record address directory is invalid
pt_br: O endereço do diretório de endereços de registros é incorreto
