Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DES.xlf
Languages: es

source: Compacting chained list of deleted backup index definitions
es: Compactando la lista encadenada de definiciones del índice de backup borrado

source: Compacting relation definitions
es: Compactando las definiciones de relaciones

source: Compacting chained list of deleted relation definitions
es: Compactando la lista encadenada de definiciones de relaciones eliminadas

source: Compacting auto sequence number definitions
es: Compactando las definiciones de la numeración automática

source: Compacting chained list of deleted auto sequence number definitions
es: Compactando la lista encadenada de definiciones de la numeración automática eliminada

source: Compacting data table headers
es: Compactando encabezados de la tabla de datos

source: Compacting chained list of deleted data table headers
es: Compactando la lista encadenada de encabezados de tabla de datos borrados

source: Compacting BLOBs in table {p1}
es: Compactando los BLOBs en la tabla {p1}

source: Compacting list of deleted BLOBs in table {p1}
es: Compactando la lista de los BLOBs borrados en la tabla {p1}

source: Compacting records in table {p1}
es: Compactando registros en la tabla {p1}

source: Compacting list of deleted records in table {p1}
es: Compactando la lista de registros borrados en la tabla {p1}

source: Compact bit tables for segment {SegNum}
es: Compact tablas de bit para el segmento {SegNum}

source: Compacting index pages on {p1}
es: Compactando páginas de índice de {p1}

source: Compacting index page addresses on {p1}
es: Compactando páginas de indice de {p1}

source: Compacting list of deleted index pages on {p1}
es: Compactando lista de páginas de índice borradas en {p1}

source: Compacting clusters on {p1}
es: Compactando grupos (clusters) en {p1}

source: Compacting list of deleted clusters on {p1}
es: Compactando la lista de grupos (clusters) borrados en {p1}

source: Compacting index {p1}
es: Compactando índice {p1}

source: Extra properties stream has been repaired
es: El flujo de las propiedades adicionales ha sido reparado

source: The table of relations has been repaired
es: La table de relaciones ha sido reparada

source: The index definition has been repaired
es: La definición del índice ha sido reparada

source: Compacting records of table {p1}
es: Compactación de registros en la tabla "{p1}"

source: Compacting BLOBs of table {p1}
es: Compactación de BLOBs en la tabla "{p1}"

source: Indexing
es: Indexación

source: Modify record
es: Modificar registro

source: Delete record
es: Eliminar Registro

source: Start backup
es: Iniciar el backup
