Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DFR.xlf
Languages: fr

# ERR_dbmg_1186
source: Log file cannot be integrated into database {BaseName}
fr: Le fichier d'historique ne peut pas être intégré à la base {BaseName}

# ERR_dbmg_1187
source: Internal Computation on Set cannot be completed
fr: L'opération interne sur l'ensemble est incomplète

# ERR_dbmg_1188
source: Array cannot be saved
fr: Le tableau ne peut pas être sauvegardé

# ERR_dbmg_1189
source: Array cannot be loaded
fr: Le tableau ne peut pas être chargé

# ERR_dbmg_1190
source: Sequence number header cannot be loaded
fr: L'en-tête du numéro de séquence ne peut pas être chargé

# ERR_dbmg_1191
source: Cannot select record
fr: Impossible de sélectionner l'enregistrement

# ERR_dbmg_1192
source: Record cannot be created
fr: L'enregistrement ne peut pas être créé

# ERR_dbmg_1193
source: Cannot complete selection to array in table {TableName} of database {BaseName}
fr: Impossible d'accomplir sélection vers tableau de la table {TableName} de la base {BaseName}

# ERR_dbmg_1194
source: Cannot complete array to selection in table {TableName} of database {BaseName}
fr: Impossible d'accomplir tableau vers sélection de la table {TableName} de la base {BaseName}

# ERR_dbmg_1195
source: Cannot complete sequential sort
fr: Impossible d'accomplir le tri séquentiel

# ERR_dbmg_1196
source: Selection cannot be locked
fr: La sélection ne peut pas être verrouilée

# ERR_dbmg_1197
source: Index key cannot be loaded
fr: La clé d'index ne peut pas être chargée

# ERR_dbmg_1198
source: Index key cannot be saved
fr: La clé d'index ne peut pas être sauvegardée

# ERR_dbmg_1199
source: Index key cannot be built
fr: La clé d'index ne peut pas être construite

# ERR_dbmg_1200
source: Query cannot be completed
fr: La requête ne peut pas se terminer

# ERR_dbmg_1201
source: Query cannot be analyzed
fr: La requête ne peut pas être analysée

# ERR_dbmg_1202
source: Formula could not be processed on this column
fr: La formule n'a pas pu être effectuée sur cette colonne

# ERR_dbmg_1203
source: Query could not be completed
fr: La requête n’a pas pu se terminer

# ERR_dbmg_1204
source: Query could not be analyzed
fr: La requête n’a pas pu être analysée

# ERR_dbmg_1205
source: Could not get all distinct values of table {TableName} of database {BaseName}
fr: Impossible d'obtenir toutes les valeurs distinctes de la table {TableName} de la base {BaseName}

# ERR_dbmg_1206
source: Cannot build array of values in table {TableName} of database {BaseName}
fr: Impossible de construire le tableau de valeurs de la table {TableName} de la base {BaseName}

# ERR_dbmg_1207
source: Selection cannot be loaded
fr: La sélection ne peut pas être chargée

# ERR_dbmg_1208
source: Cannot send data
fr: Impossible d'envoyer les données

# ERR_dbmg_1209
source: Cannot receive request reply
fr: Impossible de recevoir la réponse de la requête

# ERR_dbmg_1210
source: Cannot send request
fr: Impossible d'envoyer une requête

# ERR_dbmg_1211
source: Cannot create connection
fr: Impossible de créer une connexion

# ERR_dbmg_1212
source: Index {IndexName} cannot be quickly created in database {BaseName}
fr: L'index {IndexName} ne peut pas être créé rapidement dans la base {BaseName}

# ERR_dbmg_1213
source: Cannot build distinct index keys
fr: Impossible de construire les clés d'index distinctes

# ERR_dbmg_1214
source: Selection cannot be sorted in table {TableName} of database {BaseName}
fr: La sélection ne peut pas être triée dans la table {TableName} de la base {BaseName}

# ERR_dbmg_1215
source: Address table cannot loaded
fr: La table d'adresse ne peut pas être chargée

# ERR_dbmg_1216
source: Address table cannot modified
fr: La table d'adresse ne peut pas être modifiée

# ERR_dbmg_1217
source: Cannot allocate new entry into address table
fr: Impossible d'allouer une nouvelle entrée à la table d'adresse

# ERR_dbmg_1218
source: Cannot allocate free entry from address table
fr: Impossible d'allouer une entrée vide de la table d'adresse

# ERR_dbmg_1219
source: Transaction temporary record cannot be saved
fr: L'enregistrement temporaire de transaction ne peut pas être sauvegardé

# ERR_dbmg_1220
source: Transaction temporary blob cannot be saved
fr: Le blob temporaire de transaction ne peut pas être sauvegardé

# ERR_dbmg_1221
source: Transaction temporary record cannot be loaded
fr: L'enregistrement temporaire de transaction ne peut pas être chargé

# ERR_dbmg_1222
source: Transaction temporary blob cannot be loaded
fr: Le blob temporaire de transaction ne peut pas être chargé

# ERR_dbmg_1223
source: Transaction cannot be started
fr: La transaction ne peut pas être démarrée

# ERR_dbmg_1224
source: Transaction cannot be commited
fr: La transaction ne peut pas être validée

# ERR_dbmg_1225
source: Cannot get extra property
fr: Impossible de lire la propriété additionnelle

# ERR_dbmg_1226
source: Cannot set extra property
fr: Impossible d'écrire la propriété additionnelle

# ERR_dbmg_1227
source: Table name is already used
fr: Le nom de la table est déjà utilisé

# ERR_dbmg_1228
source: Cannot get list of NULL keys from index {IndexName}
fr: Impossible de lire la liste des clés NULL de l'index {IndexName}

# ERR_dbmg_1229
source: Cannot modify list of NULL keys of index {IndexName}
fr: Impossible de modifier la liste des clés NULL de l'index {IndexName}

# ERR_dbmg_1230
source: Invalid key for index {IndexName}
fr: Clé invalide pour l'index {IndexName}

# ERR_dbmg_1231
source: Cannot set log file
fr: Impossible d'écrire le fichier d'historique

# ERR_dbmg_1232
source: Context is NULL
fr: Le contexte est NULL

# ERR_dbmg_1233
source: Database {BaseName} cannot be locked
fr: La base {BaseName} ne peut pas être verrouillée

# ERR_dbmg_1234
source: Wrong field reference in record# {RecNum} of table: {TableName} of database: {BaseName}
fr: Référence de champ incorrecte dans l'enregistrement# {RecNum} de la table : {TableName} de la base : {BaseName}

# ERR_dbmg_1235
source: Wrong field reference in table: {TableName} of database: {BaseName}
fr: Référence de champ incorrecte dans la table : {TableName} de la base : {BaseName}

# ERR_dbmg_1236
source: Cannot read data from temporary transaction file
fr: Impossible de lire les données du fichier de transaction temporaire

# ERR_dbmg_1237
source: Cartesian Product failed
fr: Le produit cartésien échoué

# ERR_dbmg_1238
source: Cannot merge selections
fr: Impossible de fusionner sélections

# ERR_dbmg_1239
source: The format of the {BaseName} database cannot be upgraded in read only mode
fr: Le format de la base {BaseName} ne peut pas être mis à jour en mode lecture seulement

# ERR_dbmg_1240
source: Wrong Header
fr: En-tête incorrect

# ERR_dbmg_1241
source: Wrong CheckSum
fr: CheckSum incorrect

# ERR_dbmg_1243
source: Cannot load data tables of database: {BaseName}
fr: Impossible de charger la table des données de la base : {BaseName}

# ERR_dbmg_1244
source: The list of foreign key constraints is not empty for table: {TableName} of database: {BaseName}
fr: La liste de contraintes des clés étrangères n'est pas vide pour la table : {TableName}dans la base : {BaseName}

# ERR_dbmg_1245
source: Address entry is not empty
fr: L'entrée d'adresse n'est pas vide

# ERR_dbmg_1246
source: Cannot pre-allocate address
fr: Impossible de pré-allouer l'adresse

# ERR_dbmg_1247
source: Cannot update new record in table {TableName} of database {BaseName}
fr: Impossible de mettre à jour le nouvel enregistrement dans la table {TableName} de la base {BaseName}

# ERR_dbmg_1248
source: Cannot save new record in table {TableName} of database {BaseName}
fr: Impossible de sauvegarder le nouvel enregistrement dans la table {TableName} de la base {BaseName}

# ERR_dbmg_1249
source: Cannot save subrecord
fr: Impossible de sauvegarder le sous-enregistrement

# ERR_dbmg_1250
source: Cannot save record
fr: Impossible de sauvegarder l'enregistrement

# ERR_dbmg_1251
source: Cannot lock structure object definition
fr: Impossible de verrouiller la définition de l'objet de structure

# ERR_dbmg_1252
source: Cannot unlock structure object definition
fr: Impossible de déverrouiller la définition de l'objet de structure

# ERR_dbmg_1253
source: Invalid relation number
fr: Numéro de lien invalide

# ERR_dbmg_1254
source: Circular Reference in records address table of table {TableName} of database {BaseName}
fr: Référence circulaire de la table d'adresse des enregistrements de la table {TableName} de la base {BaseName}

# ERR_dbmg_1255
source: Circular Reference in blobs address table of table {TableName} of database {BaseName}
fr: Référence circulaire dans la table d'adresse des blobs de la table {TableName} de la base {BaseName}

# ERR_dbmg_1256
source: Duplicated Schema Name in database {BaseName}
fr: Nom de schéma dupliqué dans la base {BaseName}

# ERR_dbmg_1257
source: Schema cannot be saved in database {BaseName}
fr: Le schéma ne peut être sauvegardé dans la base {BaseName}

# ERR_dbmg_1258
source: Schema cannot be deleted in database {BaseName}
fr: Le schéma ne peut être supprimé dans la base {BaseName}

# ERR_dbmg_1259
source: Schema cannot be renamed in database {BaseName}
fr: Le schéma ne peut être renommé dans la base {BaseName}

# ERR_dbmg_1260
source: Selected log file is too recent for database {BaseName}
fr: Le fichier d'historique est trop récent pour la base {BaseName}

# ERR_dbmg_1261
source: Selected log file is too old for database {BaseName}
fr: Le fichier d'historique est trop ancien pour la base {BaseName}

# ERR_dbmg_1262
source: Some DataTables do not have matching table definitions for database {BaseName}
fr: Certaines DataTables n'ont pas de définitions de tables correspondantes dans la base de données {BaseName}

# ERR_dbmg_1263
source: Given stamp does not match current one for record# {RecNum} of table {TableName}
fr: Le marqueur fourni ne correspond pas à celui de l'enregistrement# {RecNum} de la table {TableName}

# ERR_dbmg_1264
source: A primary key is needed and missing in table {TableName}
fr: Une clé primaire est nécessaire et est manquante dans la table {TableName}

# ERR_dbmg_1265
source: Invalid field
fr: Champ invalide

# ERR_dbmg_1266
source: Unknown field type (this version of 4D is perhaps too old)
fr: Type de champ inconnu (cette version de 4D est peut-être trop ancienne)

# ERR_dbmg_1267
source: Stack Overflow
fr: Dépassement de la capacité de la pile

# ERR_dbmg_1268
source: DataTable cannot be regenerated for database {BaseName}
fr: La table ne peut pas être régénérée pour la base {BaseName}

# ERR_dbmg_1269
source: DataTable cannot be found
fr: La table ne peut pas être trouvée

# ERR_dbmg_1270
source: Missing structure could not be rebuild
fr: La structure manquante ne peut pas être recréée

# ERR_dbmg_1271
source: Invalid REST request handler
fr: Gestionnaire de requête REST invalide

# ERR_dbmg_1272
source: Some records are still locked in table {tableName} in database {BaseName}
fr: Certains enregistrements de la table {tableName} sont encore verrouillés dans la base {BaseName}

# ERR_dbmg_1273
source: Cannot drop table {TableName} in database {BaseName}
fr: Impossible de supprimer la table {TableName} dans la base {BaseName}

# ERR_dbmg_1274
source: The current journal file of database {BaseName} is not available. For data security reasons, write operations are stopped. Please contact your administrator as soon as possible.
fr: Le fichier d’historique de la base {BaseName} n’est pas disponible. Pour des raisons de sécurité des données, les opérations d’écriture sont interrompues. Veuillez contacter votre administrateur dès que possible.

# ERR_dbmg_1275
source: "(" is missing at the beginning of the Javascript statement in this query.
fr: "(" est manquante au début de l’expression Javascript dans cette requête.

# ERR_dbmg_1276
source: Datastream has an invalid header.
fr: Datastream a un en-tête invalide.

# ERR_dbmg_1277
source: The database journal integration failed at entry# {Param1} (operation id {Param2}).
fr: L'intégration du fichier d'historique de la base a échoué à l'entrée# {Param1} (opération numéro {Param2}).

# ERR_dbmg_1278
source: Javascript code not allowed in the query.
fr: Code Javascript non autorisé dans cette requête.

# ERR_dbmg_1280
source: The query placeholder {Param1} is not a valid type.
fr: Le type du placeholder {Param1} de la requête est invalide.

# ERR_dbmg_1281
source: Table {TableName} needs a primary key in order to be logged.
fr: La table {TableName} a besoin d’une clé primaire pour être journalisée.

# ERR_dbmg_1282
source: Cannot find any record with that primary key in table {TableName}.
fr: Il n’y a pas d’enregistrement avec cette clé primaire dans la table {TableName}.

# ERR_dbmg_1283
source: A primary key definition is missing for table {TableName}.
fr: Une définition de la clé primaire est manquante dans la table {TableName}.

# ERR_dbmg_1284
source: The given primary key of table {TableName} is malformed.
fr: La clé primaire de la table {TableName} est malformée.

# ERR_dbmg_1285
source: Non-unique primary key found in table {TableName}.
fr: Non unique clé primaire trouvé dans la table {TableName}.

# ERR_dbmg_1286
source: Null primary key found in table {TableName}.
fr: Clé primaire null trouvée dans la table {TableName}.

# ERR_dbmg_1287
source: Log file was created with an older version of the database {BaseName}
fr: Le fichier d'historique a été créé avec une ancienne version de la base de données {BaseName}

# ERR_dbmg_1288
source: Constraints on database {BaseName} cannot be disabled while journaling is active.
fr: Les contraintes sur la base de données {BaseName} ne peuvent pas être désactivées tant que la journalisation est activée.

# ERR_dbmg_1300
source: Invalid Selection Type
fr: Type de sélection invalide

# ERR_dbmg_1301
source: Array is too big
fr: Le tableau est trop grand

# ERR_dbmg_1302
source: Array size does not match
fr: La taille du tableau ne correspond pas

# ERR_dbmg_1303
source: Invalid Selection ID
fr: ID de la sélection invalide

# ERR_dbmg_1304
source: Invalid Selection Part
fr: Partie de la sélection invalide

# ERR_dbmg_1576
source: The relation based on "{Param1}" is not N-to-1
fr: Le lien basé sur "{Param1}" n’est pas N vers 1

# ERR_dbmg_1577
source: The relation based on "{Param1}" is not 1-to-N
fr: Le lien basé sur "{Param1}" n’est pas 1 vers N

# ERR_dbmg_1578
source: The {Param1} attribute is not a relation attribute
fr: L'attribut {Param1} n’est pas un attribut de relation

# ERR_dbmg_1579
source: "{Param1}" is not a valid relation
fr: "{Param1}" n’est pas un lien valide

# ERR_dbmg_1580
source: The relation path is empty
fr: Le chemin de la relation est vide

# ERR_dbmg_1581
source: Cannot resolve "{Param1}" as a relation path
fr: Impossible de résoudre "{Param1}" comme un chemin de relation

# ERR_dbmg_1582
source: Event's kind is missing or invalid
fr: Le type de l’événement est manquant ou invalide

# ERR_dbmg_1583
source: Event's method is missing or invalid
fr: La méthode de l’événement est manquante ou invalide

# ERR_dbmg_1584
source: Alias attributes can only return scalar values
fr: Les attributs alias peuvent retourner uniquement des valeurs scalaires

# ERR_dbmg_1585
source: An error occurred during JavaScript execution
fr: Une erreur est survenue pendant l’exécution JavaScript

# ERR_dbmg_1586
source: Not a valid entity collection
fr: Ce n'est pas une collection d'entités valide

# ERR_dbmg_1587
source: The entity collections come from incompatible datastore classes
fr: Les collections d'entités proviennent de classes de données incompatibles

# ERR_dbmg_1588
source: The "{Param1}" attribute is duplicated
fr: L’attribut "{Param1}" est dupliqué

# ERR_dbmg_1589
source: The "{Param1}" attribute is from another datastore class
fr: L’attribut "{Param1}" appartient à une autre classes de données

# ERR_dbmg_1594
source: The "{Param1}" attribute in the "{EntityModelName}" datastore class cannot be used for sorting
fr: L’attribut "{Param1}" de la datastore class "{EntityModelName}" ne peut pas être utilisé pour le tri

# ERR_dbmg_1595
source: The "{Param1}" remote datastore class cannot be created locally
fr: La datastore class distante "{Param1}" ne peut pas être créée en local

# ERR_dbmg_1610
source: A remote request to host: "{Param1}" has failed
fr: Une requête vers l’hôte: "{Param1}" a échoué

# ERR_dbmg_1806
source: URL is not well formed
fr: L’URL n’est pas bien formé

# ERR_dbmg_1807
source: Received a '&' and was expecting a '?' in the URL
fr: Réception de '&' au lieu de '?' dans l’URL

# ERR_dbmg_1808
source: Opening single quote does not have a matching closing one in the URL
fr: L’apostrophe ouvrant n’a pas de correspondant fermant dans l’URL

# ERR_dbmg_1809
source: Opening double quote does not have a matching closing one in the URL
fr: Le guillemet ouvrant n’a pas de correspondant fermant dans l’URL

# ERR_dbmg_1811
source: "{Param1}" is an unknown REST keyword
fr: "{Param1}" est un mot-clé REST inconnu

# ERR_dbmg_1812
source: "{Param1}" is an unknown REST method
fr: "{Param1}" est une méthode REST inconnue

# ERR_dbmg_1813
source: "{Param1}" REST method is not applicable here
fr: La méthode REST "{Param1}" n'est pas applicable ici

# ERR_dbmg_1815
source: "$subentityset" cannot be applied to the REST request
fr: "$subentityset" ne peut pas être appliqué à la requête REST

# ERR_dbmg_1816
source: At least one attribute must be specified
fr: Au moins un attribut doit être spécifié

# ERR_dbmg_1817
source: "{Param1}" is not a valid compute action
fr: "{Param1}" n’est pas une action de calcul valide

# ERR_dbmg_1818
source: "{Param1}" is not a valid logical operator
fr: "{Param1}" n’est pas un opérateur logique valide

# ERR_dbmg_1819
source: Second collection reference is missing
fr: La deuxième référence de collection est manquante

# ERR_dbmg_1820
source: "{Param1}" is not a valid collection reference
fr: "{Param1}" n’est pas une référence de collection valide

# ERR_dbmg_1821
source: "{Param1}" is not a valid transaction command
fr: "{Param1}" n’est pas une commande de transaction valide

# ERR_dbmg_1822
source: REST login failed
fr: Echec de la connexion REST

# ERR_dbmg_1823
source: Maximum number of sessions has been reached
fr: Le nombre maximum de sessions a été atteint

source: Fully wrong
fr: Totalement incorrect

source: Partially wrong
fr: Partialement incorrect

source: Invalid checksum
fr: Checksum invalide

source: Invalid header
fr: En-tête invalide

source: Invalid header version
fr: Version d’en-tête invalide

source: Data segment directory header is invalid
fr: L’en-tête du répertoire du segment de données est invalide

source: Data segment end of file is invalid
fr: La fin du fichier du segment de données est invalide

source: Address of primary directory of bit table is invalid
fr: L’adresse du répertoire primaire de la table des bits est invalide

source: Primary directory of bit table is invalid
fr: Le répertoire primaire de la table de bits est invalide

source: Address of secondary directory of bit table is invalid
fr: L’adresse du répertoire secondaire de la table des bits est invalide

source: Secondary directory of bit table is invalid
fr: Le répertoire secondaire de la table de bits est invalide

source: Address of bit table is invalid
fr: L’adresse de la table des bits est invalide

source: Bit table is invalid
fr: La table des bits est invalide

source: Cannot open data segment
fr: Impossible d’ouvrir le segment de données

source: Directory of data tables is invalid
fr: Le répertoire des tables des données est invalide

source: Number of records is invalid
fr: Le nombre d’enregistrements est invalide

source: Address of primary directory of record addresses is invalid
fr: L’adresse du répertoire primaire des adresses des enregistrements est invalide

source: List of deleted records is invalid
fr: La liste des enregistrements supprimés est invalide

source: Number of BLOBs is invalid
fr: Le nombre des BLOBs est invalide

source: Address of primary directory of BLOBs addresses is invalid
fr: L’adresse du répertoire primaire des adresses des BLOBs est invalide

source: List of deleted BLOBs is invalid
fr: La liste des BLOBs supprimés est invalide

source: Address of record address directory is invalid
fr: L’adresse du répertoire des adresses des enregistrements est invalide

source: Address of BLOB address directory is invalid
fr: L’adresse du répertoire des adresses des BLOBs est invalide

source: Tag header of record address directory is invalid
fr: L’en-tête du marqueur du répertoire des adresses des enregistrements est invalide

source: Tag header of BLOB address directory is invalid
fr: L’en-tête du marqueur du répertoire des adresses des BLOBs est invalide

source: Cannot read data for record address directory
fr: Impossible de lire les données pour le répertoire des adresses des enregistrements

source: Cannot read data for BLOB address directory
fr: Impossible de lire les données pour le répertoire des adresses des BLOBs

source: Checksum of record address directory is invalid
fr: Le checksum du répertoire des adresses des enregistrements est invalide

source: Checksum of BLOB address directory is invalid
fr: Le checksum du répertoire des adresses des BLOBs est invalide

source: Length of address directory is invalid
fr: La longueur du répertoire des adresses est invalide

source: BLOB address is invalid
fr: L’adresse du BLOB est invalide

source: Cannot read BLOB data
fr: Impossible de lire les données du BLOB

source: BLOB checksum is invalid
fr: Le checksum du BLOB est invalide

source: BLOB tag header is invalid
fr: L’en-tête du marqueur du BLOB est invalide

source: BLOB length is invalid
fr: La longueur du BLOB est invalide

source: BLOB length does not match the one in the address directory
fr: La longueur du BLOB ne correspond pas à celle du répertoire d’adresses

source: Record address is invalid
fr: L’adresse de l’enregistrement est invalide

source: Cannot read record data
fr: Impossible de lire les données de l’enregistrement

source: Record checksum is invalid
fr: Le checksum de l’enregistrement est invalide

source: Record length does not match the one in the address directory
fr: La longueur de l’enregistrement ne correspond pas à celle du répertoire d’adresses

source: Record length is invalid
fr: La longueur de l’enregistrement est invalide

source: Record tag header is invalid
fr: L’en-tête du marqueur de l’enregistrement est invalide

source: Number of fields invalid
fr: Nombre de champs invalide

source: Invalid data field type
fr: Type de champ invalide

source: Invalid data field offset in record
fr: Offset de champ invalide dans l’enregistrement

source: Invalid data field length
fr: Longueur de champ invalide

source: BLOB reference is invalid in this data field
fr: La référence de BLOB est invalide dans ce champ

source: BLOB is deleted in this data field
fr: Le BLOB est supprimé dans ce champ

source: BLOB is invalid in this data field
fr: Le BLOB est invalide dans ce champ

source: BLOB reference of this data field is already used in another record
fr: La référence de BLOB pour ce champ est déjà utilisée dans un autre enregistrement

source: The chained list of deleted BLOBs is circular
fr: La chaîne de suppression des BLOBs est circulaire

source: The chained list of deleted BLOBs is invalid
fr: La chaîne de suppression des BLOBs est invalide

source: The chained list of deleted records is circular
fr: La chaîne de suppression des enregistrements est circulaire

source: The chained list of deleted records is invalid
fr: La chaîne de suppression des enregistrements est invalide

source: Some BLOBs are orphans in this data table
fr: Certains BLOBs sont orphelins dans cette table

source: Address of primary address directory is invalid
fr: L’adresse du répertoire des adresses primaires est invalide
