Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DPT-*.xlf
Languages: pt_br

# ERR_dbmg_1001
source: No column to import in table {TableName}
pt_br: Nenhuma coluna a importar na tabela {TableName}

# ERR_dbmg_1002
source: Wrong table to import
pt_br: A tabela a importar é incorreta

# ERR_dbmg_1003
source: No column to export in table {TableName}
pt_br: Nenhuma coluna a exportar na tabela {TableName}

# ERR_dbmg_1004
source: Wrong table to export
pt_br: A tabela a exportar é incorreta

# ERR_dbmg_1006
source: Cannot save structure of database {BaseName}
pt_br: Não é possível salvar a estrutura do banco de dados {BaseName}

# ERR_dbmg_1007
source: Cannot create data file of database: {BaseName}
pt_br: Não é possível criar o arquivo de dados do banco de dados: {BaseName}

# ERR_dbmg_1008
source: Wrong data segment in database {BaseName}
pt_br: Segmento de dados incorreto no banco de dados {BaseName}

# ERR_dbmg_1009
source: Memory is full
pt_br: A memória está cheia

# ERR_dbmg_1010
source: Cannot load a table definition of database {BaseName}
pt_br: Não é possível carregar uma definição da tabela do banco de dados {BaseName}

# ERR_dbmg_1011
source: Cannot open data file of database {BaseName}
pt_br: Não é possível abrir o arquivo de dados do banco de dados {BaseName}

# ERR_dbmg_1012
source: Data segment is full in database: {BaseName}
pt_br: O segmento de dados está cheio no banco de dados: {BaseName}

# ERR_dbmg_1013
source: Cannot save data segment in database {BaseName}
pt_br: Não é possível salvar segmentos de dados no banco de dados {BaseName}

# ERR_dbmg_1014
source: Cannot read data segment of database {BaseName}
pt_br: Não é possível ler o segmento de dados do banco de dados {BaseName}

# ERR_dbmg_1015
source: Wrong database header in database {BaseName}
pt_br: O cabeçalho do banco de dados é incorreto no banco de dados {BaseName}

# ERR_dbmg_1016
source: Cannot create table in database {BaseName}
pt_br: Não é possível criar a tabela no banco de dados {BaseName}

# ERR_dbmg_1017
source: Cannot read index list of database {BaseName}
pt_br: Não é possível ler a lista de índices do banco de dados {BaseName}

# ERR_dbmg_1018
source: Cannot write index list of database {BaseName}
pt_br: Não é possível escrever a lista de índices do banco de dados {BaseName}

# ERR_dbmg_1019
source: Wrong table reference in database {BaseName}
pt_br: Referência de tabela equivocada no banco de dados {BaseName}

# ERR_dbmg_1020
source: Wrong field reference in database {BaseName}
pt_br: Referência de campo equivocada no banco de dados {BaseName}

# ERR_dbmg_1021
source: Invalid index type in database {BaseName}
pt_br: Tipo de índice inválido no banco de dados {BaseName}

# ERR_dbmg_1022
source: Invalid field name in table {TableName} of database {BaseName}
pt_br: Nome de campo inválido na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1023
source: Invalid database name
pt_br: Nome do banco de dados incorreto

# ERR_dbmg_1024
source: Cannot open structure of database {BaseName}
pt_br: Não é possível abrir a estrutura do banco de dados {BaseName}

# ERR_dbmg_1025
source: Cannot create structure of database {BaseName}
pt_br: Não é possível criar a estrutura do banco de dados {BaseName}

# ERR_dbmg_1026
source: Cannot load bit selection of database {BaseName}
pt_br: Não é possível carregar a seleção de bit do banco de dados {BaseName}

# ERR_dbmg_1027
source: Cannot load set of database {BaseName}
pt_br: Não é possível carregar o conjunto do banco de dados {BaseName}

# ERR_dbmg_1028
source: Cannot modify set of database {BaseName}
pt_br: Não é possível modificar o conjunto do banco de dados {BaseName}

# ERR_dbmg_1029
source: Cannot save set of database {BaseName}
pt_br: Não é possível salvar o conjunto do banco de dados {BaseName}

# ERR_dbmg_1030
source: Cannot save BLOB {BlobNum} in table {TableName} of database {BaseName}
pt_br: Não é possível salvar BLOB {BlobNum} na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1031
source: Cannot load BLOB {BlobNum} in table {TableName} of database {BaseName}
pt_br: Não é possível carregar BLOB {BlobNum} na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1032
source: Cannot allocate BLOB {BlobNum} in table {TableName} of database {BaseName}
pt_br: Não é possível localizar BLOB {BlobNum} na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1033
source: Cannot load data bit table of database {BaseName}
pt_br: Não é possível carregar a tabela de bits de dados do banco de dados {BaseName}

# ERR_dbmg_1034
source: Cannot save data bit table of database {BaseName}
pt_br: Não é possível salvar a tabela de bits do banco de dados {BaseName}

# ERR_dbmg_1035
source: Cannot load table of data bit tables of database {BaseName}
pt_br: Não é possível carregar a tabela de bits de dados do banco de dados {BaseName}

# ERR_dbmg_1036
source: Cannot save table of data bit tables in database {BaseName}
pt_br: Não é possível salvar a tabela de bits de dados no banco de dados {BaseName}

# ERR_dbmg_1037
source: Cannot close data segment of database {BaseName}
pt_br: Não é possível fechar o segmento de dados do banco de dados {BaseName}

# ERR_dbmg_1038
source: Cannot delete data segment of database {BaseName}
pt_br: Não é possível excluir o segmento de dados do banco de dados {BaseName}

# ERR_dbmg_1039
source: Cannot open data segment of database {BaseName}
pt_br: Não é possível abrir o segmento de dados do banco de dados {BaseName}

# ERR_dbmg_1040
source: Cannot create data segment of database {BaseName}
pt_br: Não é possível criar o segmento de dados do banco de dados {BaseName}

# ERR_dbmg_1041
source: Cannot allocate space in data segment
pt_br: Não é possível alocar espaço no segmento de dados

# ERR_dbmg_1042
source: Cannot free space in data segment of database {BaseName}
pt_br: Não é possível liberar espaço no segmento de dados do banco de dados {BaseName}

# ERR_dbmg_1043
source: File is write protected
pt_br: O arquivo é somente leitura

# ERR_dbmg_1044
source: Cannot access field in record {RecNum} in table {TableName} of database {BaseName}
pt_br: Não é possível acessar ao campo no registro {RecNum} na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1045
source: Field definition code is missing in record {RecNum} in table {TableName} of database {BaseName}
pt_br: Falta o código de definição do campo no registro {RecNum} na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1046
source: Cannot save record {RecNum} in table {TableName} of database {BaseName}
pt_br: Não é possível salvar o registro {RecNum} na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1047
source: Cannot load record {RecNum} in table {TableName} of database {BaseName}
pt_br: Não é possível carregar o registro {RecNum} na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1048
source: Cannot allocate record in table {TableName} of database {BaseName}
pt_br: Não é possível localizar o registro na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1049
source: Cannot update record {RecNum} in table {TableName} of database {BaseName}
pt_br: Não é possível atualizar o registro {RecNum} na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1050
source: Wrong header for record {RecNum} in table {TableName} of database {BaseName}
pt_br: Cabeçalho incorreto para o registro {RecNum} na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1051
source: Cannot save definition of table {TableName} of database {BaseName}
pt_br: Não é possível salvar a definição da tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1052
source: Cannot update definition of table {TableName} of database {BaseName}
pt_br: Não é possível atualizar a definição da tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1053
source: Field name already exists
pt_br: O nome do campo já existe

# ERR_dbmg_1055
source: Cannot update index values while saving a record in table {TableName} of database {BaseName}
pt_br: Não é possível atualizar os valores do índice enquanto salva um registro na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1056
source: Cannot update BLOBs while saving a record in table {TableName} of database {BaseName}
pt_br: Não é possível atualizar BLOBs enquanto salva um registro na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1057
source: Cannot delete BLOBs while saving or deleting a record in table {TableName} of database {BaseName}
pt_br: Não é possível excluir BLOBs enquanto se salva ou exclui um registro en uma tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1058
source: Cannot add field in table {TableName} of database {BaseName}
pt_br: Não é possível adicionar um campo na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1059
source: Cannot allocate table in memory
pt_br: Não é possível alocar a tabela na memória

# ERR_dbmg_1061
source: Cannot allocate record in memory
pt_br: Não é possível colocar o registro na memória

# ERR_dbmg_1062
source: Cannot completely delete table {TableName} of database {BaseName}
pt_br: Não é possível excluir completamente a tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1063
source: Cannot lock record {RecNum} in table {TableName} of database {BaseName}
pt_br: Não é possível bloquear o registro {RecNum} na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1064
source: Cannot unlock record {RecNum} in table {TableName} of database {BaseName}
pt_br: Não é possível desbloquear o registro {RecNum} na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1065
source: Cannot delete record {RecNum} in table {TableName} of database {BaseName}
pt_br: Não é possível excluir o registro {RecNum} na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1066
source: Record {RecNum} is locked in table {TableName} of database {BaseName}
pt_br: O registro {RecNum} está bloqueado na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1067
source: Sequential search could not be completed in table {TableName} of database {BaseName}
pt_br: Não foi possível completar a pesquisa sequencial na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1068
source: Cannot save header for table {TableName} of database {BaseName}
pt_br: Não é possível salvar o cabeçalho da tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1069
source: Cannot import data in table {TableName} of database {BaseName}
pt_br: Não é possível importar dados na tabela {TableName} do banco de dados {BaseName}

# ERR_dbmg_1070
source: Cannot load index header of database {BaseName}
pt_br: Não é possível carregar o cabeçalho do índice do banco de dados {BaseName}

# ERR_dbmg_1071
source: Cannot save header for index {IndexName} of database {BaseName}
pt_br: Não é possível salvar o cabeçalho do índice {IndexName} do banco de dados {BaseName}

# ERR_dbmg_1072
source: Cannot get page address for index {IndexName} of database {BaseName}
pt_br: Não é possível obter o endereço da página para o índice {IndexName} do banco de dados {BaseName}

# ERR_dbmg_1073
source: Cannot set page address for index {IndexName} of database {BaseName}
pt_br: Não é possível obter o endereço da página do índice {IndexName} do banco de dados {BaseName}

# ERR_dbmg_1074
source: Cannot drop index {IndexName} of database {BaseName}
pt_br: Não é possível excluir o índice {IndexName} do banco de dados {BaseName}

# ERR_dbmg_1075
source: Cannot sort index {IndexName} of database {BaseName}
pt_br: Não é possível ordenar o índice {IndexName} do banco de dados {BaseName}

# ERR_dbmg_1076
source: Cannot load page for index {IndexName} of database {BaseName}
pt_br: Não é possível carregar a página do índice {IndexName} do banco de dados {BaseName}

# ERR_dbmg_1077
source: Cannot save page for index {IndexName} of database {BaseName}
pt_br: Não é possível salvar a página do índice {IndexName} do banco de dados {BaseName}

# ERR_dbmg_1078
source: Cannot insert key into index {IndexName} of database {BaseName}
pt_br: Não é possível inserir a chave no índice {IndexName} do banco de dados {BaseName}

# ERR_dbmg_1079
source: Cannot delete key from index {IndexName} of database {BaseName}
pt_br: Não é possível excluir a chave do índice {IndexName} do banco de dados {BaseName}

# ERR_dbmg_1080
source: Cannot completely delete index {IndexName} of database {BaseName}
pt_br: Não é possível excluir completamente o índice {IndexName} do banco de dados {BaseName}

# ERR_dbmg_1081
source: Cannot complete scan on index {IndexName} of database {BaseName}
pt_br: Não é possível completar a busca no índice {IndexName} do banco de dados {BaseName}

# ERR_dbmg_1082
source: Cannot complete sort of index {IndexName} of database {BaseName}
pt_br: Não é possível completar a ordenação do índice {IndexName} do banco de dados {BaseName}

# ERR_dbmg_1083
source: Cannot insert key into page of index {IndexName} of database {BaseName}
pt_br: Não é possível inserir a chave na página do índice {IndexName} do banco de dados {BaseName}

# ERR_dbmg_1084
source: Cannot delete key from page of index {IndexName} of database {BaseName}
pt_br: Não é possível excluir a chave da página do índice {IndexName} do banco de dados {BaseName}

# ERR_dbmg_1085
source: Cannot load index cluster of database {BaseName}
pt_br: Não é possível carregar o índice agrupado do banco de dados {BaseName}

# ERR_dbmg_1086
source: Cannot add to index cluster of database {BaseName}
pt_br: Não é possível adicionar o índice agrupado do banco de dados {BaseName}

# ERR_dbmg_1087
source: Cannot delete from index cluster of database {BaseName}
pt_br: Não é possível excluir a partir do índice agrupado do banco de dados {BaseName}

# ERR_dbmg_1088
source: Index {IndexName} is invalid or missing
pt_br: O índice {IndexName} é inválido ou em falta

# ERR_dbmg_1089
source: SQL syntax error (Obsolete)
pt_br: Erro de sintaxe SQL (Obsolete)

# ERR_dbmg_1090
source: SQL token not found (Obsolete)
pt_br: Palabra chave SQL não encontrada (Obsolete)

# ERR_dbmg_1091
source: Not implemented
pt_br: Não implementado

# ERR_dbmg_1092
source: Cannot register code
pt_br: Não é possível registrar o código

# ERR_dbmg_1093
source: Operation in progress cancelled by user
pt_br: A operação em progresso foi cancelada pelo usuário

# ERR_dbmg_1094
source: Transaction conflict
pt_br: Conflito de transação

# ERR_dbmg_1095
source: Invalid table name in database {BaseName}
pt_br: Nome de tabela incorreto no banco de dados {BaseName}

# ERR_dbmg_1096
source: Table {TableName} is locked in database {BaseName}
pt_br: A tabela {TableName} está bloqueada no banco de dados {BaseName}

# ERR_dbmg_1097
source: Database {BaseName} is locked
pt_br: O Banco de dados {BaseName} está bloqueado

# ERR_dbmg_1098
source: Data address is invalid in database {BaseName}
pt_br: O endereço de dados é incorreto no banco de dados {BaseName}

# ERR_dbmg_1099
source: Record is empty
pt_br: O registro está vazio

# ERR_dbmg_1100
source: Wrong source field
pt_br: Campo fonte incorreto

# ERR_dbmg_1101
source: Wrong destination field
pt_br: O campo de destino é incorreto

# ERR_dbmg_1102
source: Invalid relation name
pt_br: O Nome da relação é incorreto

# ERR_dbmg_1103
source: Field types do not match
pt_br: Os tipos de campos não coincidem

# ERR_dbmg_1104
source: Relation is empty
pt_br: A relação está vazía

# ERR_dbmg_1105
source: Cannot load relations list from database {BaseName}
pt_br: Não é possível carregar a lista de relações do banco de dados {BaseName}

# ERR_dbmg_1106
source: Cannot save relations list into database {BaseName}
pt_br: Não é possível salvar a lista de relações no banco de dados {BaseName}

# ERR_dbmg_1107
source: Query and lock not completed; at least one record locked somewhere else
pt_br: A pesquisa e o bloqueio não estão completos; ao menos um registro bloqueado em outra parte

# ERR_dbmg_1108
source: Invalid record
pt_br: Registro incorreto

# ERR_dbmg_1109
source: Wrong record ID
pt_br: O ID do registro é incorreto

# ERR_dbmg_1110
source: Relation already exists in database {BaseName}
pt_br: A relação já existe no banco de dados {BaseName}

# ERR_dbmg_1111
source: Index already exists in database {BaseName}
pt_br: O índice já existe no banco de dados {BaseName}

# ERR_dbmg_1112
source: Wrong comparison operator
pt_br: Operador de comparação incorreto

# ERR_dbmg_1113
source: End of data buffer
pt_br: Fim do buffer de dados

# ERR_dbmg_1114
source: Wrong DB4D version number
pt_br: Número da versão de DB4D incorreto

# ERR_dbmg_1115
source: Duplicated key
pt_br: Chave duplicada

# ERR_dbmg_1116
source: Mandatory field is Null in record {RecNum} in table {TableName}
pt_br: O campo obrigatório é nulo no registro {RecNum} na tabela {TableName}

# ERR_dbmg_1117
source: Cannot set field to mandatory for table {TableName}
pt_br: Não é possível estabelecer o campo obrigatório para a tabela {TableName}

# ERR_dbmg_1118
source: Cannot get exclusive access to table {TableName}
pt_br: Não é possível obter acesso exclusivo a tabela {TableName}

# ERR_dbmg_1119
source: Cannot check referential integrity of table {TableName}
pt_br: Não é possível verificar a integridade referencial da tabela {TableName}

# ERR_dbmg_1120
source: Reference integrity: some foreign keys still exist matching primary key on record {RecNum} in table {TableName}
pt_br: Integridade referencial: algumas chaves estrangeiras ainda existem combinando com as chaves primárias no registro {RecNum} na tabela {TableName}

# ERR_dbmg_1121
source: Cannot delete all records in selection of table {TableName}
pt_br: Não é possível excluir todos os registros na seleção de tabela {TableName}

# ERR_dbmg_1122
source: BLOB is Null
pt_br: BLOB é Nulo

# ERR_dbmg_1123
source: Invalid database context
pt_br: O contexto do banco de dados é incorreto

# ERR_dbmg_1124
source: Invalid relation reference
pt_br: A referência da relação é incorreta

# ERR_dbmg_1125
source: Invalid record name in table {TableName}
pt_br: O nome de registro é incorreto na tabela {TableName}

# ERR_dbmg_1126
source: Wrong field type
pt_br: Tipo de campo incorreto

# ERR_dbmg_1127
source: Cannot load extra properties
pt_br: Não é possível carregar propriedades adicionais

# ERR_dbmg_1128
source: Cannot save extra properties
pt_br: Não é possível salvar propriedades adicionais

# ERR_dbmg_1129
source: Subrecord ID is out of range
pt_br: O número do subregistro está fora da faixa permitida

# ERR_dbmg_1130
source: Duplicate name for index {IndexName} in database {BaseName}
pt_br: Nome duplicado para o índice {IndexName} no banco de dados {BaseName}

# ERR_dbmg_1131
source: Invalid name for index {IndexName} in database {BaseName}
pt_br: Nome incorreto para o índice {IndexName} no banco de dados {BaseName}

# ERR_dbmg_1132
source: Wrong key value on index {IndexName}
pt_br: Valor de chave incorreto para o índice {IndexName}

# ERR_dbmg_1133
source: Wrong type for index {IndexName}
pt_br: Tipo incorreto para o índice {IndexName}

# ERR_dbmg_1134
source: Invalid accessor
pt_br: Acessor incorreto

# ERR_dbmg_1135
source: Accessor is read only
pt_br: O acessor é somente leitura

# ERR_dbmg_1136
source: Null value not accepted
pt_br: Valor Null não é aceito

# ERR_dbmg_1137
source: THIS is Null
pt_br: ESTE é Null

# ERR_dbmg_1138
source: Selection is Null
pt_br: A seleção é Null

# ERR_dbmg_1139
source: Database {BaseName} is write protected
pt_br: O banco de dados {BaseName} é somente leitura

# ERR_dbmg_1140
source: Database {BaseName} is closing
pt_br: O banco de dados {BaseName} está sendo fechado

# ERR_dbmg_1141
source: Invalid transaction
pt_br: Transação incorreta

# ERR_dbmg_1142
source: Array limit is exceeded
pt_br: O limite do array foi ultrapassado

# ERR_dbmg_1143
source: Creator of array values is missing
pt_br: Falta o criador de valores do array

# ERR_dbmg_1144
source: Cannot build selection of table {TableName}
pt_br: Não é possível construir a seleção da tabela {TableName}

# ERR_dbmg_1145
source: Busy object
pt_br: Objeto não disponível

# ERR_dbmg_1146
source: Data file does not match structure file
pt_br: O arquivo de dados não coincide com o arquivo de estrutura

# ERR_dbmg_1147
source: Cannot start listener
pt_br: Não é possível iniciar receptor

# ERR_dbmg_1148
source: Cannot start server
pt_br: Não é possível iniciar o servidor

# ERR_dbmg_1149
source: No listener
pt_br: Sem receptor

# ERR_dbmg_1150
source: Task is dying
pt_br: O processo está a ponto de terminar

# ERR_dbmg_1151
source: Invalid request tag
pt_br: Etiqueta de solicitação incorreta

# ERR_dbmg_1152
source: Invalid context ID
pt_br: Número de contexto incorreto

# ERR_dbmg_1153
source: Not enough temporary space on disk
pt_br: Não há espaço temporário em disco suficiente

# ERR_dbmg_1154
source: Data set is Null
pt_br: O conjunto de dados é Null

# ERR_dbmg_1155
source: No primary key matching the foreign key
pt_br: Nenhuma chave primária corresponde com a chave estrangeira

# ERR_dbmg_1156
source: Type of field {FieldName} of table {TableName} does not support being set to Unique
pt_br: Tipo de campo {FieldName} da tabela {TableName} não aceita o atributo único

# ERR_dbmg_1157
source: Type of field {FieldName} of table {TableName} does not support being set to NEVER NULL
pt_br: O tipo de campo {FieldName} da tabela {TableName} não aceita o atributo NUNCA NULO

# ERR_dbmg_1158
source: Cannot alter primary key definition of table {TableName}
pt_br: Não é possível alterar a definição da chave primária da tabela {TableName}

# ERR_dbmg_1159
source: Maximum number of records has been reached for table {TableName}
pt_br: O número máximo de registro para a tabela {TableName} foi alcançado

# ERR_dbmg_1160
source: Maximum number of BLOBs has been reached for table {TableName}
pt_br: O número máximo de BLOBs para a tabela {TableName} foi alcançado

# ERR_dbmg_1161
source: Indice is out of range
pt_br: O índice está fora da faixa permitida

# ERR_dbmg_1162
source: Query is invalid
pt_br: A pesquisa é inválida

# ERR_dbmg_1163
source: Record is NULL
pt_br: O registro é NULL

# ERR_dbmg_1164
source: Object is NULL
pt_br: O objeto é NULL

# ERR_dbmg_1165
source: Wrong owner for this object
pt_br: Proprietário incorreto para este objeto

# ERR_dbmg_1166
source: Object was not locked
pt_br: O objeto não foi bloqueado

# ERR_dbmg_1167
source: Object is locked by another context
pt_br: O objeto está bloqueado por outro contexto

# ERR_dbmg_1168
source: Internal error on remote connection
pt_br: Erro interno na conexão remota

# ERR_dbmg_1169
source: Invalid table number
pt_br: Número de tabela incorreto

# ERR_dbmg_1170
source: Invalid field number
pt_br: Número de campo incorreto

# ERR_dbmg_1171
source: Invalid Database ID
pt_br: Número de banco de dados incorreto

# ERR_dbmg_1172
source: Invalid Parameter
pt_br: Parâmetro incorreto

# ERR_dbmg_1173
source: Cache Flushing did not complete
pt_br: A escritura de cache está incompleta

# ERR_dbmg_1174
source: Data Flushing did not complete
pt_br: A escritura de dados está incompleta

# ERR_dbmg_1175
source: Structure Flushing did not complete
pt_br: A escritura da estrutura está incompleta

# ERR_dbmg_1176
source: Log file is invalid for database {BaseName}
pt_br: O arquivo de histórico é inválido para a base {BaseName}

# ERR_dbmg_1177
source: Log file cannot be found for database {BaseName}
pt_br: Não foi possível encontrar o arquivo histórico para o banco {BaseName}

# ERR_dbmg_1178
source: Last operation in log file does not match the one in database {BaseName}
pt_br: A última operação do arquivo de histórico não corresponde a operação no banco de dados {BaseName}

# ERR_dbmg_1179
source: Log file does not match database {BaseName}
pt_br: O arquivo histórico não corresponde ao banco de dados {BaseName}

# ERR_dbmg_1180
source: Data Table has been deleted
pt_br: Os dados da tabela foram excluídos
