Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DDE.xlf
Languages: de

# ERR_dbmg_1190
source: Sequence number header cannot be loaded
de: Header der Sequenznummern kann nicht geladen werden

# ERR_dbmg_1191
source: Cannot select record
de: Datensatz kann nicht ausgewählt werden

# ERR_dbmg_1192
source: Record cannot be created
de: Datensatz kann nicht erzeugt werden

# ERR_dbmg_1193
source: Cannot complete collection to data in table {TableName} of database {BaseName}
de: Übertragung von Zusammenstellung in Daten für Tabelle {TableName} in Datenbank {BaseName} nicht erfolgreich

# ERR_dbmg_1194
source: Cannot complete data to collection in table {TableName} of database {BaseName}
de: Übertragung von Daten zu Zusammenstellung für Tabelle {TableName} in Datenbank {BaseName} nicht erfolgreich

# ERR_dbmg_1195
source: Cannot complete sequential sort
de: Sequentielle Sortierung kann nicht durchgeführt werden

# ERR_dbmg_1196
source: Selection cannot be locked
de: Auswahl kann nicht gesperrt werden

# ERR_dbmg_1197
source: Index key cannot be loaded
de: Index Eintrag kann nicht geladen werden

# ERR_dbmg_1198
source: Index key cannot be saved
de: Index Eintrag kann nicht gespeichert werden

# ERR_dbmg_1199
source: Index key cannot be built
de: Index Eintrag kann nicht erzeugt werden

# ERR_dbmg_1200
source: Query cannot be completed
de: Suche kann nicht durchgeführt werden

# ERR_dbmg_1201
source: Query cannot be analyzed
de: Suche kann nicht analysiert werden

# ERR_dbmg_1202
source: Formula could not be processed on this column
de: Formel kann auf dieser Spalte nicht ausgeführt werden

# ERR_dbmg_1203
source: Query could not be completed
de: Suche konnte nicht ausgeführt werden

# ERR_dbmg_1204
source: Query could not be analyzed
de: Suche konnte nicht analysiert werden

# ERR_dbmg_1205
source: Could not get all distinct values of table {TableName} of database {BaseName}
de: Konnte nicht alle eindeutigen Werte aus Tabelle {TableName} in Datenbank {BaseName} ermittelt werden

# ERR_dbmg_1206
source: Cannot build array of values in table {TableName} of database {BaseName}
de: Array mit Werten für Tabelle {TableName} in Datenbank {BaseName} konnte nicht erzeugt werden

# ERR_dbmg_1207
source: Selection cannot be loaded
de: Auswahl konnte nicht geladen werden

# ERR_dbmg_1208
source: Cannot send data
de: Daten konnte nicht gesendet werden

# ERR_dbmg_1209
source: Cannot receive request reply
de: Antwort auf Anfrage konnte nicht empfangen werden

# ERR_dbmg_1210
source: Cannot send request
de: Anfrage konnte nicht gesendet werden

# ERR_dbmg_1211
source: Cannot create connection
de: Verbindung konnte nicht hergestellt werden

# ERR_dbmg_1212
source: Index {IndexName} cannot be quickly created in database {BaseName}
de: Index {IndexName} konnte nicht schnell in Datenbank {BaseName} erzeugt werden

# ERR_dbmg_1213
source: Cannot build distinct index keys
de: Eindeutige Index Werte konnten nicht erzeugt werden

# ERR_dbmg_1214
source: Selection cannot be sorted in table {TableName} of database {BaseName}
de: Auswahl für Tabelle {TableName} in Datenbank {BaseName} konnte nicht sortiert werden

# ERR_dbmg_1215
source: Address table cannot loaded
de: Adresstabelle konnte nicht geladen werden

# ERR_dbmg_1216
source: Address table cannot modified
de: Adresstabelle konnte nicht geändert werden

# ERR_dbmg_1217
source: Cannot allocate new entry into address table
de: Neuer Eintrag in Adresstabelle konnte nicht erzeugt werden

# ERR_dbmg_1218
source: Cannot allocate free entry from address table
de: Leerer Eintrag in Adresstabelle konnte nicht erzeugt werden

# ERR_dbmg_1219
source: Transaction temporary record cannot be saved
de: Transaktion temporärer Datensatz konnte nicht gesichert werden

# ERR_dbmg_1220
source: Transaction temporary blob cannot be saved
de: Transaktion temporäres Blob konnte nicht gesichert werden

# ERR_dbmg_1221
source: Transaction temporary record cannot be loaded
de: Transaktion temporärer Datensatz konnte nicht geladen werden

# ERR_dbmg_1222
source: Transaction temporary blob cannot be loaded
de: Transaktion temporäres Blob konnte nicht geladen werden

# ERR_dbmg_1223
source: Transaction cannot be started
de: Transaktion konnte nicht gestartet werden

# ERR_dbmg_1224
source: Transaction cannot be commited
de: Transaktion konnte nicht bestätigt werden

# ERR_dbmg_1225
source: Cannot get extra property
de: Zusätzliche Eigenschaften konnten nicht geladen werden

# ERR_dbmg_1226
source: Cannot set extra property
de: Zusätzliche Eigenschaften konnten nicht gespeichert werden

# ERR_dbmg_1227
source: Table name is already used
de: Tabellenname wird bereits verwendet

# ERR_dbmg_1228
source: Cannot get list of NULL keys from index {IndexName}
de: Liste der NULL Einträge von index {IndexName} konnte nicht geladen werden

# ERR_dbmg_1229
source: Cannot modify list of NULL keys of index {IndexName}
de: Liste der NULL Einträge von index {IndexName} konnte nicht geändert werden

# ERR_dbmg_1230
source: Invalid key for index {IndexName}
de: Ungültiger Eintrag für Index {IndexName}

# ERR_dbmg_1231
source: Cannot set log file
de: Logbuch kann nicht gesetzt werden

# ERR_dbmg_1232
source: Context is NULL
de: Kontext ist NULL

# ERR_dbmg_1233
source: Database {BaseName} cannot be locked
de: Datenbank {BaseName} kann nicht gesperrt werden

# ERR_dbmg_1234
source: Wrong field reference in record# {RecNum} of table: {TableName} of database: {BaseName}
de: Ungültige Feldreferenz # {RecNum} in Tabelle: {TableName} in Datenbank: {BaseName}

# ERR_dbmg_1235
source: Wrong field reference in table: {TableName} of database: {BaseName}
de: Ungültige Feldreferenz in Tabelle: {TableName} in Datenbank: {BaseName}

# ERR_dbmg_1236
source: Cannot read data from temporary transaction file
de: Daten können nicht aus temporärer Transaktionsdatei gelesen werden

# ERR_dbmg_1237
source: Cartesian Product failed
de: Cartesian Produkt fehlgeschlagen

# ERR_dbmg_1238
source: Cannot merge selections
de: Auswahlen können nicht vereint werden

# ERR_dbmg_1239
source: The format of the {BaseName} database cannot be upgraded in read only mode
de: Das Format der Datenbank {BaseName} kann im Nur-Lesen-Modus nicht aktualisiert werden

# ERR_dbmg_1240
source: Wrong Header
de: Falscher Header

# ERR_dbmg_1241
source: Wrong CheckSum
de: Falsche Prüfsumme

# ERR_dbmg_1243
source: Cannot load data tables of database: {BaseName}
de: Datentabellen der Datenbank: {BaseName} können nicht geladen werden

# ERR_dbmg_1244
source: The list of foreign key constraints is not empty for table: {TableName} of database: {BaseName}
de: Die Liste der Fremdschlüssel-Constraints ist für Tabelle: {TableName} der Datenbank: {BaseName} nicht leer

# ERR_dbmg_1245
source: Address entry is not empty
de: Adresseneintrag ist nicht leer

# ERR_dbmg_1246
source: Cannot pre-allocate address
de: Adresse nicht vor bereitgestellt werden

# ERR_dbmg_1247
source: Cannot update new record in table {TableName} of database {BaseName}
de: Neuer Datensatz für Tabelle {TableName} der Datenbank {BaseName} kann nicht aktualisiert werden

# ERR_dbmg_1248
source: Cannot save new record in table {TableName} of database {BaseName}
de: Neuer Datensatz für Tabelle {TableName} der Datenbank {BaseName} kann nicht gespeichert werden

# ERR_dbmg_1249
source: Cannot save subrecord
de: Unterdatensatz kann nicht gespeichert werden

# ERR_dbmg_1250
source: Cannot save record
de: Datensatz kann nicht gespeichert werden

# ERR_dbmg_1251
source: Cannot lock structure object definition
de: Datenbank Struktur Objekt Definition kann nicht gesperrt werden

# ERR_dbmg_1252
source: Cannot unlock structure object definition
de: Datenbank Struktur Objekt Definition kann nicht entsperrt werden

# ERR_dbmg_1253
source: Invalid relation number
de: Ungültige Relations-Nummer

# ERR_dbmg_1254
source: Circular Reference in records address table of table {TableName} of database {BaseName}
de: Zirkelreferenz in Datensatzadreßtabelle für Tabelle {TableName} der Datenbank {BaseName}

# ERR_dbmg_1255
source: Circular Reference in blobs address table of table {TableName} of database {BaseName}
de: Zirkelreferenz in Blob-Adreßtabelle für Tabelle {TableName} der Datenbank {BaseName}

# ERR_dbmg_1256
source: Duplicated Schema Name in database {BaseName}
de: Doppelter Schema Name in Datenbank {BaseName}

# ERR_dbmg_1257
source: Schema cannot be saved in database {BaseName}
de: Schema kann nicht in Datenbank {BaseName} gesichert werden

# ERR_dbmg_1258
source: Schema cannot be deleted in database {BaseName}
de: Schema kann nicht aus Datenbank {BaseName} gelöscht werden

# ERR_dbmg_1259
source: Schema cannot be renamed in database {BaseName}
de: Schema in Datenbank {BaseName} kann nicht umbenannt werden

# ERR_dbmg_1260
source: Selected log file is too recent for database {BaseName}
de: Das ausgewählte Logbuch ist für Datenbank {BaseName} zu neu

# ERR_dbmg_1261
source: Selected log file is too old for database {BaseName}
de: Das ausgewählte Logbuch ist für Datenbank {BaseName} zu alt

# ERR_dbmg_1262
source: Some DataTables do not have matching table definitions for database {BaseName}
de: Eine Datentabellen passen nicht zu den Tabellendefinitionen der Struktur {BaseName}

# ERR_dbmg_1263
source: Given stamp does not match current one for record# {RecNum} of table {TableName}
de: Der gegebene Stamp passt nicht zum aktuellen für Datensatz # {RecNum} der Tabelle {TableName}

# ERR_dbmg_1264
source: A primary key is needed and missing in table {TableName}
de: Ein Primärschlüssel wird für Tabelle {TableName} benötigt, fehlt jedoch.

# ERR_dbmg_1265
source: Invalid field
de: Ungültiges Feld

# ERR_dbmg_1266
source: Unknown field type (this version of 4D is perhaps too old)
de: Unbekannter Feldtyp (vermutlich ist diese Version von 4D zu alt)

# ERR_dbmg_1267
source: Stack Overflow
de: Stapelüberlauf

# ERR_dbmg_1268
source: DataTable cannot be resurected for for database {BaseName}
de: Datentabelle konnte für Datenbank {BaseName} nicht wiederhergestellt werden

# ERR_dbmg_1269
source: DataTable cannot be found
de: Datentabelle kann nicht gefunden werden

# ERR_dbmg_1270
source: Missing structure could not be rebuild
de: Fehlende Struktur konnte nicht neu erzeugt werden

# ERR_dbmg_1271
source: Invalid REST request handler
de: Ungültiger REST Request Handler

# ERR_dbmg_1272
source: Some Records are still locked in table {tableName} in database {BaseName}
de: Es sind noch einige Datensätze in Tabelle {tableName} der Datenbank {BaseName} gesperrt

# ERR_dbmg_1273
source: Cannot drop table {TableName} in database {BaseName}
de: Tabelle {TableName} der Datenbank {BaseName} kann nicht gelöscht werden

# ERR_dbmg_1274
source: The current journal file of database {BaseName} is not available. For data security reasons, write operations are stopped. Please contact your administrator as soon as possible.
de: Der Zugriff auf die Backup-Journaldatei für Datenbank {BaseName} ist nicht mehr möglich. Zur Sicherheit des Datenbestandes wurden alle Operationen angehalten. Bitte benachrichtigen Sie umgehend Ihren Administrator!

# ERR_dbmg_1275
source: "(" is missing at the beginning of the Javascript statement in this query.
de: "(" fehlt am Beginn der JavaScript Anweisung in der Suche.

# ERR_dbmg_1276
source: Datastream has an invalid header.
de: Datenstrom hat ungültigen Header.

# ERR_dbmg_1277
source: The database journal integration failed at entry# {Param1} (operation id {Param2}).
de: Die Integration der Backup-Journaldatei ist bei Eintrag# {Param1} (operation id {Param2}) fehlgeschlagen.

# ERR_dbmg_1278
source: Javascript code not allowed in the query.
de: JavaScript Code ist in der Suche nicht erlaubt.

# ERR_dbmg_1279
source: The query placeholder {Param1} is missing or null.
de: Der Query Platzhalter {Param1} fehlt oder ist Null.

# ERR_dbmg_1280
source: The query placeholder {Param1} is of invalid type.
de: Der Query Platzhalter {Param1} hat einen ungültigen Typ.

# ERR_dbmg_1281
source: Table {TableName} needs a primary key in order to be logged.
de: Die Tabelle {TableName} benötigt einen Primärschlüssel für das Backup-Journal.

# ERR_dbmg_1282
source: Cannot find any record with that primary key in table {TableName}.
de: Es kann für den angegeben Primärschlüssel kein Datensatz in {TableName} gefunden werden.

# ERR_dbmg_1283
source: A primary key definition is missing for table {TableName}.
de: Für Tabelle {TableName} fehlt die Definition des Primärschlüssels.

# ERR_dbmg_1284
source: The given primary key of table {TableName} is malformed.
de: Der angegebene Primärschlüssel für Tabelle {TableName} ist nicht korrekt formatiert.

# ERR_dbmg_1285
source: Non-unique primary key found in table {TableName}.
de: Es wurde ein nicht eindeutiger Primärschlüssel in Tabelle {TableName} gefunden.

# ERR_dbmg_1286
source: Null primary key found in table {TableName}.
de: Null Wert als Primärschlüssel in Tabelle {TableName} gefunden.

# ERR_dbmg_1287
source: Log file was created with an older version for database {BaseName}
de: Journal/Logbuch wurde mit älterer Version für Datendatei {BaseName} erzeugt.

# ERR_dbmg_1288
source: Constraints on database {BaseName} cannot be disabled while a journal file is active.
de: Deaktivieren der Constraints für Datenbank {BaseName} ist nicht möglich, solange ein Journal/Logbuch aktiv ist.

# ERR_dbmg_1289
source: A destination folder was not chosen to record the database journal for {BaseName}.
de: Für das Datenbank-Journal für {BaseName} wurde kein Zielordner ausgewählt.

# ERR_dbmg_1290
source: Cannot open the database journal for {BaseName}.
de: Das Datenbank-Journal für {BaseName} konnte nicht geöffnet werden.

# ERR_dbmg_1300
source: Invalid Selection Type
de: Ungültiger Auswahltyp

# ERR_dbmg_1301
source: Array is too big
de: Array ist zu groß

# ERR_dbmg_1302
source: Array size does not match
de: Arraygröße stimmt nicht

# ERR_dbmg_1303
source: Invalid Selection ID
de: Ungültige Auswahl-ID

# ERR_dbmg_1304
source: Invalid Selection Part
de: Ungültiger Auswahlteil

# ERR_dbmg_3000
source: The replication database is not valid
de: Die Replikations-Datendatei ist ungültig

# ERR_dbmg_3001
source: The replication database is missing a table and is not valid
de: Es fehlt eine Tabelle in der Replikations-Datendatei, diese ist ungültig

source: Fully wrong
de: Völlig falsch

source: Partially wrong
de: Teilweise falsch

source: Invalid checksum
de: Ungültige Prüfsumme

source: Invalid header
de: Ungültiger Header

source: Invalid header version
de: Ungültige Header-Version

source: Data segment directory header is invalid
de: Datensegment Verzeichnis-Header ist ungültig

source: Data segment end of file is invalid
de: Datensegment "Ende der Datei" ist ungültig

source: Address of primary directory of bit table is invalid
de: Adresse des primären Verzeichnisses der Bit-Tabelle ist ungültig

source: Primary directory of bit table is invalid
de: Primäres Verzeichnis der Bit-Tabelle ist ungültig

source: Address of secondary directory of bit table is invalid
de: Adresse des sekundären Verzeichnisses der Bit-Tabelle ist ungültig

source: Secondary directory of bit table is invalid
de: Sekundäres Verzeichnis der Bit-Tabelle ist ungültig

source: Address of bit table is invalid
de: Adresse der Bit-Tabelle ist ungültig

source: Bit table is invalid
de: Bit-Tabelle ist ungültig

source: Cannot open data segment
de: Datensegment kann nicht geöffnet werden

source: Directory of data tables is invalid
de: Verzeichnis der Datentabellen ist ungültig

source: Number of records is invalid
de: Die Anzahl der Datensätze ist ungültig

source: Address of primary directory of record addresses is invalid
de: Adresse des primären Verzeichnisses der Datensatz-Adressen ist ungültig

source: List of deleted records is invalid
de: Liste der gelöschten Datensätze ist ungültig

source: Number of BLOBs is invalid
de: Anzahl BLOBs ist ungültig

source: Address of primary directory of BLOBs addresses is invalid
de: Adresse des primären Verzeichnisses der BLOB-Adressen ist ungültig

source: List of deleted BLOBs is invalid
de: Liste der gelöschten BLOBs ist ungültig

source: Address of record address directory is invalid
de: Adresse des Verzeichnisses der Datensatzadressen ist ungültig

source: Address of BLOB address directory is invalid
de: Adresse des Verzeichnisses der BLOB-Adressen ist ungültig

source: Tag header of record address directory is invalid
de: Tag-Header des Verzeichnisses der Datensatzadressen ist ungültig

source: Tag header of BLOB address directory is invalid
de: Tag-Header des Verzeichnisses der BLOB-Adressen ist ungültig

source: Cannot read data for record address directory
de: Daten für Verzeichnis der Datensatzadressen können nicht gelesen werden

source: Cannot read data for BLOB address directory
de: Daten für Verzeichnis der BLOB-Adressen können nicht gelesen werden

source: Checksum of record address directory is invalid
de: Die Prüfsumme des Verzeichnisses der Datensatzadressen ist ungültig

source: Checksum of BLOB address directory is invalid
de: Die Prüfsumme des Verzeichnisses der BLOB-Adressen ist ungültig

source: Length of address directory is invalid
de: Die Länge des Adress-Verzeichnisses ist ungültig

source: BLOB address is invalid
de: BLOB Adresse ist ungültig

source: Cannot read BLOB data
de: BLOB Daten können nicht gelesen werden

source: BLOB checksum is invalid
de: BLOB Prüfsumme ist ungültig

source: BLOB tag header is invalid
de: BLOB Tag Header ist ungültig

source: BLOB length is invalid
de: BLOB Länge ist ungültig

source: BLOB length does not match the one in the address directory
de: BLOB Länge entspricht nicht der Länge im Adress-Verzeichnis

source: Record address is invalid
de: Datensatzadresse ist ungültig

source: Cannot read record data
de: Datensatz Daten können nicht gelesen werden

source: Record checksum is invalid
de: Datensatz Prüfsumme ist ungültig

source: Record length does not match the one in the address directory
de: Datensatzlänge entspricht nicht der Länge im Adress-Verzeichnis

source: Record length is invalid
de: Datensatzlänge ist ungültig

source: Record tag header is invalid
de: Datensatz Tag Header ist ungültig

source: Number of fields invalid
de: Anzahl Felder ist ungültig

source: Invalid data field type
de: Ungültiger Daten Feldtyp

source: Invalid data field offset in record
de: Ungültiger Datenfeld-Offset im Datensatz

source: Invalid data field length
de: Ungültige Datenfeldlänge

source: BLOB reference is invalid in this data field
de: BLOB Referenz ist ungültig für dieses Datenfeld

source: BLOB is deleted in this data field
de: BLOB wurde gelöscht in diesem Datenfeld

source: BLOB is invalid in this data field
de: BLOB ist ungültig in diesem Datenfeld

source: BLOB reference of this data field is already used in another record
de: BLOB Referenz von diesem Datenfeld wird bereits in einem anderen Datensatz verwendet

source: The chained list of deleted BLOBs is circular
de: Die verkettete Liste gelöschter BLOBs ist zirkular

source: The chained list of deleted BLOBs is invalid
de: Die verkettete Liste gelöschter BLOBs ist ungültig

source: The chained list of deleted records is circular
de: Die verkettete Liste gelöschter Datensätze ist zirkular

source: The chained list of deleted records is invalid
de: Die verkettete Liste gelöschter Datensätze ist ungültig

source: Some BLOBs are orphans in this data table
de: Es gibt einige nicht zugewiesene/verwaiste BLOBs in dieser Datentabelle

source: Address of primary address directory is invalid
de: Adresse des primären Adress-Verzeichnisses ist ungültig

source: The number of entries is invalid
de: Die Anzahl Einträge ist ungültig

source: The chained list of deleted entries is invalid
de: Die verkettete Liste der gelöschten Einträge ist ungültig

source: Address is invalid
de: Die Adresse ist ungültig

source: Address of address directory is invalid
de: Die Adresse des Adress-Verzeichnisses ist ungültig

source: Tag header of address directory is invalid
de: Tag Header des Adressverzeichnisses ist ungültig

source: Cannot read data for address directory
de: Daten aus Adressverzeichnis können nicht gelesen werden

source: Checksum of address directory is invalid
de: Prüfsume des Adressverzeichnisses ist ungültig

source: Length is invalid
de: Länge ist ungültig

source: Address is invalid
de: Adresse ist ungültig

source: Checksum is invalid
de: Prüfsumme ist ungültig

source: Cannot read data
de: Daten können nicht gelesen werden

source: Tag header is invalid
de: Tag Header ist ungültig

source: Length of table name is invalid
de: Länge des Tabellennamens ist ungültig

source: Length of record class name is invalid
de: Länge des Datensatz Klassennamens ist ungültig

source: Length of field name is invalid
de: Länge des Feldnamens ist ungültig

source: Type of Table is invalid
de: Tabellentyp ist ungültig

source: The number of fields is invalid
de: Feldanzahl ist ungültig

source: The number of Fields does not match the size of the table definition
de: Die Feldanzahl entspricht nicht der Tabellendefinition

source: The UUIDs are the same
de: Die UUIDs sind identisch

source: Field type is invalid
de: Der Feldtyp ist ungültig

source: Length stored in tag header does not match
de: Die im Tag Header gespeicherte Länge stimmt nicht überein

source: Extra properties stream seems to be damaged
de: Der Stream Zusätzliche Eigenschaften ist beschädigt

source: Auto sequence number type is invalid
de: Typ der automatischen Sequenznummer ist ungültig

source: Auto sequence number ID is invalid
de: Automatische Sequenznummern-ID ist ungültig

source: Type of relation is invalid
de: Typ der Verknüpfung ist ungültig

source: The number of relations is invalid
de: Die Anzahl Verknüpfungen ist ungültig

source: The relation type does not match
de: Der Typ der Verknüpfung stimmt nicht überein

source: The relation source field ID cannot be found
de: Die ID des Quellfeldes der Verknüpfung kann nicht gefunden werden

source: The relation destination field ID cannot be found
de: Die ID des Zielfeldes der Verknüpfung kann nicht gefunden werden

source: The table of relations is damaged
de: Das Verzeichnis der Verknüpfungen ist beschädigt

source: The number of fields for the source is not equal to the number of fields for the destination
de: Die Anzahl Felder für die Quelle entspricht nicht der Anzahl Felder für das Ziel

source: The index definition is damaged
de: Die Index-Definition ist beschädigt

source: Index type is invalid
de: Der Indextyp ist ungültig

source: Field reference is invalid
de: Die Feldreferenz ist ungültig

source: Table reference is invalid
de: Die Tabellenreferenz ist ungültig

source: Index header type is invalid
de: Der Index Header-Typ ist ungültig

source: Address of primary directory of index pages is invalid
de: Die Adresse des primären Verzeichnisses der Indexseiten ist ungültig

source: The number of index pages is invalid
de: Die Anzahl Indexseiten ist ungültig

source: The chained list of deleted index pages is invalid
de: Die verkettete Liste der gelöschten Indexseiten ist ungültig

source: Primary page number is invalid
de: Primäre Seitennummer ist ungültig

source: Address of primary directory of index clusters is invalid
de: Adresse des primären Verzeichnisses der Indexcluster ist ungültig

source: The number of index clusters is invalid
de: Die Anzahl der Indexcluster ist ungültig

source: The chained list of deleted index clusters is invalid
de: Die verkettete Liste der gelöschten Indexcluster ist ungültig

source: Extra property length is invalid
de: Die Länge der zusätzlichen Eigenschaften ist ungültig

source: Extra property address is invalid
de: Die Adresse der zusätzlichen Eigenschaften ist ungültig

source: Extra property checksum is invalid
de: Die Prüfsumme der zusätzlichen Eigenschaften ist ungültig
