Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DFR.xlf
Languages: fr

source: The number of entries is invalid
fr: Le nombre d’entrées est invalide

source: The chained list of deleted entries is invalid
fr: La chaîne de suppression des entrées est invalide

source: Address is invalid
fr: L’adresse est invalide

source: Address of address directory is invalid
fr: L’adresse de répertoire des adresses est invalide

source: Tag header of address directory is invalid
fr: L’en-tête du marqueur du répertoire des adresses est invalide

source: Cannot read data for address directory
fr: Impossible de lire les données du répertoire des adresses

source: Checksum of address directory is invalid
fr: Le checksum du répertoire des adresses est invalide

source: Length is invalid
fr: La longueur est invalide

source: Address is invalid
fr: L’adresse est invalide

source: Checksum is invalid
fr: Le checksum est invalide

source: Cannot read data
fr: Impossible de lire les données

source: Tag header is invalid
fr: L’en-tête du marqueur est invalide

source: Length of table name is invalid
fr: La longueur du nom de la table est invalide

source: Length of record class name is invalid
fr: La longueur du nom de la classe de l’enregistrement est invalide

source: Length of field name is invalid
fr: La longueur du nom du champ est invalide

source: Type of Table is invalid
fr: Le type de la table est invalide

source: The number of fields is invalid
fr: Le nombre de champs est invalide

source: The number of Fields does not match the size of the table definition
fr: Le nombre des champs ne correspond pas à la taille de la définition de la table

source: The UUIDs are the same
fr: Les UUIDs sont identiques

source: Field type is invalid
fr: Le type de champ est invalide

source: Length stored in tag header does not match
fr: La longueur stockée dans l’en-tête du marqueur ne correspond pas

source: Extra properties stream seems to be damaged
fr: Le flux des propriétés additionnelles semble être endommagé

source: Auto sequence number type is invalid
fr: Le type de numéro de séquence automatique est invalide

source: Auto sequence number ID is invalid
fr: L’identifiant du numéro de séquence automatique est invalide

source: Type of relation is invalid
fr: Le type de lien est invalide

source: The number of relations is invalid
fr: Le nombre de liens est invalide

source: The relation type does not match
fr: Le type de lien ne correspond pas

source: The relation source field ID cannot be found
fr: L’identifiant du champ source du lien est introuvable

source: The relation destination field ID cannot be found
fr: L’identifiant du champ destination du lien est introuvable

source: The table of relations is damaged
fr: La table des liens est endommagée

source: The number of fields for the source is not equal to the number of fields for the destination
fr: Le nombre de champs pour la source n’est pas égal au nombre de champs pour la destination

source: The index definition is damaged
fr: La définition d’index est endommagée

source: Index type is invalid
fr: Le type d’index est invalide

source: Field reference is invalid
fr: La référence du champ est invalide

source: Table reference is invalid
fr: La référence de la table est invalide

source: Index header type is invalid
fr: Le type de l’en-tête de l’index est invalide

source: Address of primary directory of index pages is invalid
fr: L’adresse du répertoire primaire des pages d’index est invalide

source: The number of index pages is invalid
fr: Le nombre de pages d’index est invalide

source: The chained list of deleted index pages is invalid
fr: La chaîne de suppression des pages d’index est invalide

source: Primary page number is invalid
fr: Le numéro de la page primaire est invalide

source: Address of primary directory of index clusters is invalid
fr: L’adresse du répertoire primaire des clusters d’index est invalide

source: The number of index clusters is invalid
fr: Le nombre de clusters d’index est invalide

source: The chained list of deleted index clusters is invalid
fr: La chaîne de suppression des clusters d’index est invalide

source: Extra property length is invalid
fr: La longueur des propriétés additionnelles est invalide

source: Extra property address is invalid
fr: L’adresse des propriétés additionnelles est invalide

source: Extra property checksum is invalid
fr: Le checksum des propriétés additionnelles est invalide

source: Cannot read extra property data
fr: Impossible de lire les données des propriétés additionnelles

source: Extra property tag header is invalid
fr: L’en-tête du marqueur des propriétés additionnelles est invalide

source: Extra property length stored in tag header does not match
fr: La longueur des propriétés additionnelles stockée dans l’en-tête du marqueur ne correspond pas

source: Address of page address directory is invalid
fr: L’adresse du répertoire de la page d’adresse est invalide

source: Address of cluster address directory is invalid
fr: L’adresse du répertoire du cluster d’adresse est invalide

source: Tag header of page address directory is invalid
fr: L’en-tête du marqueur du répertoire de la page d’adresse est invalide

source: Tag header of cluster address directory is invalid
fr: L’en-tête du marqueur du répertoire de l’adresse des clusters est invalide

source: Cannot read data for page address directory
fr: Impossible de lire les données du répertoire d’adresse des pages

source: Cannot read data for cluster address directory
fr: Impossible de lire les données du répertoire d’adresse des clusters

source: Checksum of page address directory is invalid
fr: Le checksum du répertoire d’adresse des pages est invalide

source: Checksum of cluster address directory is invalid
fr: Le checksum du répertoire d’adresse des clusters est invalide

source: Cluster type is invalid
fr: Le type de cluster est invalide

source: The number of records in cluster is invalid
fr: Le nombre d’enregistrements dans le cluster est invalide

source: Cluster contains invalid record references
fr: Le cluster contient des références d’enregistrements invalides

source: Cluster contains deleted record references
fr: Le cluster contient des références d’enregistrements supprimées

source: Cluster bits count is invalid
fr: Le compteur de bits du cluster est invalide

source: The number of index keys is invalid
fr: Le nombre des clés d’index est invalide

source: Cluster contains duplicated record references
fr: Le cluster contient des références d’enregistrements dupliquées

source: Subpage reference is invalid
fr: La référence de la sous page est invalide

source: Subpage reference is deleted
fr: La référence de la sous page est supprimée

source: The keys directory is invalid
fr: Le répertoire des clés est invalide

source: Key references an invalid record number
fr: La clé référence un numéro d’enregistrement invalide

source: Key references a deleted record number
fr: La clé référence un numéro d’enregistrement supprimé

source: Key references a duplicated record number
fr: La clé référence un numéro d’enregistrement dupliqué

source: The keys are not in the right order
fr: Les clés ne sont pas dans le bon ordre

source: Invalid key
fr: Clé invalide

source: Some record references are missing
fr: Certaines références d’enregistrement sont manquantes

source: This index page is used in a circular reference
fr: Cette page d’index est utilisé dans une référence circulaire

source: Checksum of data table header is invalid
fr: Le checksum de l’en-tête de la table est invalide

source: Length of data table header is invalid
fr: La longueur de l’en-tête de la table est invalide

source: Tag header of data table header is invalid
fr: L’en-tête du marqueur d’en-tête de la table est invalide

source: Cannot read data of data table header
fr: Impossible de lire les données de l’en-tête de la table

source: Address of data table header is invalid
fr: L’adresse de l’en-tête de la table des données est invalide

source: Wrong data type number in index
fr: Mauvais numéro de type de données dans l’index

source: The structure and data file do not match
fr: Les fichiers de structure et de données ne sont pas compatibles

source: Missing Index file .4DIndx or .4DIndy
fr: Fichier d'index manquant .4DIndx ou .4DIndy

source: Last database flush did not complete.
fr: La dernière écriture du cache de la base est incomplète.

source: Address overlaps
fr: Chevauchement d’adresses

source: Index is flagged to be rebuilt
fr: L’index est marqué pour être reconstruit

source: External BLOB file is missing
fr: Le fichier BLOB externe est manquant

source: Problem on the database
fr: Problème dans la base de données

source: Problem on the data segment # {SegNum}
fr: Problème dans le segment des données numéro {SegNum}

source: Problem on the secondary directory # {BittableTable} of bit tables in the data segment # {SegNum}
fr: Problème dans le répertoire secondaire numéro {BittableTable} de la table des bits dans le segment de données numéro {SegNum}

source: Problem on the bit table # {Bittable} in the secondary directory # {BittableTable} of bit tables in the data segment # {SegNum}
fr: Problème dans la table des bits numéro {Bittable} dans le répertoire secondaire numéro {BittableTable} des tables des bits dans le segment de données numéro {SegNum}

source: Problem on the {TableName} data table
fr: Problème dans la table {TableName}

source: Problem on record address directory # {RecordAddressTableNum} in the {TableName} data table
fr: Problème dans le répertoire d’adresses d’enregistrements numéro {RecordAddressTableNum} de la table {TableName}

source: Problem on BLOB address directory # {BlobAddressTableNum} in the {TableName} data table
fr: Problème dans le répertoire d’adresses des BLOBs numéro {BlobAddressTableNum} de la table {TableName}

source: Problem on BLOB # {BlobNum} in the {TableName} data table
fr: Problème avec le BLOB numéro {BlobNum} de la table {TableName}

source: Problem on record # {RecordNum} in the {TableName} data table
fr: Problème avec l’enregistrement numéro {RecordNum} de la table {TableName}

source: Problem on field {FieldName} in record # {RecordNum} in the {TableName} data table
fr: Problème avec le champ {FieldName} dans l’enregistrement numéro {RecordNum} de la table {TableName}

source: Problem on directory of table definitions
fr: Problème dans le répertoire de définition des tables

source: Problem on {TableName} table definition
fr: Problème dans la définition de la table {TableName}

source: Problem on directory of relation definitions
fr: Problème dans le répertoire de définition des liens

source: Problem on relation definition # {RelationNum}
fr: Problème dans la définition de la relation numéro {RelationNum}

source: Problem on directory of sequence numbers
fr: Problème dans le répertoire des numéros automatiques

source: Problem on sequence number # {SeqNum}
fr: Problème dans la numérotation automatique {SeqNum}

source: Problem on directory of index definitions
fr: Problème dans le répertoire de définition des index

source: Problem on index definition {IndexName}
fr: Problème dans la définition d’index {IndexName}

source: Problem on directory of backup index definitions
fr: Problème dans le répertoire de définition des index de sauvegarde

source: Problem on backup index definition {IndexName}
fr: Problème dans la définition des index de sauvegarde {IndexName}

source: UUID Conflict between {ObjType1}:{ObjName1} and {ObjType2}:{ObjName2}
fr: Conflit d'UUID entre {ObjType1}:{ObjName1} et {ObjType2}:{ObjName2}

source: Problem on field definition {FieldName} in {TableName} table
fr: Problème dans la définition du champ {FieldName} de la table {TableName}

source: Problem on page address directory # {IndexPageAddressTable} in {IndexName} index
fr: Problème dans le répertoire d’adresse de pages numéro {IndexPageAddressTable} dans l’index {IndexName}

source: Problem on page # {IndexPageNum} in {IndexName} index
fr: Problème dans la page numéro {IndexPageNum} dans l’index {IndexName}

source: Problem on {IndexName} index
fr: Problème dans l’index {IndexName}

source: Problem on cluster # {IndexClusterNum} in {IndexName} index
fr: Problème dans le cluster numéro {IndexClusterNum} dans l’index {IndexName}

source: Problem on cluster address directory # {IndexClusterAddressTable} in {IndexName} index
fr: Problème dans le répertoire d’adresse des clusters numéro {IndexClusterAddressTable} dans l’index {IndexName}

source: Problem on bit page # {BitPageNum} in cluster # {IndexClusterNum} in {IndexName} index
fr: Problème dans la page de bits numéro {BitPageNum} dans le cluster numéro {IndexClusterNum} dans l’index {IndexName}

source: Problem on directory of data table headers
fr: Problème dans le répertoire des en-têtes de tables

source: Problem in NULLS cluster of {IndexName} index
fr: Problème dans le cluster NULLS dans l’index {IndexName}

source: Problem on bit page # {BitPageNum} in NULLS cluster of {IndexName} index
fr: Problème dans la page de bits # {BitPageNum dans le cluster NULLS de l’index {IndexName}

source: Overlapping {ObjType} at offset {ObjAddr} with length {ObjLen} in data segment # {SegNum}
fr: Chevauchement de {ObjType} à l'offset {ObjAddr} de longueur {ObjLen} dans le segment de données n° {SegNum}

source: Overlapping Objects in data segment # {SegNum}
fr: Chevauchement d'objets dans le segment de données n° {SegNum}

source: Field
fr: Champ

source: Automatic Sequence Number
fr: Numéro de séquence automatique

source: Relation
fr: Lien

source: Loading data tables
fr: Chargement des tables de données

source: Checking data table definitions
fr: Vérification des définitions de tables des données

source: Checking chained list of deleted table definitions
fr: Vérification de la chaîne de définitions de tables supprimées

source: Checking index definitions
fr: Vérification des définitions d’index

source: Checking chained list of deleted index definitions
fr: Vérification de la chaîne de définitions d’index supprimés

source: Checking backup index definitions
fr: Vérification des définitions d’index de sauvegarde

source: Checking chained list of deleted backup index definitions
fr: Vérification de la chaîne de définition d’index de sauvegarde supprimés

source: Checking relation definitions
fr: Vérification des définitions de liens

source: Checking chained list of deleted relation definitions
fr: Vérification des listes de définitions de liens supprimées

source: Checking auto sequence number definitions
fr: Vérification des définitions de la numérotation automatique

source: Checking chained list of deleted auto sequence number definitions
fr: Vérification de la chaîne de définition de numérotation automatique supprimée

source: Checking data table headers
fr: Vérification des entêtes de la table des données

source: Checking chained list of deleted data table headers
fr: Vérification de la chaîne des entêtes de la table des données supprimées

source: Checking BLOBs in table {p1}
fr: Vérification des BLOBs dans la table {p1}

source: Checking list of deleted BLOBs in table {p1}
fr: Vérification de la liste des BLOBs supprimés dans la table {p1}

source: Checking records in table {p1}
fr: Vérification des enregistrements dans la table {p1}

source: Checking list of deleted records in table {p1}
fr: Vérification de la liste des enregistrements supprimés dans la table {p1}

source: Check bit tables for segment {SegNum}
fr: Vérification de la table des bits du segment {SegNum}

source: Checking index pages on {p1}
fr: Vérification des pages d’index de l'{p1}

source: Checking index page addresses on {p1}
fr: Vérification des adresses des pages d’index de l'{p1}

source: Checking list of deleted index pages on {p1}
fr: Vérification de la liste des pages d’index supprimés de l'{p1}

source: Checking clusters on {p1}
fr: Vérification des clusters de l'{p1}

source: Checking list of deleted clusters on {p1}
fr: Vérification de la liste des clusters supprimés de l'{p1}

source: on
fr: sur

source: Keywords Index
fr: Index de mots-clés

source: B-tree Index
fr: Index B-tree

source: Cluster Index
fr: Index cluster

source: Composite Index
fr: Index composite

source: Scanning data
fr: Lecture des données

source: Recovering records
fr: Récupération des enregistrements

source: Recovering BLOBs
fr: Récupération des BLOBs

source: (Table# {p1} out of {p2} tables)
fr: (Table# {p1} parmi {p2} tables)

source: Checking index {p1}
fr: Vérification de l'index sur {p1}

source: Loading data
fr: Chargement des données

source: Integrating journal: {curValue} of {maxValue} entries
fr: Intégration du journal: {curValue} sur {maxValue} entrées

source: Sequential sorting on {TableName}: {curValue} of {maxValue} records
fr: Tri séquentiel sur {TableName} : {curValue} sur {maxValue} enregistrements

source: Sequential searching on {TableName}: {curValue} of {maxValue} records
fr: Recherche séquentielle sur {TableName} : {curValue} sur {maxValue} enregistrements

source: Exporting a selection of records: {curValue} of {maxValue} records
fr: Export d’une sélection d’enregistrements : {curValue} sur {maxValue} enregistrements

source: Indexing calculation formulas: {curValue} of {maxValue} pages
fr: Formules de calcul indexées: {curValue} sur {maxValue} pages

source: Computing distinct indexed values: {curValue} of {maxValue} pages
fr: Calcul des valeurs distinctes indexées : {curValue} sur {maxValue} pages

source: Indexed sorting: {curValue} of {maxValue} keys
fr: Tri indexé: {curValue} sur {maxValue} clefs

source: Building of
fr: Création de l'

source: Building index on one field: {curValue} of {maxValue} records
fr: Création d’index pour le champ 1: {curValue} sur {maxValue} enregistrements

source: Building full text index on one field: {curValue} of {maxValue} records
fr: Création d’index texte mots-clés sur le champ 1: {curValue} sur {maxValue} enregistrements

source: Building composite index: {curValue} of {maxValue} records
fr: Création d’index composite: {curValue} sur {maxValue} enregistrements

source: Merging items
fr: Fusion des éléments

source: Building selection
fr: Création de la sélection

source: Generating index pages
fr: Génération des pages d’index

source: Generating clusters
fr: Génération des clusters

source: Generating index pages
fr: Génération des pages d’index

source: Generating index clusters
fr: Génération d’index de clusters

source: Sequential sorting
fr: Tri séquentiel

source: Sorting data
fr: Tri des données

source: Deleting address table: {curValue} of {maxValue} entries
fr: Suppression de la table d’adresses: {curValue} sur {maxValue} entrées

source: Flushing Data
fr: Ecriture des données (flush)

source: Deleting records: {curValue} of {maxValue}
fr: Suppression des enregistrements : {curValue} parmi {maxValue}

source: Analyzing Log file
fr: Analyse du fichier d'historique

source: Selection to array: {curValue} of {maxValue}
fr: Sélection vers tableau : {curValue} sur {maxValue}

source: Array to selection: {curValue} of {maxValue}
fr: Tableau vers sélection : {curValue} sur {maxValue}

source: Indexing calculation formulas: {curValue} of {maxValue} keys
fr: Indexation des formules de calcul: {curValue} sur {maxValue} clés

source: Index searching: {curValue} of {maxValue} pages
fr: Recherche indexée : {curValue} sur {maxValue} pages

source: Index scanning: {curValue} of {maxValue} pages
fr: Parcours de l'index : {curValue} sur {maxValue} pages

source: Computing statistics: {curValue} of {maxValue} records
fr: Calcul de statistiques : {curValue} sur {maxValue} enregistrements

source: Exporting {TableName} as SQL: {curValue} of {maxValue} records
fr: Export {TableName} comme du SQL : {curValue} sur {maxValue} enregistrements

source: Exporting database: {curValue} of {maxValue} tables
fr: Export de la base : {curValue} sur {maxValue} tables

source: Cleaning destination folder...
fr: Suppression du contenu du dossier destination...

source: Checking uniqueness
fr: Vérification d'unicitée

source: Checking primary keys for {TableName}: {curValue} of {maxValue} records
fr: Vérification des clés primaires pour {TableName}: {curValue} sur {maxValue} enregistrements

source: data segment header
fr: en-tête du segment de données

source: primary directory of bit table
fr: répertoire primaire de la table des bits

source: secondary directory # {param2} of bit table
fr: répertoire secondaire n° {param2} de la table des bits

source: bit table # {param3} of directory # {param2}
fr: table des bits n° {param3} du répertoire n° {param2}

source: auto sequence header # {param1}
fr: en-tête séquence automatique n° {param1}

source: data table header # {param1}
fr: en-tête table des données n° {param1}

source: index header # {param1}
fr: en-tête index n° {param1}

source: table definition # {param1}
fr: définition de table n° {param1}

source: relation definition # {param1}
fr: définiton du lien n° {param1}

source: BLOB # {param1} of {TableName}
fr: BLOB n° {param1} de {TableName}

source: record # {param1} of {TableName}
fr: enregistrement n° {param1} de {TableName}

source: address table
fr: table d'adresses

source: records address table of {TableName}
fr: table d'adresses des enregistrements de {TableName}

source: BLOBs address table of {TableName}
fr: table d'adresses des BLOBs de {TableName}

source: index address table of {IndexName}
fr: table d'adresses des index de {IndexName}

source: clusters address table of {IndexName}
fr: table d'adresses des clusters de {IndexName}

source: extra property
fr: propriété supplémentaire

source: index page # {param1} of {IndexName}
fr: page d’index n° {param1} de {IndexName}

source: index cluster # {param1} of {IndexName}
fr: cluster d’index n° {param1} de {IndexName}

source: part # {param2} of index cluster # {param1} of {IndexName}
fr: partie n° {param2} du cluster d’index n° {param1} de {IndexName}

# default_field_name
source: Field_{id}
fr: Champ_{id}

# default_many_to_one_name
source: Link_{id}
fr: Lien_{id}

# default_one_to_many_name
source: Link_{id}_return
fr: Lien_{id}_retour

source: Compacting data table definitions
fr: Compactage des définitions de tables des données

source: Compacting chained list of deleted table definitions
fr: Compactage de la chaîne de définitions de tables supprimées

source: Compacting index definitions
fr: Compactage des définitions d’index

source: Compacting chained list of deleted index definitions
fr: Compactage de la chaîne de définitions d’index supprimés

source: Compacting backup index definitions
fr: Compactage des définitions d’index de sauvegarde

source: Compacting chained list of deleted backup index definitions
fr: Compactage de la chaîne de définition d’index de sauvegarde supprimés

source: Compacting relation definitions
fr: Compactage des définitions de liens

source: Compacting chained list of deleted relation definitions
fr: Compactage des listes de définitions de liens supprimées

source: Compacting auto sequence number definitions
fr: Compactage des définitions de la numérotation automatique

source: Compacting chained list of deleted auto sequence number definitions
fr: Compactage de la chaîne de définition de numérotation automatique supprimée

source: Compacting data table headers
fr: Compactage des entêtes de la table des données

source: Compacting chained list of deleted data table headers
fr: Compactage de la chaîne des entêtes de la table des données supprimées

source: Compacting BLOBs in table {p1}
fr: Compactage des BLOBs dans la table {p1}

source: Compacting list of deleted BLOBs in table {p1}
fr: Compactage de la liste des BLOBs supprimés dans la table {p1}

source: Compacting records in table {p1}
fr: Compactage des enregistrements dans la table {p1}
