Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DFR.xlf
Languages: fr

# ERR_dbmg_1001
source: No column to import in table {TableName}
fr: Pas de colonne à importer dans la table {TableName}

# ERR_dbmg_1002
source: Wrong table to import
fr: Table d’import incorrecte

# ERR_dbmg_1003
source: No column to export in table {TableName}
fr: Pas de colonne à exporter dans la table {TableName}

# ERR_dbmg_1004
source: Wrong table to export
fr: Table d’export incorrecte

# ERR_dbmg_1006
source: Cannot save structure of database {BaseName}
fr: Impossible de sauvegarder la structure de la base {BaseName}

# ERR_dbmg_1007
source: Cannot create data file of database: {BaseName}
fr: Impossible de créer le fichier de données de la base : {BaseName}

# ERR_dbmg_1008
source: Wrong data segment in database {BaseName}
fr: Segment de données incorrect dans la base {BaseName}

# ERR_dbmg_1009
source: Memory is full
fr: La mémoire est pleine

# ERR_dbmg_1010
source: Cannot load a table definition of database {BaseName}
fr: Impossible de charger la définition des tables de la base {BaseName}

# ERR_dbmg_1011
source: Cannot open data file of database {BaseName}
fr: Impossible d'ouvrir le fichier de données de la base {BaseName}

# ERR_dbmg_1012
source: Data segment is full in database: {BaseName}
fr: Le segment de données est plein dans la base : {BaseName}

# ERR_dbmg_1013
source: Cannot save data segment in database {BaseName}
fr: Impossible de sauvegarder le segment de données dans la base {BaseName}

# ERR_dbmg_1014
source: Cannot read data segment of database {BaseName}
fr: Impossible de lire le segment de données de la base {BaseName}

# ERR_dbmg_1015
source: Wrong database header in database {BaseName}
fr: En-tête de base de données incorrect dans la base {BaseName}

# ERR_dbmg_1016
source: Cannot create table in database {BaseName}
fr: Impossible de créer la table dans la base {BaseName}

# ERR_dbmg_1017
source: Cannot read index list of database {BaseName}
fr: Impossible de lire la liste des index de la base {BaseName}

# ERR_dbmg_1018
source: Cannot write index list of database {BaseName}
fr: Impossible d’écrire la liste des index de la base {BaseName}

# ERR_dbmg_1019
source: Wrong table reference in database {BaseName}
fr: Référence de table incorrecte dans la base {BaseName}

# ERR_dbmg_1020
source: Wrong field reference in database {BaseName}
fr: Référence de champ incorrecte dans la base {BaseName}

# ERR_dbmg_1021
source: Invalid index type in database {BaseName}
fr: Type d’index invalide dans la base {BaseName}

# ERR_dbmg_1022
source: Invalid field name in table {TableName} of database {BaseName}
fr: Nom de champ invalide pour la table {TableName} de la base {BaseName}

# ERR_dbmg_1023
source: Invalid database name
fr: Nom de base de données invalide

# ERR_dbmg_1024
source: Cannot open structure of database {BaseName}
fr: Impossible d’ouvrir la structure de la base {BaseName}

# ERR_dbmg_1025
source: Cannot create structure of database {BaseName}
fr: Impossible de créer la structure de la base {BaseName}

# ERR_dbmg_1026
source: Cannot load bit selection of database {BaseName}
fr: Impossible de charger la 'bit selection' de la base {BaseName}

# ERR_dbmg_1027
source: Cannot load set of database {BaseName}
fr: Impossible de charger l’ensemble de la base {BaseName}

# ERR_dbmg_1028
source: Cannot modify set of database {BaseName}
fr: Impossible de modifier l’ensemble de la base {BaseName}

# ERR_dbmg_1029
source: Cannot save set of database {BaseName}
fr: Impossible de sauvegarder l’ensemble de la base {BaseName}

# ERR_dbmg_1030
source: Cannot save BLOB {BlobNum} in table {TableName} of database {BaseName}
fr: Impossible de sauvegarder le BLOB {BlobNum} dans la table {TableName} de la base {BaseName}

# ERR_dbmg_1031
source: Cannot load BLOB {BlobNum} in table {TableName} of database {BaseName}
fr: Impossible de charger le BLOB {BlobNum} dans la table {TableName} de la base {BaseName}

# ERR_dbmg_1032
source: Cannot allocate BLOB {BlobNum} in table {TableName} of database {BaseName}
fr: Impossible d’allouer le BLOB {BlobNum} dans la table {TableName} de la base {BaseName}

# ERR_dbmg_1033
source: Cannot load data bit table of database {BaseName}
fr: Impossible de charger la table de bits des données de la base {BaseName}

# ERR_dbmg_1034
source: Cannot save data bit table of database {BaseName}
fr: Impossible de sauvegarder la table de bits des données de la base {BaseName}

# ERR_dbmg_1035
source: Cannot load table of data bit tables of database {BaseName}
fr: Impossible de charger la table de bits des données de la base {BaseName}

# ERR_dbmg_1036
source: Cannot save table of data bit tables in database {BaseName}
fr: Impossible de sauvegarder la table de bits des données dans la base {BaseName}

# ERR_dbmg_1037
source: Cannot close data segment of database {BaseName}
fr: Impossible de fermer le segment de données de la base {BaseName}

# ERR_dbmg_1038
source: Cannot delete data segment of database {BaseName}
fr: Impossible de supprimer le segment de données de la base {BaseName}

# ERR_dbmg_1039
source: Cannot open data segment of database {BaseName}
fr: Impossible d’ouvrir le segment de données de la base {BaseName}

# ERR_dbmg_1040
source: Cannot create data segment of database {BaseName}
fr: Impossible de créer le segment de données de la base {BaseName}

# ERR_dbmg_1041
source: Cannot allocate space in data segment
fr: Impossible d’allouer l’espace dans le segment de données

# ERR_dbmg_1042
source: Cannot free space in data segment of database {BaseName}
fr: Impossible de libérer l’espace dans le segment de données de la base {BaseName}

# ERR_dbmg_1043
source: File is write protected
fr: Le fichier est protégé en écriture

# ERR_dbmg_1044
source: Cannot access field in record {RecNum} in table {TableName} of database {BaseName}
fr: Impossible d’accéder au champ dans l'enregistrement {RecNum} de la table {TableName} de la base {BaseName}

# ERR_dbmg_1045
source: Field definition code is missing in record {RecNum} in table {TableName} of database {BaseName}
fr: Le code de définition du champ est manquant dans l'enregistrement {RecNum} de la table {TableName} de la base {BaseName}

# ERR_dbmg_1046
source: Cannot save record {RecNum} in table {TableName} of database {BaseName}
fr: Impossible de sauvegarder l’enregistrement {RecNum} de la table {TableName} de la base {BaseName}

# ERR_dbmg_1047
source: Cannot load record {RecNum} in table {TableName} of database {BaseName}
fr: Impossible de charger l’enregistrement {RecNum} de la table {TableName} de la base {BaseName}

# ERR_dbmg_1048
source: Cannot allocate record in table {TableName} of database {BaseName}
fr: Impossible d’allouer l’enregistrement de la table {TableName} de la base {BaseName}

# ERR_dbmg_1049
source: Cannot update record {RecNum} in table {TableName} of database {BaseName}
fr: Impossible de mettre à jour l’enregistrement {RecNum} de la table {TableName} de la base {BaseName}

# ERR_dbmg_1050
source: Wrong header for record {RecNum} in table {TableName} of database {BaseName}
fr: En-tête incorrect pour l'enregistrement {RecNum} de la table {TableName} de la base {BaseName}

# ERR_dbmg_1051
source: Cannot save definition of table {TableName} of database {BaseName}
fr: Impossible de sauvegarder la définition de la table {TableName} de la base {BaseName}

# ERR_dbmg_1052
source: Cannot update definition of table {TableName} of database {BaseName}
fr: Impossible de mettre à jour la définition de la table {TableName} de la base {BaseName}

# ERR_dbmg_1053
source: Field name already exists
fr: Le nom du champ existe déjà

# ERR_dbmg_1055
source: Cannot update index values while saving a record in table {TableName} of database {BaseName}
fr: Impossible de mettre à jour les valeurs d’index pendant la sauvegarde d'un enregistrement de la table {TableName} de la base {BaseName}

# ERR_dbmg_1056
source: Cannot update BLOBs while saving a record in table {TableName} of database {BaseName}
fr: Impossible de mettre à jour les BLOBs pendant la sauvegarde d'un enregistrement de la table {TableName} de la base {BaseName}

# ERR_dbmg_1057
source: Cannot delete BLOBs while saving or deleting a record in table {TableName} of database {BaseName}
fr: Impossible de supprimer les BLOBs pendant la sauvegarde ou la suppression d'un enregistrement de la table {TableName} de la base {BaseName}

# ERR_dbmg_1058
source: Cannot add field in table {TableName} of database {BaseName}
fr: Impossible d’ajouter le champ dans la table {TableName} de la base {BaseName}

# ERR_dbmg_1059
source: Cannot allocate table in memory
fr: Impossible d’allouer la table dans la mémoire

# ERR_dbmg_1061
source: Cannot allocate record in memory
fr: Impossible d’allouer l’enregistrement dans la mémoire

# ERR_dbmg_1062
source: Cannot completely delete table {TableName} of database {BaseName}
fr: Impossible de supprimer complètement la table {TableName} de la base {BaseName}

# ERR_dbmg_1063
source: Cannot lock record {RecNum} in table {TableName} of database {BaseName}
fr: Impossible de verrouiller l’enregistrement {RecNum} de la table {TableName} de la base {BaseName}

# ERR_dbmg_1064
source: Cannot unlock record {RecNum} in table {TableName} of database {BaseName}
fr: Impossible de déverrouiller l’enregistrement {RecNum} de la table {TableName} de la base {BaseName}

# ERR_dbmg_1065
source: Cannot delete record {RecNum} in table {TableName} of database {BaseName}
fr: Impossible de supprimer l’enregistrement {RecNum} de la table {TableName} de la base {BaseName}

# ERR_dbmg_1066
source: Record {RecNum} is locked in table {TableName} of database {BaseName}
fr: L’enregistrement {RecNum} est verrouillé dans la table {TableName} de la base {BaseName}

# ERR_dbmg_1067
source: Sequential search could not be completed in table {TableName} of database {BaseName}
fr: La recherche séquentielle n’a pas pu se terminer dans la table {TableName} de la base {BaseName}

# ERR_dbmg_1068
source: Cannot save header for table {TableName} of database {BaseName}
fr: Impossible de sauvegarder l’en-tête de la table {TableName} de la base {BaseName}

# ERR_dbmg_1069
source: Cannot import data in table {TableName} of database {BaseName}
fr: Impossible d’importer les données de la table {TableName} de la base {BaseName}

# ERR_dbmg_1070
source: Cannot load index header of database {BaseName}
fr: Impossible de charger l’en-tête de l’index de la base {BaseName}

# ERR_dbmg_1071
source: Cannot save header for index {IndexName} of database {BaseName}
fr: Impossible de sauvegarder l’en-tête de l’index {IndexName} de la base {BaseName}

# ERR_dbmg_1072
source: Cannot get page address for index {IndexName} of database {BaseName}
fr: Impossible de lire l’adresse de la page d’index {IndexName} de la base {BaseName}

# ERR_dbmg_1073
source: Cannot set page address for index {IndexName} of database {BaseName}
fr: Impossible d’écrire l’adresse de la page d’index {IndexName} de la base {BaseName}

# ERR_dbmg_1074
source: Cannot drop index {IndexName} of database {BaseName}
fr: Impossible de supprimer l’index {IndexName} de la base {BaseName}

# ERR_dbmg_1075
source: Cannot sort index {IndexName} of database {BaseName}
fr: Impossible de trier l'index {IndexName} de la base {BaseName}

# ERR_dbmg_1076
source: Cannot load page for index {IndexName} of database {BaseName}
fr: Impossible de charger la page d’index {IndexName} de la base {BaseName}

# ERR_dbmg_1077
source: Cannot save page for index {IndexName} of database {BaseName}
fr: Impossible de sauvegarder la page d’index {IndexName} de la base {BaseName}

# ERR_dbmg_1078
source: Cannot insert key into index {IndexName} of database {BaseName}
fr: Impossible d’insérer la clé dans l’index {IndexName} de la base {BaseName}

# ERR_dbmg_1079
source: Cannot delete key from index {IndexName} of database {BaseName}
fr: Impossible de supprimer la clé de l’index {IndexName} de la base {BaseName}

# ERR_dbmg_1080
source: Cannot completely delete index {IndexName} of database {BaseName}
fr: Impossible de supprimer complètement l’index {IndexName} de la base {BaseName}

# ERR_dbmg_1081
source: Cannot complete scan on index {IndexName} of database {BaseName}
fr: Impossible d’accomplir le balayage de l’index {IndexName} de la base {BaseName}

# ERR_dbmg_1082
source: Cannot complete sort of index {IndexName} of database {BaseName}
fr: Impossible d’accomplir le tri de l’index {IndexName} de la base {BaseName}

# ERR_dbmg_1083
source: Cannot insert key into page of index {IndexName} of database {BaseName}
fr: Impossible d’insérer la clé dans la page d’index {IndexName} de la base {BaseName}

# ERR_dbmg_1084
source: Cannot delete key from page of index {IndexName} of database {BaseName}
fr: Impossible de supprimer la clé dans la page d’index {IndexName} de la base {BaseName}

# ERR_dbmg_1085
source: Cannot load index cluster of database {BaseName}
fr: Impossible de charger le cluster d’index de la base {BaseName}

# ERR_dbmg_1086
source: Cannot add to index cluster of database {BaseName}
fr: Impossible d’ajouter au cluster d’index de la base {BaseName}

# ERR_dbmg_1087
source: Cannot delete from index cluster of database {BaseName}
fr: Impossible de supprimer dans le cluster d’index de la base {BaseName}

# ERR_dbmg_1088
source: Index {IndexName} is invalid or missing
fr: L'index {IndexName} est invalide ou manquant

# ERR_dbmg_1089
source: SQL syntax error (Obsolete)
fr: Erreur de syntaxe SQL (Obsolète)

# ERR_dbmg_1090
source: SQL token not found (Obsolete)
fr: Mot-clé SQL non trouvé (Obsolète)

# ERR_dbmg_1091
source: Not implemented
fr: Non implémenté

# ERR_dbmg_1092
source: Cannot register code
fr: Impossible d’enregistrer le code

# ERR_dbmg_1093
source: Operation in progress cancelled by user
fr: Opération en cours annulée par l’utilisateur

# ERR_dbmg_1094
source: Transaction conflict
fr: Conflit de transaction

# ERR_dbmg_1095
source: Invalid table name in database {BaseName}
fr: Nom de table invalide dans la base {BaseName}

# ERR_dbmg_1096
source: Table {TableName} is locked in database {BaseName}
fr: La table {TableName} est verrouillée dans la base {BaseName}

# ERR_dbmg_1097
source: Database {BaseName} is locked
fr: La base {BaseName} est verrouillée

# ERR_dbmg_1098
source: Data address is invalid in database {BaseName}
fr: L’adresse de données est invalide dans la base {BaseName}

# ERR_dbmg_1099
source: Record is empty
fr: L’enregistrement est vide

# ERR_dbmg_1100
source: Wrong source field
fr: Champ source incorrect

# ERR_dbmg_1101
source: Wrong destination field
fr: Champ destination incorrect

# ERR_dbmg_1102
source: Invalid relation name
fr: Nom de lien invalide

# ERR_dbmg_1103
source: Field types do not match
fr: Types de champ incompatibles

# ERR_dbmg_1104
source: Relation is empty
fr: Le lien est vide

# ERR_dbmg_1105
source: Cannot load relations list from database {BaseName}
fr: Impossible de charger la liste des liens à partir de la base {BaseName}

# ERR_dbmg_1106
source: Cannot save relations list into database {BaseName}
fr: Impossible de sauvegarder la liste des liens dans la base {BaseName}

# ERR_dbmg_1107
source: Query and lock not completed; at least one record locked somewhere else
fr: Requête et verrouillage incomplets, un enregistrement au moins était verrouillé

# ERR_dbmg_1108
source: Invalid record
fr: Enregistrement invalide

# ERR_dbmg_1109
source: Wrong record ID
fr: Numéro d’enregistrement incorrect

# ERR_dbmg_1110
source: Relation already exists in database {BaseName}
fr: Le lien existe déjà dans la base {BaseName}

# ERR_dbmg_1111
source: Index already exists in database {BaseName}
fr: L’index existe déjà dans la base {BaseName}

# ERR_dbmg_1112
source: Wrong comparison operator
fr: Opérateur de comparaison incorrect

# ERR_dbmg_1113
source: End of data buffer
fr: Fin du buffer de données

# ERR_dbmg_1114
source: Wrong DB4D version number
fr: Numéro de version DB4D incorrect

# ERR_dbmg_1115
source: Duplicated key
fr: Clé dupliquée

# ERR_dbmg_1116
source: Mandatory field is Null in record {RecNum} in table {TableName}
fr: Le champ obligatoire est Null dans l'enregistrement {RecNum} de la table {TableName}

# ERR_dbmg_1117
source: Cannot set field to mandatory for table {TableName}
fr: Impossible d’appliquer l’attribut Obligatoire au champ de la table {TableName}

# ERR_dbmg_1118
source: Cannot get exclusive access to table {TableName}
fr: Impossible d’obtenir un accès exclusif à la table {TableName}

# ERR_dbmg_1119
source: Cannot check referential integrity of table {TableName}
fr: Impossible de vérifier l’intégrité référentielle de la table {TableName}

# ERR_dbmg_1120
source: Reference integrity: some foreign keys still exist matching primary key on record {RecNum} in table {TableName}
fr: Intégrité référentielle : il y a encore des clés externes correspondant à la clé primaire de l'enregistrement {RecNum} de la table {TableName}

# ERR_dbmg_1121
source: Cannot delete all records in selection of table {TableName}
fr: Impossible de supprimer tous les enregistrements de la sélection de la table {TableName}

# ERR_dbmg_1122
source: BLOB is Null
fr: Le BLOB est Null

# ERR_dbmg_1123
source: Invalid database context
fr: Contexte de base de données incorrect

# ERR_dbmg_1124
source: Invalid relation reference
fr: Référence de lien invalide

# ERR_dbmg_1125
source: Invalid record name in table {TableName}
fr: Nom d’enregistrement incorrect dans la table {TableName}

# ERR_dbmg_1126
source: Wrong field type
fr: Type de champ incorrect

# ERR_dbmg_1127
source: Cannot load extra properties
fr: Impossible de charger les propriétés additionnelles

# ERR_dbmg_1128
source: Cannot save extra properties
fr: Impossible de sauvegarder les propriétés additionnelles

# ERR_dbmg_1129
source: Subrecord ID is out of range
fr: Le numéro du sous-enregistrement est en dehors des limites

# ERR_dbmg_1130
source: Duplicate name for index {IndexName} in database {BaseName}
fr: Nom dupliqué pour l'index {IndexName} dans la base {BaseName}

# ERR_dbmg_1131
source: Invalid name for index {IndexName} in database {BaseName}
fr: Nom invalide pour l'index {IndexName} dans la base {BaseName}

# ERR_dbmg_1132
source: Wrong key value on index {IndexName}
fr: Valeur de clé invalide pour l'index {IndexName}

# ERR_dbmg_1133
source: Wrong type for index {IndexName}
fr: Type incorrect pour l'index {IndexName}

# ERR_dbmg_1134
source: Invalid accessor
fr: Accesseur invalide

# ERR_dbmg_1135
source: Accessor is read only
fr: L’accesseur est en lecture seulement

# ERR_dbmg_1136
source: Null value not accepted
fr: Valeur Null non acceptée

# ERR_dbmg_1137
source: THIS is Null
fr: THIS est Null

# ERR_dbmg_1138
source: Selection is Null
fr: La sélection est Null

# ERR_dbmg_1139
source: Database {BaseName} is write protected
fr: La base de données {BaseName} est protégée en écriture

# ERR_dbmg_1140
source: Database {BaseName} is closing
fr: La base de données {BaseName} est en cours de fermeture

# ERR_dbmg_1141
source: Invalid transaction
fr: Transaction invalide

# ERR_dbmg_1142
source: Array limit is exceeded
fr: La limite de tableau est dépassée

# ERR_dbmg_1143
source: Creator of array values is missing
fr: Le créateur des valeurs du tableau est manquant

# ERR_dbmg_1144
source: Cannot build selection of table {TableName}
fr: Impossible de construire la sélection de la table {TableName}

# ERR_dbmg_1145
source: Busy object
fr: Objet actuellement indisponible

# ERR_dbmg_1146
source: Data file does not match structure file
fr: Le fichier de données ne correspond pas au fichier de structure

# ERR_dbmg_1147
source: Cannot start listener
fr: Impossible de lancer le serveur d'écoute réseau

# ERR_dbmg_1148
source: Cannot start server
fr: Impossible de lancer le serveur

# ERR_dbmg_1149
source: No listener
fr: Pas de serveur d'écoute réseau

# ERR_dbmg_1150
source: Task is dying
fr: Le process est en train de mourir

# ERR_dbmg_1151
source: Invalid request tag
fr: Balise de requête invalide

# ERR_dbmg_1152
source: Invalid context ID
fr: Numéro de contexte invalide

# ERR_dbmg_1153
source: Not enough temporary space on disk
fr: Espace disque temporaire insuffisant

# ERR_dbmg_1154
source: Data set is Null
fr: L’ensemble de données est Null

# ERR_dbmg_1155
source: No primary key matching the foreign key
fr: Aucune clé primaire ne correspond à la clé externe

# ERR_dbmg_1156
source: Type of field {FieldName} of table {TableName} does not support being set to Unique
fr: Le type du champ {FieldName} de la table {TableName} n’accepte pas l’attribut Unique

# ERR_dbmg_1157
source: Type of field {FieldName} of table {TableName} does not support being set to NEVER NULL
fr: Le type du champ {FieldName} de la table {TableName} n’accepte pas l’attribut NEVER NULL (jamais Null)

# ERR_dbmg_1158
source: Cannot alter primary key definition of table {TableName}
fr: Impossible de modifier la définition de la clé primaire de la table {TableName}

# ERR_dbmg_1159
source: Maximum number of records has been reached for table {TableName}
fr: Le nombre maximal d’enregistrements a été atteint pour la table {TableName}

# ERR_dbmg_1160
source: Maximum number of BLOBs has been reached for table {TableName}
fr: Le nombre maximal de BLOBs a été atteint pour la table {TableName}

# ERR_dbmg_1161
source: Indice is out of range
fr: L'indice est en dehors des limites

# ERR_dbmg_1162
source: Query is invalid
fr: La requête est invalide

# ERR_dbmg_1163
source: Record is NULL
fr: L'enregistrement est Null

# ERR_dbmg_1164
source: Object is NULL
fr: L'objet est Null

# ERR_dbmg_1165
source: Wrong owner for this object
fr: Propriétaire incorrect pour cet objet

# ERR_dbmg_1166
source: Object was not locked
fr: L'objet n'était pas verrouillé

# ERR_dbmg_1167
source: Object is locked by another context
fr: L'objet est verrouillé par un autre contexte

# ERR_dbmg_1168
source: Internal error on remote connection
fr: Erreur interne sur une connexion distante

# ERR_dbmg_1169
source: Invalid table number
fr: Numéro de table invalide

# ERR_dbmg_1170
source: Invalid field number
fr: Numéro de champ invalide

# ERR_dbmg_1171
source: Invalid Database ID
fr: Numéro de base de données invalide

# ERR_dbmg_1172
source: Invalid Parameter
fr: Paramètre invalide

# ERR_dbmg_1173
source: Cache Flushing did not complete
fr: L'écriture du cache est incomplète

# ERR_dbmg_1174
source: Data Flushing did not complete
fr: L'écriture des données est incomplète

# ERR_dbmg_1175
source: Structure Flushing did not complete
fr: L'écriture de la structure est incomplète

# ERR_dbmg_1176
source: Log file is invalid for database {BaseName}
fr: Le fichier d'historique est invalide pour la base {BaseName}

# ERR_dbmg_1177
source: Log file cannot be found for database {BaseName}
fr: Le fichier d'historique est introuvable pour la base {BaseName}

# ERR_dbmg_1178
source: Last operation in log file does not match the one in database {BaseName}
fr: La dernière opération du fichier d'historique ne correspond pas à la base {BaseName}

# ERR_dbmg_1179
source: Log file does not match database {BaseName}
fr: Le fichier d'historique ne correspond pas à la base {BaseName}

# ERR_dbmg_1180
source: Data Table has been deleted
fr: Les données de la table ont été supprimées

# ERR_dbmg_1181
source: Keys are not unique in index {IndexName}
fr: Les clés ne sont pas uniques dans l'index {IndexName}

# ERR_dbmg_1182
source: Cannot create log file for database {BaseName}
fr: Impossible de créer un fichier d'historique pour la base {BaseName}

# ERR_dbmg_1183
source: Cannot write into log file of database {BaseName}
fr: Impossible d'écrire dans le fichier d'historique de la base {BaseName}

# ERR_dbmg_1184
source: Cannot drop table {TableName} in database {BaseName}
fr: Impossible de déposer la table {TableName} dans la base {BaseName}

# ERR_dbmg_1185
source: Remote database cannot be opened
fr: La base de données distante ne peut pas être ouverte
