Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DDE.xlf
Languages: de

source: Cannot read extra property data
de: Die Daten der zusätzlichen Eigenschaften können nicht gelesen werden

source: Extra property tag header is invalid
de: Der Tag Header der zusätzlichen Eigenschaften ist ungültig

source: Extra property length stored in tag header does not match
de: Die im Tag Header gespeicherte Länge der zusätzlichen Eigenschaften stimmt nicht überein

source: Address of page address directory is invalid
de: Die Adresse des Verzeichnisses der Seitenadressen ist ungültig

source: Address of cluster address directory is invalid
de: Die Adresse des Verzeichnisses der Clusteradressen ist ungültig

source: Tag header of page address directory is invalid
de: Der Tag Header des Verzeichnisses der Seitenadressen ist ungültig

source: Tag header of cluster address directory is invalid
de: Der Tag Header des Verzeichnisses der Clusteradressen ist ungültig

source: Cannot read data for page address directory
de: Daten für Verzeichnis der Seitenadressen können nicht gelesen werden

source: Cannot read data for cluster address directory
de: Daten für Verzeichnis der Clusteradressen können nicht gelesen werden

source: Checksum of page address directory is invalid
de: Prüfsumme für Verzeichnis der Seitenadressen ist ungültig

source: Checksum of cluster address directory is invalid
de: Prüfsumme für Verzeichnis der Clusteradressen ist ungültig

source: Cluster type is invalid
de: Clustertyp ist ungültig

source: The number of records in cluster is invalid
de: Die Anzahl Datensätze im Cluster ist ungültig

source: Cluster contains invalid record references
de: Cluster enthält ungültige Datensatz-Verweise

source: Cluster contains deleted record references
de: Cluster enthält gelöschte Datensatz-Verweise

source: Cluster bits count is invalid
de: Cluster Bit-Anzahl ist ungültig

source: The number of index keys is invalid
de: Die Anzahl Index-Einträge ist ungültig

source: Cluster contains duplicated record references
de: Cluster enthält doppelte Datensatz-Verweise

source: Subpage reference is invalid
de: Unter-Seite-Referenz ist ungültig

source: Subpage reference is deleted
de: Unter-Seite-Referenz ist gelöscht

source: The keys directory is invalid
de: Das Verzeichnis der Einträge ist ungültig

source: Key references an invalid record number
de: Der Eintrag bezieht sich auf eine ungültige Datensatznummer

source: Key references a deleted record number
de: Der Eintrag bezieht sich auf eine gelöschte Datensatznummer

source: Key references a duplicated record number
de: Der Eintrag bezieht sich auf eine doppelte Datensatznummer

source: The keys are not in the right order
de: Die Einträge sind nicht in der richtigen Reihenfolge

source: Invalid key
de: Ungültiger Eintrag

source: Some record references are missing
de: Einige Datensatz-Verweise fehlen

source: This index page is used in a circular reference
de: Diese Indexsseite wird in einer zirkularen Referenz verwendet

source: Checksum of data table header is invalid
de: Die Prüfsumme der Daten-Tabellen-Header ist ungültig

source: Length of data table header is invalid
de: Die Länge der Daten-Tabellen-Header ist ungültig/target>

source: Tag header of data table header is invalid
de: Der Tag Header der Daten-Tabellen-Header ist ungültig

source: Cannot read data of data table header
de: Daten des Daten-Tabellen-Header können nicht gelesen werden

source: Address of data table header is invalid
de: Adresse des Daten-Tabellen-Header ist ungültig

source: Wrong data type number in index
de: *Ungültige Datentypnummer in Index

source: The structure and data file do not match
de: Die Struktur paßt nicht zu dieser Datendatei

source: Missing Index file .4DIndx or .4DIndy
de: Die Indexdatei .4DIndx oder .4DIndy fehlt

source: Last database flush did not complete.
de: Das letzte Schreiben des Datencaches war nicht vollständig.

source: Address overlaps
de: Adressenüberschneidung

source: Index is flagged to be rebuilt
de: Index ist für Neuerzeugung markiert

source: External BLOB file is missing
de: Externes BLOB Dokument fehlt

source: Problem on the database
de: Problem mit der Datenbank

source: Problem on the data segment # {SegNum}
de: Problem mit Datensegment # {SegNum}

source: Problem on the secondary directory # {BittableTable} of bit tables in the data segment # {SegNum}
de: Problem mit dem sekundären Verzeichnis # {BittableTable} der Bit-Tabellen im Datensegment # {SegNum}

source: Problem on the bit table # {Bittable} in the secondary directory # {BittableTable} of bit tables in the data segment # {SegNum}
de: Problem mit der Bit-Tabelle # {Bittable} im sekundären Verzeichnis # {BittableTable} der Bit-Tabellen im Datensegment # {SegNum}

source: Problem on the {TableName} data table
de: Problem mit der Tabelle {TableName}

source: Problem on record address directory # {RecordAddressTableNum} in the {TableName} data table
de: Problem mit der Adresstabelle # {RecordAddressTableNum} der Tabelle {TableName}

source: Problem on BLOB address directory # {BlobAddressTableNum} in the {TableName} data table
de: Problem mit der BLOB-Adresstabelle # {BlobAddressTableNum} der Tabelle {TableName}

source: Problem on BLOB # {BlobNum} in the {TableName} data table
de: Problem mit BLOB # {BlobNum} der Tabelle {TableName}

source: Problem on record # {RecordNum} in the {TableName} data table
de: Problem mit Datensatz # {RecordNum} der Tabelle {TableName} data table

source: Problem on field {FieldName} in record # {RecordNum} in the {TableName} data table
de: Problem mit Feld {FieldName} in Datensatz # {RecordNum} der Tabelle {TableName}

source: Problem on directory of table definitions
de: Problem mit dem Verzeichnis der Tabellendefinitionen

source: Problem on {TableName} table definition
de: Problem mit der Tabellendefinition der Tabelle {TableName}

source: Problem on directory of relation definitions
de: Problem mit dem Verzeichnis der Verknüpfungsdefinitionen

source: Problem on relation definition # {RelationNum}
de: Problem mit der Verknüpfungsdefinition # {RelationNum}

source: Problem on directory of sequence numbers
de: Problem mit dem Verzeichnis der Sequenznummern

source: Problem on sequence number # {SeqNum}
de: Problem in Sequenznummer # {SeqNum}

source: Problem on directory of index definitions
de: Problem in Verzeichnis der Index-Definitionen

source: Problem on index definition {IndexName}
de: Problem in Index Definition {IndexName}

source: Problem on directory of backup index definitions
de: Problem in Verzeichnis der Backup-Index-Definitionen

source: Problem on backup index definition {IndexName}
de: Problem in Backup Index Definition {IndexName}

source: UUID Conflict between {ObjType1}:{ObjName1} and {ObjType2}:{ObjName2}
de: UUID Konflikt zwischen {ObjType1}:{ObjName1} und {ObjType2}:{ObjName2}

source: Problem on field definition {FieldName} in {TableName} table
de: Problem in Felddefinition {FieldName} in Tabelle {TableName}

source: Problem on page address directory # {IndexPageAddressTable} in {IndexName} index
de: Problem in Verzeichnis der Seitenadressen # {IndexPageAddressTable} in {IndexName} Index

source: Problem on page # {IndexPageNum} in {IndexName} index
de: Problem in Seite # {IndexPageNum} in {IndexName} index

source: Problem on {IndexName} index
de: Problem in {IndexName} Index

source: Problem on cluster # {IndexClusterNum} in {IndexName} index
de: Problem in Cluster # {IndexClusterNum} in {IndexName} Index

source: Problem on cluster address directory # {IndexClusterAddressTable} in {IndexName} index
de: Problem in Verzeichnis der Clusteradressen # {IndexClusterAddressTable} in {IndexName} Index

source: Problem on bit page # {BitPageNum} in cluster # {IndexClusterNum} in {IndexName} index
de: Problem in Bit-Tabelle # {BitPageNum} in Cluster # {IndexClusterNum} in {IndexName} Index

source: Problem on directory of data table headers
de: Problem in Verzeichnis der Daten-Tabellen-Header

source: Problem in NULLS cluster of {IndexName} index
de: Problem in NULLS Cluster von Index {IndexName}

source: Problem on bit page # {BitPageNum} in NULLS cluster of {IndexName} index
de: Problem in Bit Seite # {BitPageNum} in NULLS Cluster von Index {IndexName}

source: Overlapping {ObjType} at offset {ObjAddr} with length {ObjLen} in data segment # {SegNum}
de: Überlappung {ObjType} an Offset {ObjAddr} mit Länge {ObjLen} in Datensegment # {SegNum}

source: Overlapping Objects in data segment # {SegNum}
de: Überlappende Objekte in Datensegment # {SegNum}

source: Table
de: Tabelle

source: Field
de: Feld

source: Automatic Sequence Number
de: Automatische Sequenznummer

source: Relation
de: Verknüpfung

source: Loading data tables
de: Lade Datentabellen

source: Checking data table definitions
de: Prüfe Datentabellen Definitionen

source: Checking chained list of deleted table definitions
de: Prüfe verkettete Liste der gelöschten Datentabellen Definitionen

source: Checking index definitions
de: Prüfe Index Definitionen

source: Checking chained list of deleted index definitions
de: Prüfe verkettete Liste der gelöschten Index Definitionen

source: Checking backup index definitions
de: Prüfe Backup Index Definitionen

source: Checking chained list of deleted backup index definitions
de: Prüfe verkettete Liste der gelöschten Backup Index Definitionen

source: Checking relation definitions
de: Prüfe Verküpfungen-Definitionen

source: Checking chained list of deleted relation definitions
de: Prüfe verkettete Liste der gelöschten Verknüpfungen-Definitionen

source: Checking auto sequence number definitions
de: Prüfe automatische Sequenznummern Definitionen

source: Checking chained list of deleted auto sequence number definitions
de: Prüfe verkettete Liste der gelöschten automatischen Sequenznummern Definitionen

source: Checking data table headers
de: Prüfe Datentabellen Header

source: Checking chained list of deleted data table headers
de: Prüfe verkettete Liste der gelöschten Datentabellen Header

source: Checking BLOBs in table {p1}
de: Prüfe BLOBs in Tabelle {p1}

source: Checking list of deleted BLOBs in table {p1}
de: Prüfe Liste der gelöschten BLOBs in Tabelle {p1}

source: Checking records in table {p1}
de: Prüfe Datensätze in Tabelle {p1}

source: Checking list of deleted records in table {p1}
de: Prüfe Liste der gelöschten Datensätze in Tabelle {p1}

source: Check bit tables for segment {SegNum}
de: Prüfe Bit-Tabellen für Segment {SegNum}

source: Checking index pages on {p1}
de: Prüfe Indexseite für {p1}

source: Checking index page addresses on {p1}
de: Prüfe Indexseitenadresse für {p1}

source: Checking list of deleted index pages on {p1}
de: Prüfe Liste gelöschter Indexseiten für {p1}

source: Checking clusters on {p1}
de: Prüfe Cluster für {p1}

source: Checking list of deleted clusters on {p1}
de: Prüfe Liste gelöschter Cluster für {p1}

source: on
de: für

source: Keywords Index
de: Volltext Index

source: Composite Index
de: Zusammengesetzter Index

source: Scanning data
de: Scanne Daten

source: Recovering records
de: Datensatz Wiederherstellung

source: Recovering BLOBs
de: Blob Wiederherstellung

source: (Table# {p1} out of {p2} tables)
de: (Table# {p1} von {p2} Tabellen)

source: Checking index {p1}
de: Prüfe Index {p1}

source: Object Index
de: Objekt-Index

source: Loading data
de: Lade Daten

source: Integrating journal: {curValue} of {maxValue} entries
de: Integriere Logbuch: {curValue} von {maxValue} Einträgen

source: Sequential sorting on {TableName}: {curValue} of {maxValue} records
de: Sequentielle Sortierung von {TableName}: {curValue} von {maxValue} Datensätze

source: Sequential searching on {TableName}: {curValue} of {maxValue} records
de: Sequentielle Suche von {TableName}: {curValue} von {maxValue} Datensätze

source: Exporting a selection of records: {curValue} of {maxValue} records
de: Exportiere Datensätze: {curValue} von {maxValue} Datensätze

source: Indexing calculation formulas: {curValue} of {maxValue} pages
de: Indiziere Berechnungsformeln: {curValue} von {maxValue} Seiten

source: Computing distinct indexed values: {curValue} of {maxValue} pages
de: Indiziere einmalige Werte: {curValue} von {maxValue} Schlüssel

source: Indexed sorting: {curValue} of {maxValue} keys
de: Indizierte Sortierung: {curValue} von {maxValue} Schlüsseln

source: Building of
de: Erzeuge

source: Building index on one field: {curValue} of {maxValue} records
de: Erzeuge Index für ein Feld: {curValue} von {maxValue} Datensätze

source: Building full text index on one field: {curValue} of {maxValue} records
de: Erzeuge Volltext-Index für ein Feld: {curValue} von {maxValue} Datensätze

source: Building composite index: {curValue} of {maxValue} records
de: Erzeuge zusammengesetzten Index: {curValue} von {maxValue} Datensätze

source: Merging items
de: Führe Einträge zusammen

source: Building selection
de: Erzeuge Auswahl

source: Generating index pages
de: Erzeuge Indexseiten

source: Generating clusters
de: Erzeuge Cluster

source: Generating clusters
de: Erzeuge Cluster

source: Generating index clusters
de: Erzeuge Index-Cluster

source: Sequential sorting
de: Sequentielle Sortierung

source: Sorting data
de: Sortiere Daten

source: Deleting address table: {curValue} of {maxValue} entries
de: Lösche Adresstabelle: {curValue} von {maxValue} Einträgen

source: Flushing Data
de: Sichern auf Festplatte

source: Deleting records: {curValue} of {maxValue}
de: Lösche Datensätze: {curValue} von {maxValue}

source: Analyzing Log file
de: Analysiere Logbuch

source: Selection to array: {curValue} of {maxValue}
de: Selection to Array: {curValue} von {maxValue}

source: Array to selection: {curValue} of {maxValue}
de: Array to selection: {curValue} von {maxValue}

source: Indexing calculation formulas: {curValue} of {maxValue} keys
de: Indiziere berechnete Formeln: {curValue} von {maxValue} Schlüsseln

source: Index searching: {curValue} of {maxValue} pages
de: Index Suche: {curValue} von {maxValue} Seiten

source: Index scanning: {curValue} of {maxValue} pages
de: Index Scan: {curValue} von {maxValue} Seiten

source: Computing statistics: {curValue} of {maxValue} records
de: Berechne Statistiken: {curValue} von {maxValue} Datensätze

source: Exporting {TableName} as SQL: {curValue} of {maxValue} records
de: Exportiere {TableName} als SQL: {curValue} von {maxValue} Datensätzen

source: Exporting database: {curValue} of {maxValue} tables
de: Exportiere Datenbank: {curValue} von {maxValue} Tabellen

source: Cleaning destination folder...
de: Lösche Zielordner...

source: Checking uniqueness
de: Prüfe Einmaligkeit

source: Checking primary keys on {TableName}: {curValue} of {maxValue} records
de: Prüfe Primärschlüssel für {TableName}: {curValue} von {maxValue} Datensätzen

source: data segment header
de: Datensegment Header

source: primary directory of bit table
de: Primäres Verzeichnis der Bit-Tabelle

source: secondary directory # {param2} of bit table
de: Sekundäres Verzeichnis {param2} der Bit-Tabelle

source: bit table # {param3} of directory # {param2}
de: Bit-Tabelle # {param3} des Verzeichnisses # {param2}

source: auto sequence header # {param1}
de: Auto Sequenz Kopfteil # {param1}

source: data table header # {param1}
de: Datentabelle Kopfteil # {param1}

source: index header # {param1}
de: Index Kopfteil # {param1}

source: table definition # {param1}
de: Tabellendefinition # {param1}

source: BLOB # {param1} of {TableName}
de: BLOB # {param1} von {TableName}

source: record # {param1} of {TableName}
de: Datensatz # {param1} von {TableName}

source: address table
de: Adresstabelle

source: records address table of {TableName}
de: Datensatzadresstabelle für {TableName}

source: BLOBs address table of {TableName}
de: BLOBs Adreßtabelle von {TableName}

source: index address table of {IndexName}
de: Indexadresstabelle von {IndexName}

source: clusters address table of {IndexName}
de: Cluster Adresstabelle von {IndexName}

source: extra property
de: Zusätzliche Eigenschaft

source: index page # {param1} of {IndexName}
de: Index Seite # {param1} von {IndexName}

source: index cluster # {param1} of {IndexName}
de: Index Cluster # {param1} von {IndexName}

source: part # {param2} of index cluster # {param1} of {IndexName}
de: Teil # {param2} von Index Cluster # {param1} von {IndexName}

# default_table_name
source: Table_{id}
de: Tabelle_{id}

# default_field_name
source: Field_{id}
de: Feld_{id}

# default_many_to_one_name
source: Link_{id}
de: Relation_{id}

# default_one_to_many_name
source: Link_{id}_return
de: Relation_{id}_Viele

source: Compacting data table definitions
de: Komprimiere Datentabellen Definitionen

source: Compacting chained list of deleted table definitions
de: Komprimiere verkettete Liste der gelöschten Datentabellen Definitionen

source: Compacting index definitions
de: Prüfe Index Definitionen

source: Compacting chained list of deleted index definitions
de: Komprimiere verkettete Liste der gelöschten Index Definitionen

source: Compacting backup index definitions
de: Komprimiere Backup Index Definitionen

source: Compacting chained list of deleted backup index definitions
de: Komprimiere verkettete Liste der gelöschten Backup Index Definitionen

source: Compacting relation definitions
de: Komprimiere Verküpfungen-Definitionen

source: Compacting chained list of deleted relation definitions
de: Komprimiere verkettete Liste der gelöschten Verknüpfungen-Definitionen

source: Compacting auto sequence number definitions
de: Komprimiere automatische Sequenznummern Definitionen

source: Compacting chained list of deleted auto sequence number definitions
de: Komprimiere verkettete Liste der gelöschten automatischen Sequenznummern Definitionen

source: Compacting data table headers
de: Komprimiere Datentabellen Header

source: Compacting chained list of deleted data table headers
de: Komprimiere verkettete Liste der gelöschten Datentabellen Header

source: Compacting BLOBs in table {p1}
de: Komprimiere BLOBs in Tabelle {p1}

source: Compacting list of deleted BLOBs in table {p1}
de: Komprimiere Liste der gelöschten BLOBs in Tabelle {p1}

source: Compacting records in table {p1}
de: Komprimiere Datensätze in Tabelle {p1}

source: Compacting list of deleted records in table {p1}
de: Komprimiere Liste der gelöschten Datensätze in Tabelle {p1}

source: Compact bit tables for segment {SegNum}
de: Komprimiere Bit-Tabellen für Segment {SegNum}

source: Compacting index pages on {p1}
de: Komprimiere Indexseite für {p1}

source: Compacting index page addresses on {p1}
de: Komprimiere Indexseitenadresse für {p1}

source: Compacting list of deleted index pages on {p1}
de: Komprimiere Liste gelöschter Indexseiten für {p1}

source: Compacting clusters on {p1}
de: Komprimiere Cluster für {p1}

source: Compacting list of deleted clusters on {p1}
de: Komprimiere Liste gelöschter Cluster für {p1}

source: Compacting index {p1}
de: Komprimiere Index {p1}

source: Extra properties stream has been repaired
de: Zusätzliche Eigenschaften Stream wurde repariert

source: The table of relations has been repaired
de: Tabelle der Relationen wurde repariert

source: The index definition has been repaired
de: Index Definitionen wurden repariert

source: Compacting records of table {p1}
de: Komprimiere Datensätze der Tabelle {p1}

source: Compacting BLOBs of table {p1}
de: Komprimiere BLOBs der Tabelle {p1}

source: Indexing
de: Indizierung
