Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DCS.xlf
Languages: cs

# ERR_dbmg_1576
source: The relation based on "{Param1}" is not N-to-1
cs: Vztah založený na "{Param1}" je N-to-1 (skupina k jedinci)

# ERR_dbmg_1577
source: The relation based on "{Param1}" is not 1-to-N
cs: Vztah založený na "{Param1}" je not 1-to-N (jedinec k skupině)

# ERR_dbmg_1578
source: The {Param1} attribute is not a relation attribute
cs: Vlastnost {Param1} není vlastnost vztahu

# ERR_dbmg_1579
source: "{Param1}" is not a valid relation
cs: "{Param1}" není platný vztah

# ERR_dbmg_1580
source: The relation path is empty
cs: Cesta vztahu je prázdná

# ERR_dbmg_1581
source: Cannot resolve "{Param1}" as a relation path
cs: Nelze vyhodnotit "{Param1}" jako cestu vztahu

# ERR_dbmg_1582
source: Event's kind is missing or invalid
cs: Druh události chybí nebo je neplatný

# ERR_dbmg_1583
source: Event's method is missing or invalid
cs: Metoda události chybí nebo je neplatná

# ERR_dbmg_1584
source: Alias attributes can only return scalar values
cs: Vlastnost Alias může navrátit pouze skalární hodnoty

# ERR_dbmg_1585
source: An error occurred during JavaScript execution
cs: Během provádění Javascript se vyskytla chyba

# ERR_dbmg_1586
source: Not a valid entity collection
cs: Neplatná kolekce entity

# ERR_dbmg_1587
source: The entity collections come from incompatible datastore classes
cs: Entity kolekce pocházejí od nekompatibilních typů úložiště dat

# ERR_dbmg_1588
source: The "{Param1}" attribute is duplicated
cs: Vlastnost entity "{Param1}" je duplicitní

# ERR_dbmg_1589
source: The "{Param1}" attribute is from another datastore class
cs: Vlastnost "{Param1}" je z jiné třídy úložiště databáze

# ERR_dbmg_1590
source: "{Param1}" is recursively used to build a relation path for the "{EntityModelName}" datastore class
cs: "{Param1}" je rekurzivně použit k sestavení cesty vztahu pro třídu úložiště databáze "{EntityModelName}"

# ERR_dbmg_1591
source: String length cannot be less than {Param1}
cs: Délka řetězce nemůže být menší než {Param1}

# ERR_dbmg_1592
source: String length cannot be greater than {Param1}
cs: Délka řetězce nemůže být větší než {Param1}

# ERR_dbmg_1593
source: String length must be {Param1}
cs: Délka řetězce musí být {Param1}

# ERR_dbmg_1594
source: The "{Param1}" attribute in the "{EntityModelName}" datastore class cannot be used for sorting
cs: Vlastnost "{Param1}" v třídě úložište dat "{EntityModelName}" nemůže být použita pro třídění

# ERR_dbmg_1595
source: The "{Param1}" remote datastore class cannot be created locally
cs: Vzdálená třída úložiště dat "{Param1}" nemůže být vytvořena lokálně

# ERR_dbmg_1596
source: The command "addRemoteStore" or "openRemoteStore" cannot be used in that context
cs: Příkaz "addRemoteStore" nebo "openRemoteStore" nemůže být použit v tomto kontextu

# ERR_dbmg_1597
source: The remote catalog log file is missing.
cs: Soubor chybí.

# ERR_dbmg_1600
source: This entity does not belong to the {Param1} datastore class
cs: Tato entita nepatří do třídy úložiště dat {Param1}

# ERR_dbmg_1601
source: This query is not valid for this datastore class
cs: Tento dotaz není pro tuto třídu úložiště dat platný

# ERR_dbmg_1602
source: Invalid collection returned by restricting query event for the {Param1} datastore class
cs: Neplatná sada navrácená omezující událostí dotazu pro třídu úložiště dat {Param1}

# ERR_dbmg_1603
source: This entity collection does not belong to the {Param1} datastore class
cs: Tato sada entit nepatří do třídy úložiště dat {Param1}

# ERR_dbmg_1604
source: SQL connector is missing
cs: SQL connector chybí

# ERR_dbmg_1605
source: Connection cannot be established with SQL server
cs: Nelze navázat spojení s SQL serverem

# ERR_dbmg_1606
source: The {Param1} datastore class is not a local one
cs: Třída úložiště databáze {Param1} není lokální

# ERR_dbmg_1607
source: No permission to read for the "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class
cs: Žádné oprávnění číst vlastnost "{EntityAttributeName}" třídy úložiště dat "{EntityModelName}"

# ERR_dbmg_1608
source: No permission to update for the "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class
cs: Žádné oprávnění aktualizovat vlastnost "{EntityAttributeName}" třídy úložiště dat "{EntityModelName}"

# ERR_dbmg_1609
source: No permission to describe the {EntityModelName} datastore class
cs: Žádné oprávnění pro vlastnost describe tříd úložiště dat {EntityModelName}

# ERR_dbmg_1610
source: A remote request to host: "{Param1}" has failed
cs: Vzdálený požadavek k host: "{Param1}" selhal

# ERR_dbmg_1611
source: You must log into the Admin group to obtain information regarding your project.
cs: K získání informací o vašem projektu se musíte přihlásit do skupiny Admin.

# ERR_dbmg_1612
source: Remote entity catalog is invalid or missin at host: "{Param1}".
cs: Katalog vzdálené entity je na host: "{Param1}" neplatný nebo chybí.

# ERR_dbmg_1800
source: The "{Param1}" datastore class cannot be found
cs: Třída úložiště dat "{Param1}" nemůže být nalezena

# ERR_dbmg_1801
source: The "{Param1}" format is not supported
cs: Formát "{Param1}" není podporován

# ERR_dbmg_1802
source: The "{Param1}" entity set cannot be found
cs: Sadu entit "{Param1}" nelze nalázt

# ERR_dbmg_1803
source: The "{Param1}" entity set does not belong to the "{Param2}" datastore class
cs: Sada entit "{Param1}" nepatří do třídy úložiště dat "{Param2}"

# ERR_dbmg_1804
source: Cannot completely build a list of attributes with "{Param1}" for the "{Param2}" datastore class
cs: Nelze kompletně sestavit seznam vlastnosti s "{Param1}" pro třídu úložiště dat "{Param2}"

# ERR_dbmg_1805
source: Cannot completely build a list of expanded attributes with "{Param1}" for the "{Param2}" datastore class
cs: Nelze kompletně sestavit seznam rozšířených vlastnosti s "{Param1}" pro třídu úložiště dat "{Param2}"

# ERR_dbmg_1806
source: URL is not well formed
cs: URL nemá správný formát

# ERR_dbmg_1807
source: Received a '&' and was expecting a '?' in the URL
cs: Bylo obdrženo '&' ale očekáváno '?' v URL

# ERR_dbmg_1808
source: Opening single quote does not have a matching closing one in the URL
cs: Otevírající jednoduché uvozovky v URL nemají odpovídající uzavření

# ERR_dbmg_1809
source: Opening double quote does not have a matching closing one in the URL
cs: Otevírající dvojité uvozovky v URL nemají odpovídající uzavření

# ERR_dbmg_1810
source: Cannot order by "{Param1}" for the "{Param2}" datastore class
cs: Nelze třídit "{Param1}" pro třídu úložiště dat "{Param2}"

# ERR_dbmg_1811
source: "{Param1}" is an unknown REST keyword
cs: "{Param1}" je neznámé klíčové slovo REST

# ERR_dbmg_1812
source: "{Param1}" is an unknown REST method
cs: "{Param1}" je neznámá metoda REST

# ERR_dbmg_1813
source: "{Param1}" REST method is not applicable here
cs: "{Param1}" REST metoda zde není použitelná

# ERR_dbmg_1815
source: "$subentityset" cannot be applied to the REST request
cs: "$subentityset" nemůže být aplikován na REST request

# ERR_dbmg_1816
source: At least one attribute must be specified
cs: Musí být specifikována, alespoň jedna vlastnost

# ERR_dbmg_1817
source: "{Param1}" is not a valid compute action
cs: "{Param1}" není platná výpočetní akce

# ERR_dbmg_1818
source: "{Param1}" is not a valid logical operator
cs: "{Param1}" není platný logický operátor

# ERR_dbmg_1820
source: "{Param1}" is not a valid collection reference
cs: "{Param1}" není platná reference kolekce

# ERR_dbmg_1821
source: "{Param1}" is not a valid transaction command
cs: "{Param1}" není platný příkaz transakce

# ERR_dbmg_1822
source: REST login failed
cs: REST login selhal

# ERR_dbmg_1823
source: Maximum number of sessions has been reached
cs: Maximání počet sessions byl dosažen

# ERR_dbmg_3000
source: The replication database is not valid
cs: Replikovaná databáze není platná

# ERR_dbmg_3001
source: The replication database is missing a table and is not valid
cs: Replikovaná databáze chybí tabulka a není platná

source: Fully wrong
cs: Zcela špatně

source: Partially wrong
cs: Částečně špatně

source: Invalid checksum
cs: Neplatný kontr.součet checksum

source: Invalid header
cs: Neplatná hlavička

source: Invalid header version
cs: Nepaltná verze hlavičky

source: Data segment directory header is invalid
cs: Neplatná hlavička složky segmentu dat

source: Data segment end of file is invalid
cs: Neplatný konec souboru segmentu dat

source: Address of primary directory of bit table is invalid
cs: Neplatná adresa primární složky bitové tabulky

source: Primary directory of bit table is invalid
cs: Neplatný primární adresář bitové tabulky

source: Address of secondary directory of bit table is invalid
cs: Neplatná adresa sekundárního adresáře bitové tabulky

source: Secondary directory of bit table is invalid
cs: Neplatný sekundární adresář bitové tabulky

source: Address of bit table is invalid
cs: Neplatná adresa bitové tabulky

source: Bit table is invalid
cs: Neplatná bitová tabulka

source: Cannot open data segment
cs: Nelze otevřít segment dat

source: Directory of data tables is invalid
cs: Neplatný adresář tabulek dat

source: Number of records is invalid
cs: Neplatný počet záznamů

source: Address of primary directory of record addresses is invalid
cs: Neplatná adresa primárního adresáře adres záznamů

source: List of deleted records is invalid
cs: Neplatný seznam vymazaných záznamů

source: Number of BLOBs is invalid
cs: Neplatný počet BLOBů

source: Address of primary directory of BLOBs addresses is invalid
cs: Neplatná adresa primárního adresáře BLOB addres

source: List of deleted BLOBs is invalid
cs: Neplatný seznam vymazaných BLOBů

source: Address of record address directory is invalid
cs: Neplatná adresa adresáře adres záznamů

source: Address of BLOB address directory is invalid
cs: Neplatná adresa adresáře adres BLOBů

source: Tag header of record address directory is invalid
cs: Neplatná hlavička tagu adresáře adres záznamů

source: Tag header of BLOB address directory is invalid
cs: Neplatná hlavička tagu adresáře adres BLOBů

source: Cannot read data for record address directory
cs: Nelze číst data pro adresář adres záznamů

source: Cannot read data for BLOB address directory
cs: Nelze číst data pro adresář adres BLOBů

source: Checksum of record address directory is invalid
cs: Neplatný kontrolní součet adresáře adres záznamů

source: Checksum of BLOB address directory is invalid
cs: Neplatný kontrolní součet adresáře adres BLOBů

source: Length of address directory is invalid
cs: Neplatná délka adresáře adres

source: BLOB address is invalid
cs: Neplatná adresa BLOB

source: Cannot read BLOB data
cs: Nelze číst BLOB data

source: BLOB checksum is invalid
cs: Neplatný konntrolní součet BLOB

source: BLOB tag header is invalid
cs: Neplatná hlavička BLOB tag

source: BLOB length is invalid
cs: Neplatná délka BLOB

source: BLOB length does not match the one in the address directory
cs: Délka BLOB neodpovídá té v adresáři adres

source: Record address is invalid
cs: Neplatná adresa záznamu

source: Cannot read record data
cs: Nelze číst data záznamu

source: Record checksum is invalid
cs: Neplatný kontrolní součet záznamu

source: Record length does not match the one in the address directory
cs: Délka záznamu neodpovídá té v adresáři adres

source: Record length is invalid
cs: Neplatná délka záznamu

source: Record tag header is invalid
cs: Neplatná hlavička tagu záznamu

source: Number of fields invalid
cs: Neplatný počet polí

source: Invalid data field type
cs: Neplatný typ datového pole

source: Invalid data field offset in record
cs: Neplatný offset datového pole v záznamu

source: Invalid data field length
cs: Neplatná délka datového pole

source: BLOB reference is invalid in this data field
cs: V tomto datovém poli je neplatný odkaz na BLOB

source: BLOB is deleted in this data field
cs: V tomto datovém poli je BLOB vymazán

source: BLOB is invalid in this data field
cs: V tomto datovém poli je BLOB neplatný

source: BLOB reference of this data field is already used in another record
cs: Odkaz na BLOB v tomto datovém poli je již použit v jiném záznamu

source: The chained list of deleted BLOBs is circular
cs: Řetězený seznam vymazaných BLOBů je do kruhu

source: The chained list of deleted BLOBs is invalid
cs: Řetězený seznam vymazaných BLOBů je neplatný

source: The chained list of deleted records is circular
cs: Řetězený seznam vymazaných záznamů je do kruhu

source: The chained list of deleted records is invalid
cs: Řetězený seznam vymazaných záznamů je neplatný

source: Some BLOBs are orphans in this data table
cs: Některé BLOBy v tomto datovém souboru jsou osiřelé

source: Address of primary address directory is invalid
cs: Adresa adresáře primárních adres je neplatná

source: The number of entries is invalid
cs: Počet vstupů je neplatný

source: The chained list of deleted entries is invalid
cs: Řetězený seznam vymazaných vstupů je neplatný

source: Address is invalid
cs: Addresa je neplatná

source: Address of address directory is invalid
cs: Adresa adresáře adres je neplatná

source: Tag header of address directory is invalid
cs: Hlavička tagu adresáře adres není platná

source: Cannot read data for address directory
cs: Nelze číst data pro adresář adres

source: Checksum of address directory is invalid
cs: Neplatný kontrolní součet adresáře adres

source: Length is invalid
cs: Neplatná délka

source: Address is invalid
cs: Neplatná adresa

source: Checksum is invalid
cs: Neplatný kontrolní součet

source: Cannot read data
cs: Nelze číst data

source: Tag header is invalid
cs: Hlavička tagu je neplatná

source: Length of table name is invalid
cs: Neplatná délka názvu tabulky

source: Length of record class name is invalid
cs: Neplatný název třídy záznamu

source: Length of field name is invalid
cs: Neplatný název pole

source: Type of Table is invalid
cs: Neplatný typ tabulky

source: The number of fields is invalid
cs: Neplatný počet polí

source: The number of Fields does not match the size of the table definition
cs: Počet polí neodpovídá velikosti definice tabulky

source: The UUIDs are the same
cs: UUIDy jsou tytéž (Universal Unique Identifiers)

source: Field type is invalid
cs: Typy polí nejsou platné

source: Length stored in tag header does not match
cs: Délka uložená v hlavičce tagu neodpovídá

source: Extra properties stream seems to be damaged
cs: Tok extra vlastností vypadá poškozen

source: Auto sequence number type is invalid
cs: Typ auto sekvenčního čísla je neplatný

source: Auto sequence number ID is invalid
cs: ID auto sekvenčního čísla je neplatný

source: Type of relation is invalid
cs: Typ vztahu je neplatný

source: The number of relations is invalid
cs: Neplatný počet vztahů

source: The relation type does not match
cs: Typ vztahu neodpovídá

source: The relation source field ID cannot be found
cs: ID zdrojového pole vztahu nemůže být nalezeno

source: The relation destination field ID cannot be found
cs: ID cílového pole vztahu nemůže být nalezeno

source: The table of relations is damaged
cs: Tabulka vztahů je poškozena

source: The number of fields for the source is not equal to the number of fields for the destination
cs: Počet polí pro zdroj není totožný s počtem polí pro cíl

source: The index definition is damaged
cs: Definice indexu je poškozena

source: Index type is invalid
cs: Neplatný typ indexu

source: Field reference is invalid
cs: Odkaz pole je neplatný

source: Table reference is invalid
cs: Odkaz tabulky je neplatný

source: Index header type is invalid
cs: Neplatný typ hlavičky indexu

source: Address of primary directory of index pages is invalid
cs: Neplatná adresa primárního adresáře indexových stránek

source: The number of index pages is invalid
cs: Počet indexových stránek je neplatný

source: The chained list of deleted index pages is invalid
cs: Řetězený seznam vymazaných indexových stránek je neplatný

source: Primary page number is invalid
cs: Primární číslo stránky je neplatné

source: Address of primary directory of index clusters is invalid
cs: Addresa primárního adresáře klastrů indexů je neplatná

source: The number of index clusters is invalid
cs: Počet klastrů indexů je neplatný

source: The chained list of deleted index clusters is invalid
cs: Řetězený seznam vymazaných klastrů indexů je neplatný

source: Extra property length is invalid
cs: Dlélka extra vlastností je neplatná

source: Extra property address is invalid
cs: Adresa extra vlastností je neplatná

source: Extra property checksum is invalid
cs: Neplatný kontrolní součet extra vlastností

source: Cannot read extra property data
cs: Nelze číst data extra vlastností

source: Extra property tag header is invalid
cs: Neplatná hlavička tagu extra vlastností

source: Extra property length stored in tag header does not match
cs: Délka extra vlastnosti uložená v hlavičce tagu neodpovídá

source: Address of page address directory is invalid
cs: Adresa adresáře adres stránek je neplatná

source: Address of cluster address directory is invalid
cs: Addresa adresáře adres klastrů je neplatná

source: Tag header of page address directory is invalid
cs: Hlavička tagu adresáře adres stránek je neplatná

source: Tag header of cluster address directory is invalid
cs: Hlavička tagu adresáře adres klastrů je neplatná

source: Cannot read data for page address directory
cs: Nelze číst data pro adresář adres stránek

source: Cannot read data for cluster address directory
cs: Nelze číst data pro adresář adres klastrů

source: Checksum of page address directory is invalid
cs: Kontrolní součet adresáře adres stránek je neplatný

source: Checksum of cluster address directory is invalid
cs: Kontrolní součet adresáře adres klastrů je neplatn

source: Cluster type is invalid
cs: Typ klastru je neplatný

source: The number of records in cluster is invalid
cs: Počet záznamů v klastru je neplatný

source: Cluster contains invalid record references
cs: Klastr obsahuje neplatný odkaz na zázanam

source: Cluster contains deleted record references
cs: Klastr obsahuje odkaz na vymazaný zázanam

source: Cluster bits count is invalid
cs: Neplatný počet bitů klastru

source: The number of index keys is invalid
cs: Neplatný počet indexových klíčů

source: Cluster contains duplicated record references
cs: Klastr obsahuje odkazy na zdvojené záznamy

source: Subpage reference is invalid
cs: Odkaz na podstránku je neplatný

source: Subpage reference is deleted
cs: Odkaz na podstránku je vymazán

source: The keys directory is invalid
cs: Adresář klíčů je neplatný

source: Key references an invalid record number
cs: Klíč odkazuje na číslo neplatného záznamu

source: Key references a deleted record number
cs: Klíč odkazuje na číslo vymazaného záznamu

source: Key references a duplicated record number
cs: Klíč odkazuje na číslo zdvojeného záznamu

source: The keys are not in the right order
cs: Klíče nejsou ve správném pořadí

source: Invalid key
cs: Neplatný klíč

source: Some record references are missing
cs: Některé odkazy na záznamy chybí

source: This index page is used in a circular reference
cs: Tato stránka indexů je užita v kruhovém odrazu

source: Checksum of data table header is invalid
cs: Neplatný kontrolní součet hlavičky tabulky dat

source: Length of data table header is invalid
cs: Neplatná délka hlavičky tabulky dat

source: Tag header of data table header is invalid
cs: Neplatná hlavička tagu hlavičky tabulky dat

source: Cannot read data of data table header
cs: Nelze číst data hlavičky tabulky dat

source: Address of data table header is invalid
cs: Neplatná adresa hlavičky tabulky dat

source: Wrong data type number in index
cs: Špatný počet typů dat v indexu

source: The structure and data file do not match
cs: SOubor struktury a dat si neodpovídají

source: Missing Index file .4DIndx or .4DIndy
cs: Chybí soubor indexů .4DIndx nebo .4DIndy

source: Last database flush did not complete.
cs: Poslední uvolnění dat do databáze nebylo dokončeno..

source: Address overlaps
cs: Přetečení adresy

source: Index is flagged to be rebuilt
cs: Index je označen k přestavění

source: External BLOB file is missing
cs: Externí BLOB soubor chybí

source: Problem on the database
cs: Problém v databázi

source: Problem on the data segment # {SegNum}
cs: Problém v segmentu dat# {SegNum}

source: Problem on the secondary directory # {BittableTable} of bit tables in the data segment # {SegNum}
cs: Problém v sekundárním adresáři # {BittableTable} bitových tabulek v segmentu dat # {SegNum}

source: Problem on the bit table # {Bittable} in the secondary directory # {BittableTable} of bit tables in the data segment # {SegNum}
cs: Problém v bitových tabulkách # {Bittable} v sekundárním adresáři # {BittableTable} bitových tabulek v segmentu dat # {SegNum}

source: Problem on the {TableName} data table
cs: Problém v datové tabulce {TableName}

source: Problem on record address directory # {RecordAddressTableNum} in the {TableName} data table
cs: Problém v adresáři adres záznamů # {RecordAddressTableNum} v tabulce dat {TableName}

source: Problem on BLOB address directory # {BlobAddressTableNum} in the {TableName} data table
cs: Problém v adresáři adres BLOB # {BlobAddressTableNum} v tabulce dat {TableName}

source: Problem on BLOB # {BlobNum} in the {TableName} data table
cs: Problém v BLOB # {BlobNum} v tabulce dat {TableName}

source: Problem on record # {RecordNum} in the {TableName} data table
cs: Problém v záznamu # {RecordNum v tabulce dat {TableName}

source: Problem on field {FieldName} in record # {RecordNum} in the {TableName} data table
cs: Problém v poli {FieldName} v záznamu # {RecordNum} v tabulce dat {TableName}

source: Problem on directory of table definitions
cs: Problém v adresáři dafinic tabulek

source: Problem on {TableName} table definition
cs: Problém v definici tabulky {TableName}

source: Problem on directory of relation definitions
cs: Problém v adresáři definic vztahů

source: Problem on relation definition # {RelationNum}
cs: Problém v definici vztahu # {RelationNum}

source: Problem on directory of sequence numbers
cs: Problém v adresáři sekvenčních čísel

source: Problem on sequence number # {SeqNum}
cs: Problém v sekvenčním čísle # {SeqNum}

source: Problem on directory of index definitions
cs: Problém v adresáři definic indexů

source: Problem on index definition {IndexName}
cs: Problém v definici indexu {IndexName}

source: Problem on directory of backup index definitions
cs: Problém v adresáři definicích záložního indexu

source: Problem on backup index definition {IndexName}
cs: Problém v definici záložního indexu {IndexName}

source: UUID Conflict between {ObjType1}:{ObjName1} and {ObjType2}:{ObjName2}
cs: UUID konflikt mezi {ObjType1}:{ObjName1} a{ObjType2}:{ObjName2}

source: Problem on field definition {FieldName} in {TableName} table
cs: Problém v definici pole {FieldName} v tabulce {TableName}

source: Problem on page address directory # {IndexPageAddressTable} in {IndexName} index
cs: Problém v adresáři adres indexových stránek # {IndexPageAddressTable} v indexu {IndexName}

source: Problem on page # {IndexPageNum} in {IndexName} index
cs: Problém na stránce # {IndexPageNum} v indexu {IndexName}

source: Problem on {IndexName} index
cs: Problém v indexu {IndexName}

source: Problem on cluster # {IndexClusterNum} in {IndexName} index
cs: Problém v klastru # {IndexClusterNum} v indexu {IndexName}

source: Problem on cluster address directory # {IndexClusterAddressTable} in {IndexName} index
cs: Problém v adresáři adres klastrů # {IndexClusterAddressTable} v indexu {IndexName}

source: Problem on bit page # {BitPageNum} in cluster # {IndexClusterNum} in {IndexName} index
cs: Problém na bitové stránce # {BitPageNum} klastru # {IndexClusterNum} v indexu {IndexName}

source: Problem on directory of data table headers
cs: Problém v adresáři hlaviček tabulek dat
