Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DES.xlf
Languages: es

# ERR_dbmg_1001
source: No column to import in table {TableName}
es: Ninguna columna a importar en tabla {TableName}

# ERR_dbmg_1002
source: Wrong table to import
es: La tabla a importar es incorrecta

# ERR_dbmg_1003
source: No column to export in table {TableName}
es: Ninguna columna a exportar en tabla {TableName}

# ERR_dbmg_1004
source: Wrong table to export
es: La tabla a exportar es incorrecta

# ERR_dbmg_1006
source: Cannot save structure of database {BaseName}
es: No es posible guardar la estructura de la base {BaseName}

# ERR_dbmg_1007
source: Cannot create data file of database: {BaseName}
es: No es posible crear el archivo de datos de la base: {BaseName}

# ERR_dbmg_1008
source: Wrong data segment in database {BaseName}
es: Segmento de datos incorrecto en la base {BaseName}

# ERR_dbmg_1009
source: Memory is full
es: La memoria está llena

# ERR_dbmg_1010
source: Cannot load a table definition of database {BaseName}
es: No es posible cargar una definición de tabla de la base {BaseName}

# ERR_dbmg_1011
source: Cannot open data file of database {BaseName}
es: No es posible abrir el archivo de datos de la base {BaseName}

# ERR_dbmg_1012
source: Data segment is full in database: {BaseName}
es: El segmento de datos está lleno en la base: {BaseName}

# ERR_dbmg_1013
source: Cannot save data segment in database {BaseName}
es: No es posible guardar segmentos de datos en la base {BaseName}

# ERR_dbmg_1014
source: Cannot read data segment of database {BaseName}
es: No es posible leer el segmento de datos de la base {BaseName}

# ERR_dbmg_1015
source: Wrong database header in database {BaseName}
es: El encabezado de la base es incorrecto en la base {BaseName}

# ERR_dbmg_1016
source: Cannot create table in database {BaseName}
es: No es posible crear la tabla en la base {BaseName}

# ERR_dbmg_1017
source: Cannot read index list of database {BaseName}
es: No es posible leer la lista de ìndices de la base {BaseName}

# ERR_dbmg_1018
source: Cannot write index list of database {BaseName}
es: No es posible escribir la lista de índices de la base {BaseName}

# ERR_dbmg_1019
source: Wrong table reference in database {BaseName}
es: Referencia de tabla equivocada en la base {BaseName}

# ERR_dbmg_1020
source: Wrong field reference in database {BaseName}
es: Referencia de campo equivocada en la base {BaseName}

# ERR_dbmg_1021
source: Invalid index type in database {BaseName}
es: Tipo de índice inválido en la base {BaseName}

# ERR_dbmg_1022
source: Invalid field name in table {TableName} of database {BaseName}
es: Nombre de campo inválido en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1023
source: Invalid database name
es: Nombre de base incorrecto

# ERR_dbmg_1024
source: Cannot open structure of database {BaseName}
es: No es posible abrir la estructura de la base {BaseName}

# ERR_dbmg_1025
source: Cannot create structure of database {BaseName}
es: No es posible crear la estructura de la base {BaseName}

# ERR_dbmg_1026
source: Cannot load bit selection of database {BaseName}
es: No es posible cargar la selección de bit de la base {BaseName}

# ERR_dbmg_1027
source: Cannot load set of database {BaseName}
es: No es posible cargar conjunto de la base {BaseName}

# ERR_dbmg_1028
source: Cannot modify set of database {BaseName}
es: No es posible modificar conjunto de la base {BaseName}

# ERR_dbmg_1029
source: Cannot save set of database {BaseName}
es: No es posible guardar conjunto de la base {BaseName}

# ERR_dbmg_1030
source: Cannot save BLOB {BlobNum} in table {TableName} of database {BaseName}
es: No es posible guardar BLOB {BlobNum} en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1031
source: Cannot load BLOB {BlobNum} in table {TableName} of database {BaseName}
es: No es posible cargar BLOB {BlobNum} en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1032
source: Cannot allocate BLOB {BlobNum} in table {TableName} of database {BaseName}
es: No es posible ubicar BLOB {BlobNum} en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1033
source: Cannot load data bit table of database {BaseName}
es: No es posible cargar tabla de bits de datos de la base {BaseName}

# ERR_dbmg_1034
source: Cannot save data bit table of database {BaseName}
es: No es posible guardar la tabla de bits de la base {BaseName}

# ERR_dbmg_1035
source: Cannot load table of data bit tables of database {BaseName}
es: No es posible cargar la tabla de de bits de datos de la base {BaseName}

# ERR_dbmg_1036
source: Cannot save table of data bit tables in database {BaseName}
es: No es posible guardar la tabla de bits de datos en la base {BaseName}

# ERR_dbmg_1037
source: Cannot close data segment of database {BaseName}
es: No es posible cerrar el segmento de datos de la base {BaseName}

# ERR_dbmg_1038
source: Cannot delete data segment of database {BaseName}
es: No es posible borrar el segmento de datos de la base {BaseName}

# ERR_dbmg_1039
source: Cannot open data segment of database {BaseName}
es: No es posible abrir el segmento de datos de la base {BaseName}

# ERR_dbmg_1040
source: Cannot create data segment of database {BaseName}
es: No es posible crear segmento de la base de datos {BaseName}

# ERR_dbmg_1041
source: Cannot allocate space in data segment
es: No es posible asignar espacio en segmento de datos

# ERR_dbmg_1042
source: Cannot free space in data segment of database {BaseName}
es: No es posible liberar espacio en el segmento de datos de la base de datos {BaseName}

# ERR_dbmg_1043
source: File is write protected
es: El archivo está protegido contra escritura

# ERR_dbmg_1044
source: Cannot access field in record {RecNum} in table {TableName} of database {BaseName}
es: No es posible acceder al campo en el registro {RecNum} en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1045
source: Field definition code is missing in record {RecNum} in table {TableName} of database {BaseName}
es: Falta el código de definición del campo en el registro {RecNum} en la tabla {TableName} de la base de datos {BaseName}

# ERR_dbmg_1046
source: Cannot save record {RecNum} in table {TableName} of database {BaseName}
es: No es posible guardar el registro {RecNum} en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1047
source: Cannot load record {RecNum} in table {TableName} of database {BaseName}
es: No es posible cargar el registro {RecNum} en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1048
source: Cannot allocate record in table {TableName} of database {BaseName}
es: No es posible ubicar el registro en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1049
source: Cannot update record {RecNum} in table {TableName} of database {BaseName}
es: No es posible actualizar el registro {RecNum} en la tabla {TableName} de la base de datos {BaseName}

# ERR_dbmg_1050
source: Wrong header for record {RecNum} in table {TableName} of database {BaseName}
es: Encabezado incorrecto para el registro {RecNum} en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1051
source: Cannot save definition of table {TableName} of database {BaseName}
es: No es posible guardar la definición de la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1052
source: Cannot update definition of table {TableName} of database {BaseName}
es: No es posible actualizar la definición de la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1053
source: Field name already exists
es: El nombre del campo ya existe

# ERR_dbmg_1055
source: Cannot update index values while saving a record in table {TableName} of database {BaseName}
es: No es posible actualizar los valores del índice mientras guarda un registro en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1056
source: Cannot update BLOBs while saving a record in table {TableName} of database {BaseName}
es: No es posible actualizar BLOBs mientras guarda un registro en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1057
source: Cannot delete BLOBs while saving or deleting a record in table {TableName} of database {BaseName}
es: No es posible borrar BLOBs mientras guarda o borra un registro en una tabla {TableName} de la base {BaseName}

# ERR_dbmg_1058
source: Cannot add field in table {TableName} of database {BaseName}
es: No es posible añadir un campo en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1059
source: Cannot allocate table in memory
es: No es posible colocar la tabla en memoria

# ERR_dbmg_1061
source: Cannot allocate record in memory
es: No es posible colocar el registro en memoria

# ERR_dbmg_1062
source: Cannot completely delete table {TableName} of database {BaseName}
es: No es posible borrar completamente la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1063
source: Cannot lock record {RecNum} in table {TableName} of database {BaseName}
es: No es posible bloquear el registro {RecNum} en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1064
source: Cannot unlock record {RecNum} in table {TableName} of database {BaseName}
es: No es posible desbloquear el registro {RecNum} en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1065
source: Cannot delete record {RecNum} in table {TableName} of database {BaseName}
es: No es posible borrar el registro {RecNum} en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1066
source: Record {RecNum} is locked in table {TableName} of database {BaseName}
es: El registro {RecNum} está bloqueado en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1067
source: Sequential search could not be completed in table {TableName} of database {BaseName}
es: No se pudo completar la búsqueda secuencial en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1068
source: Cannot save header for table {TableName} of database {BaseName}
es: No es posible guardar el encabezado de la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1069
source: Cannot import data in table {TableName} of database {BaseName}
es: No es posible importar datos en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1070
source: Cannot load index header of database {BaseName}
es: No es posible cargar el encabezado del índice de la base {BaseName}

# ERR_dbmg_1071
source: Cannot save header for index {IndexName} of database {BaseName}
es: No es posible guardar el encabezado del índice {IndexName} de la base {BaseName}

# ERR_dbmg_1072
source: Cannot get page address for index {IndexName} of database {BaseName}
es: No es posible obtener la dirección de la página para el índice {IndexName} de la base {BaseName}

# ERR_dbmg_1073
source: Cannot set page address for index {IndexName} of database {BaseName}
es: No es posible obtener la dirección de la página del índice {IndexName} de la base {BaseName}

# ERR_dbmg_1074
source: Cannot drop index {IndexName} of database {BaseName}
es: No es posible eliminar el índice {IndexName} de la base {BaseName}

# ERR_dbmg_1075
source: Cannot sort index {IndexName} of database {BaseName}
es: No es posible ordenar el índice {IndexName} de la base {BaseName}

# ERR_dbmg_1076
source: Cannot load page for index {IndexName} of database {BaseName}
es: No es posible cargar la página del índice {IndexName} de la base {BaseName}

# ERR_dbmg_1077
source: Cannot save page for index {IndexName} of database {BaseName}
es: No es posible guardar la página del índice {IndexName} de la base {BaseName}

# ERR_dbmg_1078
source: Cannot insert key into index {IndexName} of database {BaseName}
es: No es posible insertar la llave en el índice {IndexName} de la base {BaseName}

# ERR_dbmg_1079
source: Cannot delete key from index {IndexName} of database {BaseName}
es: No es posible borrar la llave del índice {IndexName} de la base {BaseName}

# ERR_dbmg_1080
source: Cannot completely delete index {IndexName} of database {BaseName}
es: No es posible eliminar completamente el índice {IndexName} de la base {BaseName}

# ERR_dbmg_1081
source: Cannot complete scan on index {IndexName} of database {BaseName}
es: No es posible completar el escaneo del índice {IndexName} de la base {BaseName}

# ERR_dbmg_1082
source: Cannot complete sort of index {IndexName} of database {BaseName}
es: No es posible completar la ordenación del índice {IndexName} de la base {BaseName}

# ERR_dbmg_1083
source: Cannot insert key into page of index {IndexName} of database {BaseName}
es: No es posible insertar la llave en la página del índice {IndexName} de la base {BaseName}

# ERR_dbmg_1084
source: Cannot delete key from page of index {IndexName} of database {BaseName}
es: No es posible borrar la llave de la página del índice {IndexName} de la base {BaseName}

# ERR_dbmg_1085
source: Cannot load index cluster of database {BaseName}
es: No es posible cargar el índice agrupado de la base {BaseName}

# ERR_dbmg_1086
source: Cannot add to index cluster of database {BaseName}
es: No es posible añadir el índice agrupado de la base {BaseName}

# ERR_dbmg_1087
source: Cannot delete from index cluster of database {BaseName}
es: No es posible borrar desde el índice agrupado de la base {BaseName}

# ERR_dbmg_1088
source: Index {IndexName} is invalid
es: El índice {IndexName} es inválido

# ERR_dbmg_1089
source: SQL syntax error (Obsolete)
es: Error de sintaxis SQL (Obsoleto)

# ERR_dbmg_1090
source: SQL token not found (Obsolete)
es: Palabra clave SQL no encontrada (Obsoleto)

# ERR_dbmg_1091
source: Not implemented
es: No implementado

# ERR_dbmg_1092
source: Cannot register code
es: No es posible registrar el código

# ERR_dbmg_1093
source: Operation in progress cancelled by user
es: La operación en progreso fue cancelada por el usuario

# ERR_dbmg_1094
source: Transaction conflict
es: Conflicto de transacción

# ERR_dbmg_1095
source: Invalid table name in database {BaseName}
es: Nombre de tabla incorrecto en la base {BaseName}

# ERR_dbmg_1096
source: Table {TableName} is locked in database {BaseName}
es: La tabla {TableName} está bloqueada en la base {BaseName}

# ERR_dbmg_1097
source: Database {BaseName} is locked
es: La base de datos {BaseName} está bloqueada

# ERR_dbmg_1098
source: Data address is invalid in database {BaseName}
es: La dirección de datos es incorrecta en la base {BaseName}

# ERR_dbmg_1099
source: Record is empty
es: El registro está vacío

# ERR_dbmg_1100
source: Wrong source field
es: El campo fuente es incorrecto

# ERR_dbmg_1101
source: Wrong destination field
es: El campo de destino es incorrecto

# ERR_dbmg_1102
source: Invalid relation name
es: El nombre de la relación es incorrecto

# ERR_dbmg_1103
source: Field types do not match
es: Los tipos de campos no coinciden

# ERR_dbmg_1104
source: Relation is empty
es: La relación está vacía

# ERR_dbmg_1105
source: Cannot load relations list from database {BaseName}
es: No es posible cargar la lista de relaciones de la base {BaseName}

# ERR_dbmg_1106
source: Cannot save relations list into database {BaseName}
es: No es posible guardar la lista de relaciones en la base {BaseName}

# ERR_dbmg_1107
source: Query and lock not completed; at least one record locked somewhere else
es: La búsqueda y el bloqueo no se han completado; al menos un registro bloqueado en otra parte

# ERR_dbmg_1108
source: Invalid record
es: Registro incorrecto

# ERR_dbmg_1109
source: Wrong record ID
es: El ID del registro es incorrecto

# ERR_dbmg_1110
source: Relation already exists in database {BaseName}
es: La relación ya existe en la base {BaseName}

# ERR_dbmg_1111
source: Index already exists in database {BaseName}
es: El índice ya existe en la base {BaseName}

# ERR_dbmg_1112
source: Wrong comparison operator
es: Operador de comparación incorrecto

# ERR_dbmg_1113
source: End of data buffer
es: Fin de buffer de datos

# ERR_dbmg_1114
source: Wrong DB4D version number
es: Número de versión de DB4D incorrecto

# ERR_dbmg_1115
source: Duplicated key
es: Llave duplicada

# ERR_dbmg_1116
source: Mandatory field is Null in record {RecNum} in table {TableName}
es: El campo obligatorio es nulo en el registro {RecNum} en la tabla {TableName}

# ERR_dbmg_1117
source: Cannot set field to mandatory for table {TableName}
es: No es posible establecer el campo obligatorio para la tabla {TableName}

# ERR_dbmg_1118
source: Cannot get exclusive access to table {TableName}
es: No es posible obtener acceso exclusivo a tabla {TableName}

# ERR_dbmg_1119
source: Cannot check referential integrity of table {TableName}
es: No es posible verificar la integridad referenciall de tabla {TableName}

# ERR_dbmg_1120
source: Reference integrity: some foreign keys still exist matching primary key on record {RecNum} in table {TableName}
es: Integridad de referencia: algunas llaves foráneas aùn existen haciendo juego con las llaves primarias en el registro {RecNum} en la tabla {TableName}

# ERR_dbmg_1121
source: Cannot delete all records in selection of table {TableName}
es: No es posible borrar todos los registros en la selección de tabla {TableName}

# ERR_dbmg_1122
source: BLOB is Null
es: BLOB es Nulo

# ERR_dbmg_1123
source: Invalid database context
es: El contexto de la base es incorrecto

# ERR_dbmg_1124
source: Invalid relation reference
es: La referencia de la relación es incorrecta

# ERR_dbmg_1125
source: Invalid record name in table {TableName}
es: El nombre de registro incorrecto en la tabla {TableName}

# ERR_dbmg_1126
source: Wrong field type
es: Tipo de campo incorrecto

# ERR_dbmg_1127
source: Cannot load extra properties
es: No es posible cargar propiedades adicionales

# ERR_dbmg_1128
source: Cannot save extra properties
es: No es posible guardar propiedades adicionales

# ERR_dbmg_1129
source: Subrecord ID is out of range
es: El número del subregistro está por fuera del rango

# ERR_dbmg_1130
source: Duplicate name for index {IndexName} in database {BaseName}
es: Nombre duplicado para el índice {IndexName} en la base {BaseName}

# ERR_dbmg_1131
source: Invalid name for index {IndexName} in database {BaseName}
es: Nombre incorrecto para el índice {IndexName} en la base {BaseName}

# ERR_dbmg_1132
source: Wrong key value on index {IndexName}
es: Valor de llave incorrecto para el índice {IndexName}

# ERR_dbmg_1133
source: Wrong type for index {IndexName}
es: Tipo incorrecto para el índice {IndexName}

# ERR_dbmg_1134
source: Invalid accessor
es: Accesor incorrecto

# ERR_dbmg_1135
source: Accessor is read only
es: El Accesor es de solo lectura

# ERR_dbmg_1136
source: Null value not accepted
es: Valor Null no aceptado

# ERR_dbmg_1137
source: THIS is Null
es: ESTE es Null

# ERR_dbmg_1138
source: Selection is Null
es: La selección es Null

# ERR_dbmg_1139
source: Database {BaseName} is write protected
es: La base {BaseName} está protegida contra escritura

# ERR_dbmg_1140
source: Database {BaseName} is closing
es: La base {BaseName} se está cerrando

# ERR_dbmg_1141
source: Invalid transaction
es: Transacción incorrecta

# ERR_dbmg_1142
source: Array limit is exceeded
es: Se pasó el límite del array

# ERR_dbmg_1143
source: Creator of array values is missing
es: Falta el creador de valores de array

# ERR_dbmg_1144
source: Cannot build selection of table {TableName}
es: No es posible construir la selección de la tabla {TableName}

# ERR_dbmg_1145
source: Busy object
es: Objeto no disponible

# ERR_dbmg_1146
source: Data file does not match structure file
es: El archivo de datos no coincide con el archivo de estructura

# ERR_dbmg_1147
source: Cannot start listener
es: No es posible iniciar receptor

# ERR_dbmg_1148
source: Cannot start server
es: No es posible iniciar el servidor

# ERR_dbmg_1149
source: No listener
es: Sin receptor

# ERR_dbmg_1150
source: Task is dying
es: El proceso está a punto de terminar

# ERR_dbmg_1151
source: Invalid request tag
es: Etiqueta de solicitud incorrecta

# ERR_dbmg_1152
source: Invalid context ID
es: Número de contexto incorrecto

# ERR_dbmg_1153
source: Not enough temporary space on disk
es: No hay suficiente espacio de disco temporal

# ERR_dbmg_1154
source: Data set is Null
es: El conjunto de datos es Null

# ERR_dbmg_1155
source: No primary key matching the foreign key
es: Ninguna llave primaria corresponde con la llave foránea

# ERR_dbmg_1156
source: Type of field {FieldName} of table {TableName} does not support being set to Unique
es: Tipo de campo {FieldName} de la tabla {TableName} no acepta el atributo único

# ERR_dbmg_1157
source: Type of field {FieldName} of table {TableName} does not support being set to NEVER NULL
es: El tipo de campo {FieldName} de la tabla {TableName} no acepta el atributo NUNCA NULO

# ERR_dbmg_1158
source: Cannot alter primary key definition of table {TableName}
es: No es posible alterar la definición de la llave primaria de la tabla {TableName}

# ERR_dbmg_1159
source: Maximum number of records has been reached for table {TableName}
es: Se ha alcanzado el número máximo de registros para la tabla {TableName}

# ERR_dbmg_1160
source: Maximum number of BLOBs has been reached for table {TableName}
es: Se ha alcanzado el número máximo de BLOBs para la tabla {TableName}

# ERR_dbmg_1161
source: Indice is out of range
es: El índice está fuera del rango

# ERR_dbmg_1162
source: Query is invalid
es: La búsqueda es incorrecta

# ERR_dbmg_1163
source: Record is NULL
es: El registro es NULL

# ERR_dbmg_1164
source: Object is NULL
es: El objeto es NULL

# ERR_dbmg_1165
source: Wrong owner for this object
es: Propietario incorrecto para este objeto

# ERR_dbmg_1166
source: Object was not locked
es: El objeto no fue bloqueado

# ERR_dbmg_1167
source: Object is locked by another context
es: El objeto está bloqueado por otro contexto

# ERR_dbmg_1168
source: Internal error on remote connection
es: Error interno en la conexión remota

# ERR_dbmg_1169
source: Invalid table number
es: Número de tabla incorrecto

# ERR_dbmg_1170
source: Invalid field number
es: Número de campo incorrecto

# ERR_dbmg_1171
source: Invalid Database ID
es: Número de base de datos incorrecto

# ERR_dbmg_1172
source: Invalid Parameter
es: Parámetro incorrecto

# ERR_dbmg_1173
source: Cache Flushing did not complete
es: La escritura de caché está incompleta

# ERR_dbmg_1174
source: Data Flushing did not complete
es: La escritura de datos está incompleta

# ERR_dbmg_1175
source: Structure Flushing did not complete
es: La escritura de la estructura está incompleta

# ERR_dbmg_1176
source: Log file is invalid for database {BaseName}
es: El archivo de historial es incorrecto para la base {BaseName}

# ERR_dbmg_1177
source: Log file cannot be found for database {BaseName}
es: No se pudo encontrar el archivo de historial para la base {BaseName}

# ERR_dbmg_1178
source: Last operation in log file does not match the one in database {BaseName}
es: La última operación del archivo de historial no corresponde a la operación en la base {BaseName}

# ERR_dbmg_1179
source: Log file does not match database {BaseName}
es: El archivo historial no corresponde a la base {BaseName}

# ERR_dbmg_1180
source: Data Table has been deleted
es: Los datos de la tabla han sido borrados

# ERR_dbmg_1181
source: Keys are not unique in index {IndexName}
es: Las llaves no son únicas en el índice {IndexName}

# ERR_dbmg_1182
source: Cannot create log file for database {BaseName}
es: No es posible crear el archivo de historial para la base {BaseName}

# ERR_dbmg_1183
source: Cannot write into log file of database {BaseName}
es: No es posible escribir en el archivo de historial de la base {BaseName}

# ERR_dbmg_1184
source: Cannot drop table {TableName} in database {BaseName}
es: No es posible eliminar la tabla {TableName} en la base {BaseName}

# ERR_dbmg_1185
source: Remote database cannot be opened
es: No se puede abrir la base de datos remota

# ERR_dbmg_1186
source: Log file cannot be integrated into database {BaseName}
es: El archivo historial no puede integrarse a la base {BaseName}

# ERR_dbmg_1187
source: Internal Computation on Set cannot be completed
es: No se pudo completar el cálculo interno en el conjunto
