Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DES.xlf
Languages: es

source: BLOB reference is invalid in this data field
es: La referencia del BLOB para este campo es incorrecta

source: BLOB is deleted in this data field
es: BLOB está borrado en este campo

source: BLOB is invalid in this data field
es: BLOB es incorrecto en este campo

source: BLOB reference of this data field is already used in another record
es: La referencia del BLOB para este campo ya ha sido utilizada en otro registro

source: The chained list of deleted BLOBs is circular
es: La lista encadenada de eliminación de BLOBs es circular

source: The chained list of deleted BLOBs is invalid
es: La lista encadenada de eliminación de BLOBs es incorrecta

source: The chained list of deleted records is circular
es: La lista encadenada de eliminación de registros es circular

source: The chained list of deleted records is invalid
es: La lista encadenada de eliminación de registros eliminados es incorrecta

source: Some BLOBs are orphans in this data table
es: Algunos BLOBs son huérfanos en esta tabla de datos

source: Address of primary address directory is invalid
es: La dirección del directorio de direcciones primarias es incorrecta

source: The number of entries is invalid
es: El número de entradas es incorrecto

source: The chained list of deleted entries is invalid
es: La lista encadenada de eliminación de entradas es incorrecta

source: Address is invalid
es: La dirección es incorrecta

source: Address of address directory is invalid
es: La dirección del directorio de direcciones es incorrecta

source: Tag header of address directory is invalid
es: El encabezado de la pestaña del directorio de direcciones es incorrecto

source: Cannot read data for address directory
es: No es posible leer los datos del directorio de direcciones

source: Checksum of address directory is invalid
es: La suma de verificación del directorio de direcciones es incorrecta

source: Length is invalid
es: Longitud incorrecta

source: Address is invalid
es: La dirección es incorrecta

source: Checksum is invalid
es: Suma de verificación incorrecta

source: Cannot read data
es: No es posible leer los datos

source: Tag header is invalid
es: El encabezado del marcador es incorrecto

source: Length of table name is invalid
es: La longitud del nombre de la tabla es incorrecta

source: Length of record class name is invalid
es: La longitud del nombre de la clase del registro es incorrecta

source: Length of field name is invalid
es: La longitud del nombre del campo es incorrecta

source: Type of Table is invalid
es: El tipo de la tabla es incorrecto

source: The number of fields is invalid
es: El número de campos es incorrecto

source: The number of Fields does not match the size of the table definition
es: El número de campos no corresponde con el tamaño de la definición de la tabla

source: The UUIDs are the same
es: Los UUIDs son idénticos

source: Field type is invalid
es: El tipo de campo es incorrecto

source: Length stored in tag header does not match
es: La longitud almacenada en el encabezado del marcador no corresponde

source: Extra properties stream seems to be damaged
es: El flujo de las propiedades extras parece estar dañado

source: Auto sequence number type is invalid
es: El tipo de número de secuencia auto es incorrecto

source: Auto sequence number ID is invalid
es: La identificación del número de secuencia automático es incorrecta

source: Type of relation is invalid
es: El tipo de relación es incorrecto

source: The number of relations is invalid
es: El número de relación es incorrecto

source: The relation type does not match
es: El tipo de relación no corresponde

source: The relation source field ID cannot be found
es: No puede encontrarse la identificación del campo fuente de la relación

source: The relation destination field ID cannot be found
es: No es posible encontrar la identificación del campo de destino de la relación

source: The table of relations is damaged
es: La tabla de relaciones está dañada

source: The number of fields for the source is not equal to the number of fields for the destination
es: El número de campos para la fuente no es igual al número de campos para el destino

source: The index definition is damaged
es: La definición del índice está dañada

source: Index type is invalid
es: El tipo de índice es incorrecto

source: Field reference is invalid
es: La referencia del campo es incorrecta

source: Table reference is invalid
es: La referencia de la tabla es incorrecta

source: Index header type is invalid
es: El tipo de encabezado del índice es incorrecto

source: Address of primary directory of index pages is invalid
es: Las direcciones del directorio primario de las páginas de índice es incorrecto

source: The number of index pages is invalid
es: El número de páginas del indice es incorrecto

source: The chained list of deleted index pages is invalid
es: La lista encadenada de eliminación de las páginas del índice es incorrecta

source: Primary page number is invalid
es: El número de la página primaria es incorrecto

source: Address of primary directory of index clusters is invalid
es: La dirección del directorio primario de índices agrupados es incorrecta

source: The number of index clusters is invalid
es: El número de grupos de índice es incorrecto

source: The chained list of deleted index clusters is invalid
es: La lista encadenada de índices agrupados borrados es incorrecta

source: Extra property length is invalid
es: La longitud de las propiedades adicionales es incorrecta

source: Extra property address is invalid
es: La dirección de las propiedades adicionales es incorrecta

source: Extra property checksum is invalid
es: La suma de verificación de propiedades adicionales es incorrecta

source: Cannot read extra property data
es: No es posible leer los datos de las propiedades adicionales

source: Extra property tag header is invalid
es: El encabezado del marcador de las propiedades adicionales es incorrecto

source: Extra property length stored in tag header does not match
es: La longitud de la propiedad adicional almacenada en el encabezado del marcador no corresponde

source: Address of page address directory is invalid
es: La dirección del repertorio de la página de direcciones es incorrecta

source: Address of cluster address directory is invalid
es: La dirección del directorio del grupo de direcciones es incorrecta

source: Tag header of page address directory is invalid
es: El encabezado del marcador del directorio de la pàgina es incorrecto

source: Tag header of cluster address directory is invalid
es: El encabezado del marcador del directorio de direcciones de los grupos es incorrecto

source: Cannot read data for page address directory
es: No es posible leer los datos del directorio de páginas

source: Cannot read data for cluster address directory
es: No es posible leer los datos del directorio de grupos

source: Checksum of page address directory is invalid
es: La suma de verificación del directorio de páginas es incorrecto

source: Checksum of cluster address directory is invalid
es: La suma de verificación del directorio de grupos es incorrecto

source: Cluster type is invalid
es: El tipo de grupo es incorrecto

source: The number of records in cluster is invalid
es: El número de registros en el grupo es incorrecto

source: Cluster contains invalid record references
es: El grupo contiene las referencias de los registros incorrectos

source: Cluster contains deleted record references
es: El grupo contiene las referencias de los registros eliminados

source: Cluster bits count is invalid
es: El contador de bits del grupo es incorrecto

source: The number of index keys is invalid
es: El número de llaves de índices es incorrecto

source: Cluster contains duplicated record references
es: El grupo contiene referencias de registros duplicados

source: Subpage reference is invalid
es: La referencia de la subpágina es eliminada

source: Subpage reference is deleted
es: La referencia de la subpágina es eliminada

source: The keys directory is invalid
es: El directorio de llaves es incorrecto

source: Key references an invalid record number
es: La llave referencia un número de registro incorrecto

source: Key references a deleted record number
es: La llaver referencia un número de registro eliminado

source: Key references a duplicated record number
es: La llave referencia un número de registro duplicado

source: The keys are not in the right order
es: Las llaves no están en el orden correcto

source: Invalid key
es: Llave incorrecta

source: Some record references are missing
es: Faltan algunas referencias de registros

source: This index page is used in a circular reference
es: Esta página de índice se utiliza en una referencia circular

source: Checksum of data table header is invalid
es: La suma de verificación del encabezado de la tabla es incorrecto

source: Length of data table header is invalid
es: La longitud del encabezado de la tabla es incorrecta

source: Tag header of data table header is invalid
es: El encabezado del marcador de encabezado de la tabla es incorrecto

source: Cannot read data of data table header
es: No es posible leer los datos del encabezado de la tabla

source: Address of data table header is invalid
es: La dirección en el encabezado de la tabla es incorrecta

source: Wrong data type number in index
es: Número de tipo de datos incorrecto en el índice

source: The structure and data file do not match
es: Los archivos de estructura y de datos no son compatibles

source: Missing Index file .4DIndx or .4DIndy
es: Archivo de índice faltante .4DIndx o .4DIndy

source: Last database flush did not complete.
es: La última escritura de caché de la base no se completó.

source: Address overlaps
es: Superposición de direcciones

source: Index is flagged to be rebuilt
es: El índice está marcado para reconstruirse

source: External BLOB file is missing
es: No se encuentra el archivo BLOB externo

source: Problem on the database
es: Problema en la base de datos

source: Problem on the data segment # {SegNum}
es: Problema en el segmento de datos # {SegNum}

source: Problem on the secondary directory # {BittableTable} of bit tables in the data segment # {SegNum}
es: Problema en el directorio secundario # {BittableTable} de la tabla de bits en el segmento de datos # {SegNum}

source: Problem on the bit table # {Bittable} in the secondary directory # {BittableTable} of bit tables in the data segment # {SegNum}
es: Problema en la tabla de bits # {Bittable} en el segundo directorio # {BittableTable} de las tablas de bits en el segmento de datos # {SegNum}

source: Problem on the {TableName} data table
es: Problema en la tabla {TableName}

source: Problem on record address directory # {RecordAddressTableNum} in the {TableName} data table
es: Problema en el repertorio de direcciones de registros # {RecordAddressTableNum} en la tabla {TableName}

source: Problem on BLOB address directory # {BlobAddressTableNum} in the {TableName} data table
es: Problema en el directorio de direcciones de los BLOBs # {BlobAddressTableNum} en la tabla {TableName}

source: Problem on BLOB # {BlobNum} in the {TableName} data table
es: Problema con el BLOB # {BlobNum} en la tabla {TableName}

source: Problem on record # {RecordNum} in the {TableName} data table
es: Problema con el registro # {RecordNum} en la tabla {TableName}

source: Problem on field {FieldName} in record # {RecordNum} in the {TableName} data table
es: Problema con el campo {FieldName} en el registro # {RecordNum} en la tabla {TableName}

source: Problem on directory of table definitions
es: Problema en el directorio de definición de las tablas

source: Problem on {TableName} table definition
es: Problema en la definición de la tabla {TableName}

source: Problem on directory of relation definitions
es: Problema en el directorio de definición de las relaciones

source: Problem on relation definition # {RelationNum}
es: Problema en la definición de la relación # {RelationNum}

source: Problem on directory of sequence numbers
es: Problema en el directorio de números automáticos

source: Problem on sequence number # {SeqNum}
es: Problema en el número de secuencia # {SeqNum}

source: Problem on directory of index definitions
es: Problema en el directorio de definición de índices

source: Problem on index definition {IndexName}
es: Problema en la definicion del índice {IndexName}

source: Problem on directory of backup index definitions
es: Problema en el directorio de definición de los índices de backup

source: Problem on backup index definition {IndexName}
es: Problema en la definición de los ínidices de backup {IndexName}

source: UUID Conflict between {ObjType1}:{ObjName1} and {ObjType2}:{ObjName2}
es: Conflicto UUID entre {ObjType1}:{ObjName1} y {ObjType2}:{ObjName2}

source: Problem on field definition {FieldName} in {TableName} table
es: Problema en la definición del campo {FieldName} en la tabla {TableName}

source: Problem on page address directory # {IndexPageAddressTable} in {IndexName} index
es: Problema en el directorio de direcciones de páginas # {IndexPageAddressTable} en el índice {IndexName}

source: Problem on page # {IndexPageNum} in {IndexName} index
es: Problema en la página # {IndexPageNum} en el índice {IndexName}

source: Problem on {IndexName} index
es: Problema en el índice {IndexName}

source: Problem on cluster # {IndexClusterNum} in {IndexName} index
es: Problema en el grupo # {IndexClusterNum} en el índice {IndexName}

source: Problem on cluster address directory # {IndexClusterAddressTable} in {IndexName} index
es: Problema en el directorio de direcciones del grupo # {IndexClusterAddressTable} en el índice {IndexName}

source: Problem on bit page # {BitPageNum} in cluster # {IndexClusterNum} in {IndexName} index
es: Problema en la página de bits # {BitPageNum} en el grupo # {IndexClusterNum} en el índice {IndexName}

source: Problem on directory of data table headers
es: Problema en el directorio de los encabezados de tablas

source: Problem in NULLS cluster of {IndexName} index
es: Problema en el grupo NULLS en el índice {IndexName}

source: Problem on bit page # {BitPageNum} in NULLS cluster of {IndexName} index
es: Problema en la página de bits # {BitPageNum} en el grupo NULLS del índice {IndexName}

source: Overlapping {ObjType} at offset {ObjAddr} with length {ObjLen} in data segment # {SegNum}
es: Superposición de {ObjType} en la posición {ObjAddr} de longitud {ObjLen} en el segmento # {SegNum}

source: Overlapping Objects in data segment # {SegNum}
es: Superposición de objetos en el segmento de datos # {SegNum}

source: Table
es: Tabla

source: Field
es: Campo

source: Index
es: Índice

source: Automatic Sequence Number
es: Número de secuencia automático

source: Relation
es: Relación

source: Loading data tables
es: Cargando tablas de datos

source: Checking data table definitions
es: Verificando las definiciones de tablas de datos

source: Checking chained list of deleted table definitions
es: Verificando la lista encadenada de definiciones de tablas eliminadas

source: Checking index definitions
es: Verificando las definiciones del indice

source: Checking chained list of deleted index definitions
es: Verificando lista encadenada de definiciones de índices eliminados

source: Checking backup index definitions
es: Verificando definiciones de índice de backup

source: Checking chained list of deleted backup index definitions
es: Verificando la lista encadenada de definiciones del índice de backup borrado

source: Checking relation definitions
es: Verificando las definiciones de relaciones

source: Checking chained list of deleted relation definitions
es: Verificando la lista encadenada de definiciones de relaciones eliminadas

source: Checking auto sequence number definitions
es: Verificando las definiciones de la numeración automática

source: Checking chained list of deleted auto sequence number definitions
es: Verificando la lista encadenada de definiciones de la numeración automática eliminada

source: Checking data table headers
es: Verificando encabezados de la tabla de datos

source: Checking chained list of deleted data table headers
es: Verificando la lista encadenada de encabezados de tabla de datos borrados

source: Checking BLOBs in table {p1}
es: Verificando los BLOBs en la tabla {p1}

source: Checking list of deleted BLOBs in table {p1}
es: Verificando la lista de los BLOBs borrados en la tabla {p1}

source: Checking records in table {p1}
es: Verificando registros en la tabla {p1}

source: Checking list of deleted records in table {p1}
es: Verificando la lista de registros borrados en la tabla {p1}

source: Check bit tables for segment {SegNum}
es: Verificando tablas de bit para el segmento {SegNum}

source: Checking index pages on {p1}
es: Verificando páginas de índice de {p1}

source: Checking index page addresses on {p1}
es: Verificando páginas de indice de {p1}

source: Checking list of deleted index pages on {p1}
es: Verificando lista de páginas de índice borradas en {p1}

source: Checking clusters on {p1}
es: Verificando grupos (clusters) en {p1}

source: Checking list of deleted clusters on {p1}
es: Verificando la lista de grupos (clusters) borrados en {p1}

source: on
es: sobre

source: Keywords Index
es: Índice de palabras claves

source: B-tree Index
es: Índice Árbol-B

source: Cluster Index
es: Índice agrupado

source: Index
es: Índice

source: Composite Index
es: Índice compuesto

source: Scanning data
es: Lectura de datos

source: Recovering records
es: Recuperación de registros

source: Recovering BLOBs
es: Recuperación de los BLOBs

source: (Table# {p1} out of {p2} tables)
es: (Tabla# {p1} de {p2} tablas)

source: Checking index {p1}
es: Revisando índice {p1}

source: Loading data
es: Cargando datos

source: Integrating journal: {curValue} of {maxValue} entries
es: Integración de historial: {curValue} de {maxValue} entradas

source: Sequential sorting on {TableName}: {curValue} of {maxValue} records
es: Ordenamiento secuencial en {TableName}: {curValue} de {maxValue} registros

source: Sequential searching on {TableName}: {curValue} of {maxValue} records
es: Búsqueda secuencial en {TableName}: {curValue} de {maxValue} registros

source: Exporting a selection of records: {curValue} of {maxValue} records
es: Exportando una selección de registros: {curValue} de {maxValue} registros

source: Indexing calculation formulas: {curValue} of {maxValue} pages
es: Indexando fórmulas de cálculo: {curValue} de {maxValue} páginas

source: Computing distinct indexed values: {curValue} of {maxValue} pages
es: Calculando valores distintos indexados: {curValue} de {maxValue} páginas

source: Indexed sorting: {curValue} of {maxValue} keys
es: Ordenamiento indexada: {curValue} de {maxValue} llaves

source: Building of
es: Creación de

source: Building index on one field: {curValue} of {maxValue} records
es: Construyendo índice en un campo: {curValue} de {maxValue} registros

source: Building full text index on one field: {curValue} of {maxValue} records
es: Construyendo índice de texto completo en un campo: {curValue} de {maxValue} registros

source: Building composite index: {curValue} of {maxValue} records
es: Construyendo índice compuesto: {curValue} de {maxValue} registros

source: Merging items
es: Fusionando los elementos

source: Building selection
es: Construyendo la selección

source: Generating index pages
es: Generando páginas de índice

source: Generating clusters
es: Generando grupos

source: Generating clusters
es: Generando páginas de índice

source: Generating index clusters
es: Generación de índices agrupados

source: Sequential sorting
es: Ordenación secuencial

source: Sorting data
es: Ordenación de los datos

source: Deleting address table: {curValue} of {maxValue} entries
es: Eliminando la tabla de direcciones: {curValue} de {maxValue} entradas

source: Flushing Data
es: Escritura de datos

source: Deleting records: {curValue} of {maxValue}
es: Eliminación de registros: {curValue} de {maxValue}

source: Analyzing Log file
es: Analizando archivo de historial

source: Selection to array: {curValue} of {maxValue}
es: Selección a array: {curValue} de {maxValue}

source: Array to selection: {curValue} of {maxValue}
es: Array a selección: {curValue} de {maxValue}

source: Indexing calculation formulas: {curValue} of {maxValue} keys
es: Indexando formula de cálculo: {curValue} de {maxValue} llaves

source: Index searching: {curValue} of {maxValue} pages
es: Búsqueda de índices: {curValue} de {maxValue} páginas

source: Index scanning: {curValue} of {maxValue} pages
es: Escaneo de índices: {curValue} de {maxValue} páginas

source: Computing statistics: {curValue} of {maxValue} records
es: Calculando estadísticas: {curValue} de {maxValue} registros

source: Exporting {TableName} as SQL: {curValue} of {maxValue} records
es: Exportación de {TableName} como SQL: {curValue} de {maxValue} registros

source: Exporting database: {curValue} of {maxValue} tables
es: Exportación de la base: {curValue} de {maxValue} tablas

source: Cleaning destination folder...
es: Borrado del contenido de la carpeta de destino...

source: Checking uniqueness
es: Comprobación de unicidad

source: Checking primary keys for {TableName}: {curValue} of {maxValue} records
es: Verificación de llaves primarias en {TableName}: {curValue} de {maxValue} registros

source: data segment header
es: encabezado del segmento de datos

source: primary directory of bit table
es: directorio primario de la tabla de bits

source: secondary directory # {param2} of bit table
es: directorio secundario # {param2} de la tabla de bits

source: bit table # {param3} of directory # {param2}
es: tabla de bits # {param3} del directorio # {param2}

source: auto sequence header # {param1}
es: encabezado de secuencia automática # {param1}

source: data table header # {param1}
es: encabezado tabla de datos # {param1}

source: index header # {param1}
es: encabezado índice # {param1}

source: table definition # {param1}
es: definición de tabla # {param1}

source: relation definition # {param1}
es: definición de relación # {param1}

source: BLOB # {param1} of {TableName}
es: BLOB # {param1} de {TableName}

source: record # {param1} of {TableName}
es: registro # {param1} de {TableName}

source: address table
es: tabla de direcciones

source: records address table of {TableName}
es: tabla de direcciones de los registros de {TableName}

source: BLOBs address table of {TableName}
es: tabla de direcciones de los BLOBs de{TableName}

source: index address table of {IndexName}
es: tabla de direcciones de los índices de {IndexName}

source: clusters address table of {IndexName}
es: tabla de direcciones de los clusters de {IndexName}

source: extra property
es: propiedad extra

source: index page # {param1} of {IndexName}
es: página del índice # {param1} de {IndexName}

source: index cluster # {param1} of {IndexName}
es: índice agrupado # {param1} de {IndexName}

source: part # {param2} of index cluster # {param1} of {IndexName}
es: parte # {param2} del índice agrupado # {param1} de {IndexName}

# default_table_name
source: Table_{id}
es: Tabla_{id}

# default_field_name
source: Field_{id}
es: Campo_{id}

# default_many_to_one_name
source: Link_{id}
es: Relacion_{id}

# default_one_to_many_name
source: Link_{id}_return
es: Relacion_{id}_retorno

source: Compacting data table definitions
es: Compactando las definiciones de tablas de datos

source: Compacting chained list of deleted table definitions
es: Compactando la lista encadenada de definiciones de tablas eliminadas

source: Compacting index definitions
es: Compactando las definiciones del indice

source: Compacting chained list of deleted index definitions
es: Compactando lista encadenada de definiciones de índices eliminados

source: Compacting backup index definitions
es: Compactando definiciones de índice de backup
