Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DCS.xlf
Languages: cs

# ERR_dbmg_1208
source: Cannot send data
cs: Nelze odeslat data

# ERR_dbmg_1209
source: Cannot receive request reply
cs: Nelze přijmout odpověď na dotaz

# ERR_dbmg_1210
source: Cannot send request
cs: Nelze odeslat požadavek

# ERR_dbmg_1211
source: Cannot create connection
cs: Nelze vytvořit spojení

# ERR_dbmg_1212
source: Index {IndexName} cannot be quickly created in database {BaseName}
cs: Index {IndexName} nemůže být rychle vytvořen v databázi {BaseName}

# ERR_dbmg_1213
source: Cannot build distinct index keys
cs: Nelze vytvořit rozdílné indexové klíče

# ERR_dbmg_1214
source: Selection cannot be sorted in table {TableName} of database {BaseName}
cs: Výběr nemůže být tříděn v tabulce {TableName} databáze {BaseName}

# ERR_dbmg_1215
source: Address table cannot loaded
cs: Tabulka adres nemůže být zavedena

# ERR_dbmg_1216
source: Address table cannot modified
cs: Tabulka adres nemůže být upravena

# ERR_dbmg_1217
source: Cannot allocate new entry into address table
cs: Nelze umístit nový vstup do tabulky adres

# ERR_dbmg_1218
source: Cannot allocate free entry from address table
cs: Nelze umístit volný vstup z tabulky adres

# ERR_dbmg_1219
source: Transaction temporary record cannot be saved
cs: Dočasný záznam z transakce nemůže být uložen

# ERR_dbmg_1220
source: Transaction temporary blob cannot be saved
cs: Dočasný blob z transakce nemůže být uložen

# ERR_dbmg_1221
source: Transaction temporary record cannot be loaded
cs: Dočasný záznam z transakce nemůže být zaveden

# ERR_dbmg_1222
source: Transaction temporary blob cannot be loaded
cs: Dočasný blob z transakce nemůže být zaveden

# ERR_dbmg_1223
source: Transaction cannot be started
cs: Transakce nemůže být spuštěna

# ERR_dbmg_1224
source: Transaction cannot be commited
cs: Transaction nemůže správně pokračovat

# ERR_dbmg_1225
source: Cannot get extra property
cs: Nelze získat extra vlastnosti

# ERR_dbmg_1226
source: Cannot set extra property
cs: Nelze nastavit extra vlastnosti

# ERR_dbmg_1227
source: Table name is already used
cs: Název tabulky je již použit

# ERR_dbmg_1228
source: Cannot get list of NULL keys from index {IndexName}
cs: Nelze získat seznam prázdných NULL klíčů z indexu {IndexName}

# ERR_dbmg_1229
source: Cannot modify list of NULL keys of index {IndexName}
cs: Nelze upravit seznam prázdných NULL klíčů z indexu {IndexName}

# ERR_dbmg_1230
source: Invalid key for index {IndexName}
cs: Nesprávný klíč pro index {IndexName}

# ERR_dbmg_1231
source: Cannot set log file
cs: Nelze nastavit log soubor

# ERR_dbmg_1232
source: Context is NULL
cs: Kontext je prázdný - NULL

# ERR_dbmg_1233
source: Database {BaseName} cannot be locked
cs: Databáze {BaseName} nemůže být ukončena

# ERR_dbmg_1234
source: Wrong field reference in record# {RecNum} of table: {TableName} of database: {BaseName}
cs: Špatný odkaz pole v záznamu# {RecNum} tabulky: {TableName} databáze: {BaseName}

# ERR_dbmg_1235
source: Wrong field reference in table: {TableName} of database: {BaseName}
cs: Špatný odkaz v tabulce: {TableName} databáze: {BaseName}

# ERR_dbmg_1236
source: Cannot read data from temporary transaction file
cs: Nelze číst data z dočasného souboru transakce

# ERR_dbmg_1237
source: Cartesian Product failed
cs: Operace s množinami (sadami) selhala

# ERR_dbmg_1238
source: Cannot merge selections
cs: Nelze sloučit výběry

# ERR_dbmg_1239
source: The format of the {BaseName} database cannot be upgraded in read only mode
cs: Formát databáze {BaseName} nelze aktualizovat v režimu pouze pro čtení

# ERR_dbmg_1240
source: Wrong Header
cs: Špatná hlavička

# ERR_dbmg_1241
source: Wrong CheckSum
cs: Špatný kontrolní součet -CheckSum

# ERR_dbmg_1243
source: Cannot load data tables of database: {BaseName}
cs: Nelze zavést tabulky dat databáze: {BaseName}

# ERR_dbmg_1244
source: The list of foreign key constraints is not empty for table: {TableName} of database: {BaseName}
cs: Sznam omezení cizího klíče není prázdný pro tabulku: {TableName} databáze: {BaseName}

# ERR_dbmg_1245
source: Address entry is not empty
cs: Vstup adresy není prázdný

# ERR_dbmg_1246
source: Cannot pre-allocate address
cs: Nelze předumístit adresu

# ERR_dbmg_1247
source: Cannot update new record in table {TableName} of database {BaseName}
cs: Nelze aktualizovat nový záznam tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1248
source: Cannot save new record in table {TableName} of database {BaseName}
cs: Nelze uložit nový záznam tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1249
source: Cannot save subrecord
cs: Nelze uložit podzáznam

# ERR_dbmg_1250
source: Cannot save record
cs: Nelze uložit záznam

# ERR_dbmg_1251
source: Cannot lock structure object definition
cs: Nelze uzamknout definici objektu struktury

# ERR_dbmg_1252
source: Cannot unlock structure object definition
cs: Nelze odemknout definici objektu struktury

# ERR_dbmg_1253
source: Invalid relation number
cs: Neplatné číslo relace

# ERR_dbmg_1254
source: Circular Reference in records address table of table {TableName} of database {BaseName}
cs: Cirkulární reference v tabulce adres záznamů tabulky {TableName} z databáze {BaseName}

# ERR_dbmg_1255
source: Circular Reference in blobs address table of table {TableName} of database {BaseName}
cs: Cirkulární reference v tabulce adres blobů tabulky {TableName} z {BaseName}

# ERR_dbmg_1256
source: Duplicated Schema Name in database {BaseName}
cs: Zdvojený název schéma v databázi {BaseName}

# ERR_dbmg_1257
source: Schema cannot be saved in database {BaseName}
cs: Schéma nemůže být uloženo v databázi {BaseName}

# ERR_dbmg_1258
source: Schema cannot be deleted in database {BaseName}
cs: Schéma nemůže být v databázi vymazáno {BaseName}

# ERR_dbmg_1259
source: Schema cannot be renamed in database {BaseName}
cs: Schéma nemůže být v databázi přejmenováno {BaseName}

# ERR_dbmg_1260
source: Selected log file is too recent for database {BaseName}
cs: Vybraný log soubor je pro tuto databázi {BaseName} příliš nový

# ERR_dbmg_1261
source: Selected log file is too old for database {BaseName}
cs: Vybraný log soubor je pro tuto databázi {BaseName} příliš starý

# ERR_dbmg_1262
source: Some DataTables do not have matching table definitions for database {BaseName}
cs: Některé tabulky dat neodpovídají definici tabulek v databázi {BaseName}

# ERR_dbmg_1263
source: Given stamp does not match current one for record# {RecNum} of table {TableName}
cs: Dotčený stamp neodpovídá tomu pro záznam# {RecNum} tabulky {TableName}

# ERR_dbmg_1264
source: A primary key is needed and missing in table {TableName}
cs: V tabulce {TableName} je potřeba primární klíč a tato jej neobsahuje

# ERR_dbmg_1265
source: Invalid field
cs: Neplatné pole

# ERR_dbmg_1266
source: Unknown field type (this version of 4D is perhaps too old)
cs: Neznámý typ pole (tato verze 4D je asi příliš stará)

# ERR_dbmg_1267
source: Stack Overflow
cs: Přetečení stack paměti

# ERR_dbmg_1268
source: DataTable cannot be regenerated for database {BaseName}
cs: Tabulka dat nemůže být pro databázi {BaseName} regenerována

# ERR_dbmg_1269
source: DataTable cannot be found
cs: Tabulku dat nelze najít

# ERR_dbmg_1270
source: Missing structure could not be rebuild
cs: Chybějící struktura nemůže být přestavěna

# ERR_dbmg_1271
source: Invalid REST request handler
cs: Neplatný REST request handler

# ERR_dbmg_1272
source: Some records are still locked in table {tableName} in database {BaseName}
cs: V tabulce {tableName} jsou stále některé záznamy uzamčeny - v databázi {BaseName}

# ERR_dbmg_1273
source: Cannot drop table {TableName} in database {BaseName}
cs: Nelze zahodit (drop) tabulku {TableName} v databázi {BaseName}

# ERR_dbmg_1274
source: The current journal file of database {BaseName} is not available. For data security reasons, write operations are stopped. Please contact your administrator as soon as possible.
cs: Není dostupný platný soubor žurnálu databáze {BaseName}. Z důvodů bezpečnosti dat byly zastaveny operace zápisu. Kontaktujte prosím co nejdříve svého administrátora.

# ERR_dbmg_1275
source: "(" is missing at the beginning of the Javascript statement in this query.
cs: "(" chybí na počátku Javascript věty v tomto dotazu.

# ERR_dbmg_1276
source: Datastream has an invalid header.
cs: Datastream má neplatnou hlavičku.

# ERR_dbmg_1277
source: The database journal integration failed at entry# {Param1} (operation id {Param2}).
cs: Integrace žurnálu databáze selhala na vstupu# {Param1} (id operace {Param2}).

# ERR_dbmg_1278
source: Javascript code not allowed in the query.
cs: Javascript kód není v dotazu dovolen.

# ERR_dbmg_1279
source: The query placeholder {Param1} is missing or null.
cs: Zástupný znak dotazu {Param1} je prázdný nebo chybí.

# ERR_dbmg_1280
source: The query placeholder {Param1} is not a valid type.
cs: Zástupný znak dotazu {Param1} není platného typu.

# ERR_dbmg_1281
source: Table {TableName} needs a primary key in order to be logged.
cs: Tabulka {TableName} potřebuje k zaznamenávání logu primární klíč.

# ERR_dbmg_1282
source: Cannot find any record with that primary key in table {TableName}.
cs: Nelze nalézt žádný záznam s tímto primárním klíčem v tabulce {TableName}.

# ERR_dbmg_1283
source: A primary key definition is missing for table {TableName}.
cs: Definice primárního klíče pro tabulku {TableName} chybí.

# ERR_dbmg_1284
source: The given primary key of table {TableName} is malformed.
cs: Daný primární klíč tabulky {TableName} je zdeformuvaný.

# ERR_dbmg_1285
source: Non-unique primary key found in table {TableName}.
cs: V tabulce {TableName} byl nalezen nejedinečný primární klíč.

# ERR_dbmg_1286
source: Null primary key found in table {TableName}.
cs: Primární klíč hodnoty Null byl nalezen v tabulce {TableName}.

# ERR_dbmg_1287
source: Log file was created with an older version of the database {BaseName}
cs: Log soubor byl vytvořen starší verzí databáze {BaseName}

# ERR_dbmg_1288
source: Constraints on database {BaseName} cannot be disabled while journaling is active.
cs: Omezení databáze {BaseName} nemohou být vypnuta dokud běží zaznamenávání do žurnálu logu.

# ERR_dbmg_1289
source: A destination folder was not chosen to record the database journal for {BaseName}.
cs: Pro nahrávání žurnálu databáze {BaseName} nebyla vybrána cílová složka.

# ERR_dbmg_1290
source: Cannot open the database journal for {BaseName}.
cs: Nelze otevřít žurnál databáze pro {BaseName}.

# ERR_dbmg_1300
source: Invalid Selection Type
cs: Neplatný typ výběru

# ERR_dbmg_1301
source: Array is too big
cs: Array je příliš veliké

# ERR_dbmg_1302
source: Array size does not match
cs: Velikosti array si neopovídají

# ERR_dbmg_1303
source: Invalid Selection ID
cs: Nepaltné ID váběru

# ERR_dbmg_1304
source: Invalid Selection Part
cs: Neplatná část výběru

# ERR_dbmg_1500
source: The "{Param1}" attribute cannot be found in The "{EntityModelName}" datastore class
cs: Vlastnost "{Param1}" nemůže být nalezena v třídě úložiště dat "{EntityModelName}"

# ERR_dbmg_1501
source: The "{Param1}" datastore class already exists in the "{BaseName}" database
cs: Třída úložiště dat "{Param1}" již v databázi "{BaseName}" existuje

# ERR_dbmg_1502
source: The name of the datastore class in the "{BaseName}" database is missing
cs: Název třídy úložiště dat v databázi "{BaseName}" chybí

# ERR_dbmg_1503
source: Invalid datasource for the "{EntityModelName}" datastore class in the "{BaseName}" database
cs: Neplatný zdroj dat pro třídu úložiště dat "{EntityModelName}" v databázi "{BaseName}"

# ERR_dbmg_1504
source: Attribute's name is missing in the "{EntityModelName}" datastore class
cs: Název vlastnosti v třídě úložiště dat "{EntityModelName}" chybí

# ERR_dbmg_1505
source: Wrong kind for the "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class
cs: Špatný typ pro vlastnost "{EntityAttributeName}" v třídě úložiště dat "{EntityModelName}"

# ERR_dbmg_1506
source: Attribute "{EntityAttributeName}" is not well defined in the "{EntityModelName}" datastore class
cs: Vlastnost "{EntityAttributeName}" není dobře definována v třídě úložiště dat "{EntityModelName}"

# ERR_dbmg_1507
source: The "{EntityModelName}" datastore class cannot be extended with "{Param1}"
cs: Třída úložiště dat "{EntityModelName}" nemůže být rozšířena o "{Param1}"

# ERR_dbmg_1508
source: Wrong value type passed to the "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class
cs: Śpatný typ hodnoty předávaný vlastnosti "{EntityAttributeName}" v třídě úložiště dat "{EntityModelName}"

# ERR_dbmg_1509
source: The relationship "{RelationName}" is not well defined in the "{EntityModelName}" datastore class
cs: Vztah "{RelationName}" není v třídě úložiště dat "{EntityModelName}" dobře definován

# ERR_dbmg_1510
source: The relationship "{RelationName}" already exists in the "{BaseName}" database
cs: Vztah "{RelationName}" již v databázi "{BaseName}" existuje

# ERR_dbmg_1511
source: The relationship "{Param1}" cannot be found for the "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class
cs: Vztah "{Param1}" nemůže být pro vlastnost "{EntityAttributeName}" nalezen v třídě úložiště dat "{EntityModelName}"

# ERR_dbmg_1512
source: The type "{TypeName}" already exists in the "{BaseName}" database
cs: Typ "{TypeName}" již v databázi "{BaseName}" existuje

# ERR_dbmg_1513
source: The type "{Param1}" cannot be found for the "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class
cs: Typ "{Param1}" pro vlastnost "{EntityAttributeName}" nemůže být nalezen v třídě úložiště dat "{EntityModelName}"

# ERR_dbmg_1514
source: The enumeration "{EnumerationName}" already exists in the "{BaseName}" database
cs: Enumerace "{EnumerationName}" již v databázi "{BaseName}" existuje

# ERR_dbmg_1515
source: The enumeration "{Param1}" cannot be found in the "{BaseName}" database
cs: Enumerace "{Param1}" nemůže být v databázi "{BaseName}" nalezena

# ERR_dbmg_1516
source: The value of attribute "{EntityAttributeName}" in the "{EntityModelName}" datastore class cannot be modified
cs: Hodnota vlastnosti "{EntityAttributeName}" v třídě úložiště dat "{EntityModelName}" nemůže být modifikována

# ERR_dbmg_1517
source: The entity# {EntityNum} in the "{EntityModelName}" datastore class cannot be saved
cs: Entita# {EntityNum} otřídy úložiště dat "{EntityModelName}" nemůže být uložena

# ERR_dbmg_1518
source: The entity ({PrimKey}) in the "{EntityModelName}" datastore class cannot be deleted
cs: Entita ({PrimKey}) v třídě úložište dat "{EntityModelName}" nemůže být vymazána

# ERR_dbmg_1519
source: The "{EnumerationName}" enumeration cannot be loaded from the definition in the "{BaseName}" database
cs: Enumerace "{EnumerationName}" nemůže být zavedena z definic databáze "{BaseName}"

# ERR_dbmg_1520
source: The "{TypeName}" type cannot be loaded from the definition in the "{BaseName}" database
cs: Typ "{TypeName}" nemůže být zaveden z definic databáze "{BaseName}"

# ERR_dbmg_1521
source: The "{EntityModelName}" datastore class cannot be loaded from the definition in the "{BaseName}" database
cs: Třída ůložiště dat "{EntityModelName}" nemůže být zaveden z definic databáze "{BaseName}"

# ERR_dbmg_1522
source: The "{EntityAttributeName}" attribute cannot be loaded from the definition in the "{BaseName}" database
cs: Vlastnost "{EntityAttributeName}" nemůže být zavedena z definic databáze "{BaseName}"

# ERR_dbmg_1523
source: The "{RelationName}" relationship cannot be loaded from the definition in the "{BaseName}" database
cs: Vztah "{RelationName}" nemůže být zaveden z definic databáze "{BaseName}"

# ERR_dbmg_1524
source: Source is invalid in the "{RelationName}" relationship in the "{BaseName}" database
cs: Zdroj ve vztahu "{RelationName}" v databázi "{BaseName}" je neplatný

# ERR_dbmg_1525
source: Destination is invalid in the "{RelationName}" relationship in the "{BaseName}" database
cs: Cíl ve vztahu "{RelationName}" v databázi "{BaseName}" je neplatný

# ERR_dbmg_1526
source: Kind is invalid in the "{RelationName}" relationship in the "{BaseName}" database
cs: Druh je neplatný ve vztahu "{RelationName}" databáze "{BaseName}"

# ERR_dbmg_1527
source: Relationship is missing for the "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class
cs: Vztah pro vlastnost "{EntityAttributeName}" ve třídě úložiště dat "{EntityModelName}" chybí

# ERR_dbmg_1528
source: Relationpath is empty for the "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class
cs: Vztah pro vlastnost "{EntityAttributeName}" ve třídě úložiště dat "{EntityModelName}" je prázdný

# ERR_dbmg_1529
source: Field reference is missing for the "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class
cs: Odkaz na pole pro vlastnost "{EntityAttributeName}" ve třídě úložiště dat "{EntityModelName}" chybí

# ERR_dbmg_1530
source: Related datastore class is missing for the "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class
cs: Vztažená třída ůložiště dat chybí pro vlastnost "{EntityAttributeName}" ve třídě úložiště dat "{EntityModelName}"

# ERR_dbmg_1531
source: The "{Param1}" related datastore class cannot be found for the "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class
cs: Vztažená třída ůložiště dat "{Param1}" nemůže být pro vlastnost "{EntityAttributeName}" ve třídě úložiště dat "{EntityModelName}" nalezena

# ERR_dbmg_1532
source: The datastore model cannot be loaded for the "{BaseName}" database
cs: Model úložiště dat nemůže být pro databázi "{BaseName}" načten

# ERR_dbmg_1533
source: The "{Param1}" field reference cannot be found for the "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class
cs: Odkaz na pole "{Param1}" nemůže bý pro vlastnost "{EntityAttributeName}" ve třídě úložiště dat "{EntityModelName}" nalezen

# ERR_dbmg_1534
source: The new entity of the "{EntityModelName}" datastore class cannot be saved
cs: Nová entita pro třídu úložiště dat "{EntityModelName}" nemůže být uložena

# ERR_dbmg_1535
source: The relation path is multi-segmented for the "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class
cs: Cesta vztahu je multi segmentová pro vlastnost "{EntityAttributeName}" ve třídě úložiště dat "{EntityModelName}"

# ERR_dbmg_1536
source: The related entity is not of type "{Param1}" for the "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class
cs: Vztažená entita není typu "{Param1}" - pro vlastnost "{EntityAttributeName}" ve třídě úložiště dat "{EntityModelName}"

# ERR_dbmg_1537
source: Cannot save related entity of the "{Param1}" attribute for the entity of the "{EntityModelName}" datastore class
cs: Nelze uložit vztaženou entitu pro vlastnost "{Param1}" pro entitu třídy úložiště dat "{EntityModelName}"

# ERR_dbmg_1538
source: The "{EntityAttributeName}" attribute in the "{EntityModelName}" datastore class cannot be used as an identifying attribute (wrong type)
cs: Vlastnost "{EntityAttributeName}" třídy úložiště dat "{EntityModelName}" nemůže být použita k identifikaci vlastnosti (špatný typ)

# ERR_dbmg_1539
source: The "{EntityAttributeName}" attributein the "{EntityModelName}" datastore class cannot be used as a primary key attribute (wrong type)
cs: Vlastnost "{EntityAttributeName}" of the datastore class "{EntityModelName}" nemůže být použita jako vlastnost primárního klíče (špatný typ)

# ERR_dbmg_1540
source: The "{EntityModelName}" datastore class has no primary key
cs: Třída ůložiště dat "{EntityModelName}" nemá primární klíč

# ERR_dbmg_1541
source: The given primary key does not match the definition in the "{EntityModelName}" datastore class
cs: Daný primární klíč neodpovídá definici ve třídě úložiště dat "{EntityModelName}"

# ERR_dbmg_1542
source: Cannot find entity with "{Param1}" key in the "{EntityModelName}" datastore class
cs: Nelze nalézt entitu s klíčem "{Param1}" ve třídě úložiště dat "{EntityModelName}"

# ERR_dbmg_1543
source: Cannot load entity# {Param1} in the "{EntityModelName}" datastore class
cs: Nelze zavést entitu# {Param1} ve třídě úložiště dat "{EntityModelName}"

# ERR_dbmg_1544
source: Primary key is NULL for the entity# {EntityNum} in the "{EntityModelName}" datastore class
cs: Primární klíč je NULL pro entitu# {EntityNum} ve třídě úložiště dat "{EntityModelName}"

# ERR_dbmg_1545
source: Primary key {Param1} already exists in the "{EntityModelName}" datastore class
cs: Primární klíč {Param1} již ve třídě úložiště dat "{EntityModelName}" existuje

# ERR_dbmg_1546
source: Primary key is NULL for the new entity in the "{EntityModelName}" datastore class
cs: Primární klíč je NULL pro novou entitu ve třídě úložiště dat "{EntityModelName}"

# ERR_dbmg_1547
source: The datastore class has no identifying attributes
cs: Třída úložiště dat nemá identifikační vlastnosti

# ERR_dbmg_1548
source: Identifying attribute key is invalid
cs: Identifikační vlastnosti klíče jsou neplatné

# ERR_dbmg_1549
source: Identifying attribute key cannot be found
cs: Identifikační vlastnosti klíče nemohou být nalezeny

# ERR_dbmg_1550
source: Script statement is empty
cs: Skript statement je prázdný

# ERR_dbmg_1551
source: Script kind is missing
cs: Typ skriptu chybí

# ERR_dbmg_1552
source: Script kind is unknown
cs: Typ skriptu je neznámý

# ERR_dbmg_1553
source: Wrong permission reference
cs: Špatný odkaz oprávnění

# ERR_dbmg_1554
source: The "{Param1}" datastore class cannot be found
cs: Typ úložiště dat "{Param1}" nemůže být nalezen

# ERR_dbmg_1555
source: Users and Groups directory is missing
cs: Složka uživatelé a skupiny chybí

# ERR_dbmg_1556
source: Datastore class permissions cannot be loaded
cs: Oprávnění pro třídy úložiště dat nelze zavést

# ERR_dbmg_1557
source: No permission to read for the {EntityModelName} datastore class
cs: Žádné oprávnění pro čtení pro třídu úložiště dat {EntityModelName}

# ERR_dbmg_1558
source: No permission to update for the {EntityModelName} datastore class
cs: Žádné oprávnění pro zápis pro třídu úložiště dat {EntityModelName}

# ERR_dbmg_1559
source: No permission to create for the {EntityModelName} datastore class
cs: Žádné oprávnění pro vytvoření třídy úložiště dat {EntityModelName}

# ERR_dbmg_1560
source: No permission to delete for the {EntityModelName} datastore class
cs: Žádné oprávnění pro mazání třídy dat {EntityModelName}

# ERR_dbmg_1561
source: No permission to execute the {MethodName} method in the {EntityModelName} datastore class
cs: Žádné oprávnění pro spuštění metody {MethodName} v třídě úložiště dat {EntityModelName}

# ERR_dbmg_1562
source: JavaScript execution error
cs: Chyba provádění Javascript

# ERR_dbmg_1563
source: Method name is missing
cs: Název metody chybí

# ERR_dbmg_1564
source: Method type is invalid
cs: Typ metody je neplatný

# ERR_dbmg_1565
source: Method definition is invalid
cs: Definice metody je neplatná

# ERR_dbmg_1566
source: Method statement is empty
cs: Instrukce metody jsou prázdné

# ERR_dbmg_1567
source: Method parameter name is invalid
cs: Název paramentru metody je neplatný

# ERR_dbmg_1568
source: Value cannot be less than {Param1}
cs: Hodnota nemůže být menší než {Param1}

# ERR_dbmg_1569
source: Value cannot be greater than {Param1}
cs: Hodnota nemůže být větší než {Param1}

# ERR_dbmg_1570
source: Entity fails validation
cs: Prověření entity selhalo

# ERR_dbmg_1571
source: Value does not match the "{Param1}" pattern
cs: Hodnota neodpovídá vzoru "{Param1}"

# ERR_dbmg_1572
source: The "{Param1}" datastore class name already exists
cs: Název úložiště dat "{Param1}" již existuje

# ERR_dbmg_1573
source: The "{Param1}" method name is unknown
cs: Název metody "{Param1}" je neznámý

# ERR_dbmg_1574
source: The {EntityAttributeName} attribute is not the correct type
cs: Vlastnost {Param1} není správného typu
