Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DCS.xlf
Languages: cs

source: Problem in NULLS cluster of {IndexName} index
cs: Problém v klastru NULLS (prázdných) - indexu {IndexName}

source: Problem on bit page # {BitPageNum} in NULLS cluster of {IndexName} index
cs: Problém na bitové stránce # {BitPageNum} v klastru prázdných - NULLS -v indexu {IndexName}

source: Overlapping {ObjType} at offset {ObjAddr} with length {ObjLen} in data segment # {SegNum}
cs: Přetečení {ObjType} na ofsetu {ObjAddr} s délkou {ObjLen} v segmentu dat # {SegNum}

source: Overlapping Objects in data segment # {SegNum}
cs: Přetečení objektů v datovém segmentu # {SegNum}

source: Table
cs: Tabulka

source: Field
cs: Pole

source: Automatic Sequence Number
cs: Automatické sekvenční číslo

source: Relation
cs: Vztah

source: Loading data tables
cs: Zavádí se tabulky dat

source: Checking data table definitions
cs: Kontrolují se definice tabulek dat

source: Checking chained list of deleted table definitions
cs: Kontroluje se řetězený seznam vymazaných definic tabulek

source: Checking index definitions
cs: Kontrola definic indexů

source: Checking chained list of deleted index definitions
cs: Kontroluje se řetězený seznam vymazaných definic indexů

source: Checking backup index definitions
cs: Kontrola definic záložních indexů

source: Checking chained list of deleted backup index definitions
cs: Kontroluje se řetězený seznam vymazaných definic záložních indexů

source: Checking relation definitions
cs: Kontrola definic vztahů

source: Checking chained list of deleted relation definitions
cs: Kontroluje se řetězený seznam vymazaných definic vztahů

source: Checking auto sequence number definitions
cs: Kontrola definic auto sekvenčních čísel

source: Checking chained list of deleted auto sequence number definitions
cs: Kontroluje se řetězený seznam vymazaných definic auto sekvenčních čísel

source: Checking data table headers
cs: Kontrola hlaviček tabulek dat

source: Checking chained list of deleted data table headers
cs: Kontroluje se řetězený seznam vymazaných hlaviček tabulek dat

source: Checking BLOBs in table {p1}
cs: Kontrola BLOBů tabulky {p1}

source: Checking list of deleted BLOBs in table {p1}
cs: Kontrola seznamu vymazaných BLOBů tabulky {p1}

source: Checking records in table {p1}
cs: Kontrola záznamů tabulky {p1}

source: Checking list of deleted records in table {p1}
cs: Kontrola seznamu vymazaných záznamů tabulky {p1}

source: Check bit tables for segment {SegNum}
cs: Kontrola bitových tabulek pro segment {SegNum}

source: Checking index pages on {p1}
cs: Kontrola stránek indexů v {p1}

source: Checking index page addresses on {p1}
cs: Kontrola adres stránek indexů v {p1}

source: Checking list of deleted index pages on {p1}
cs: Kontrola seznamu vymazaných stránek indexů v {p1}

source: Checking clusters on {p1}
cs: Kontrola klastrů v {p1}

source: Checking list of deleted clusters on {p1}
cs: Kontrola seznamu vymazaných klastrů v {p1}

source: on
cs: v

source: Keywords Index
cs: Index klíčová slova

source: B-tree Index
cs: B-strom Index

source: Cluster Index
cs: Klastr Index

source: Composite Index
cs: Složený (composite) Index

source: Scanning data
cs: Skenování dat

source: Recovering records
cs: Obnova záznamů

source: Recovering BLOBs
cs: Obnova BLOBs

source: (Table# {p1} out of {p2} tables)
cs: (Tabulka# {p1} mimo {p2} tabulek)

source: Checking index {p1}
cs: Kontrola indexu {p1}

source: Object Index
cs: Index objektu

source: Loading data
cs: Zavádí se data

source: Integrating journal: {curValue} of {maxValue} entries
cs: Integrace žurnálu: {curValue} z {maxValue} vstupů

source: Sequential sorting on {TableName}: {curValue} of {maxValue} records
cs: Sekvenční třídění v tabulce {TableName}: {curValue} z {maxValue} záznamů

source: Sequential searching on {TableName}: {curValue} of {maxValue} records
cs: Sekvenční hledání v tabulce {TableName}: {curValue} z {maxValue} záznamů

source: Exporting a selection of records: {curValue} of {maxValue} records
cs: Exportuje se výběr záznamů: {curValue} z {maxValue} záznamů

source: Indexing calculation formulas: {curValue} of {maxValue} pages
cs: Indexují se výpočtové výrazy: {curValue} z {maxValue} stránek

source: Computing distinct indexed values: {curValue} of {maxValue} pages
cs: Počítají se rozdílné indexové hodnoty: {curValue} z {maxValue} stránek

source: Indexed sorting: {curValue} of {maxValue} keys
cs: Indexové třídění: {curValue} z {maxValue} klíčů

source: Building of
cs: Budování

source: Building index on one field: {curValue} of {maxValue} records
cs: Buduje se index jednoho pole: {curValue} z {maxValue} záznamů

source: Building full text index on one field: {curValue} of {maxValue} records
cs: Buduje se plnotextový index jednoho pole: {curValue} z {maxValue} záznamů

source: Building composite index: {curValue} of {maxValue} records
cs: Buduje se složený index: {curValue} z {maxValue} záznamů

source: Merging items
cs: Slučování položek

source: Building selection
cs: Buduje se výběr

source: Generating index pages
cs: Generují se stránky indexů

source: Generating clusters
cs: Generují se klastry

source: Generating clusters
cs: Generují se klastry

source: Generating index clusters
cs: Generují se klastry indexů

source: Sequential sorting
cs: Sekvenční třídění

source: Sorting data
cs: Třídění dat

source: Deleting address table: {curValue} of {maxValue} entries
cs: Mazání tabulek adres: {curValue} z {maxValue} vstupů

source: Flushing Data
cs: Uvolňují se data

source: Deleting records: {curValue} of {maxValue}
cs: Mazání záznamů: {curValue} z {maxValue}

source: Analyzing Log file
cs: Analyzování log souboru

source: Selection to array: {curValue} of {maxValue}
cs: Výběr do array: {curValue} z {maxValue}

source: Array to selection: {curValue} of {maxValue}
cs: Array do výběru: {curValue} z {maxValue}

source: Indexing calculation formulas: {curValue} of {maxValue} keys
cs: Indexování výpočtových vzorců: {curValue} z {maxValue} klíčů

source: Index searching: {curValue} of {maxValue} pages
cs: Indexové hledání: {curValue} z {maxValue} stránek

source: Index scanning: {curValue} of {maxValue} pages
cs: Prohledávání indexů: {curValue} z {maxValue} stránek

source: Computing statistics: {curValue} of {maxValue} records
cs: Operační statistika: {curValue} z {maxValue} záznamů

source: Exporting {TableName} as SQL: {curValue} of {maxValue} records
cs: Export {TableName} jako SQLL: {curValue} z {maxValue} záznamů

source: Exporting database: {curValue} of {maxValue} tables
cs: Export databáze: {curValue} z {maxValue} tabulek

source: Cleaning destination folder…
cs: Čištění cílové složky…

source: Checking uniqueness
cs: CKontrola jedinečností

source: Checking primary keys for {TableName}: {curValue} of {maxValue} records
cs: Kontrola primárních klíčů pro tabulku {TableName}: {curValue} z {maxValue} záznamů

source: data segment header
cs: záhlaví datového segmentu

source: primary directory of bit table
cs: primární adresář bitové tabulky

source: secondary directory # {param2} of bit table
cs: sekundární adresář # {param2} bitové tabulky

source: bit table # {param3} of directory # {param2}
cs: bitová tabulka # {param3} adresáře # {param2}

source: auto sequence header # {param1}
cs: záhlaví auto sequence # {param1}

source: data table header # {param1}
cs: záhlaví tabulky dat # {param1}

source: index header # {param1}
cs: záhlaví indexu # {param1}

source: table definition # {param1}
cs: definice tabulky # {param1}

source: relation definition # {param1}
cs: definice relace # {param1}

source: BLOB # {param1} of {TableName}
cs: BLOB # {param1} z {TableName}

source: record # {param1} of {TableName}
cs: záznam # {param1} z {TableName}

source: address table
cs: tabulka adres

source: records address table of {TableName}
cs: tabulka adres záznamů z {TableName}

source: BLOBs address table of {TableName}
cs: tabulka adres BLOBů z {TableName}

source: index address table of {IndexName}
cs: tabulka adres indexů z {IndexName}

source: clusters address table of {IndexName}
cs: tabulka adres klastrů {IndexName}

source: extra property
cs: extra vlastnost

source: index page # {param1} of {IndexName}
cs: stránka indexů # {param1} z {IndexName}

source: index cluster # {param1} of {IndexName}
cs: klastr indexů # {param1} z {IndexName}

source: part # {param2} of index cluster # {param1} of {IndexName}
cs: část # {param2} klastru indexů # {param1} z {IndexName}

# default_table_name
source: Table_{id}
cs: Tabulka_{id}

# default_field_name
source: Field_{id}
cs: Sloupec_{id}

# default_many_to_one_name
source: Link_{id}
cs: Vztah1_{id}

# default_one_to_many_name
source: Link_{id}_return
cs: VztahN_{id}_return

source: Compacting data table definitions
cs: Kompaktují se definice tabulek dat

source: Compacting chained list of deleted table definitions
cs: Kompaktují se řetězený seznam vymazaných definic tabulek

source: Compacting index definitions
cs: Kompaktace definic indexů

source: Compacting chained list of deleted index definitions
cs: Kontroluje se řetězený seznam vymazaných definic indexů

source: Compacting backup index definitions
cs: Kompaktace definic záložních indexů

source: Compacting chained list of deleted backup index definitions
cs: Kompaktuje se řetězený seznam vymazaných definic záložních indexů

source: Compacting relation definitions
cs: Kompaktace definic vztahů

source: Compacting chained list of deleted relation definitions
cs: Kompaktuje se řetězený seznam vymazaných definic vztahů

source: Compacting auto sequence number definitions
cs: Kompakrace definic auto sekvenčních čísel

source: Compacting chained list of deleted auto sequence number definitions
cs: Kompaktuje se řetězený seznam vymazaných definic auto sekvenčních čísel

source: Compacting data table headers
cs: Kompaktace hlaviček tabulek dat

source: Compacting chained list of deleted data table headers
cs: Kompaktuje se řetězený seznam vymazaných hlaviček tabulek dat

source: Compacting BLOBs in table {p1}
cs: Kompaktace BLOBů tabulky {p1}

source: Compacting list of deleted BLOBs in table {p1}
cs: Kompaktace seznamu vymazaných BLOBů tabulky {p1}

source: Compacting records in table {p1}
cs: Kompaktace záznamů tabulky {p1}

source: Compacting list of deleted records in table {p1}
cs: Kompaktace seznamu vymazaných záznamů tabulky {p1}

source: Compact bit tables for segment {SegNum}
cs: Kompaktace bitových tabulek pro segment {SegNum}

source: Compacting index pages on {p1}
cs: Kompaktace stránek indexů v {p1}

source: Compacting index page addresses on {p1}
cs: Kompaktace adres stránek indexů v {p1}

source: Compacting list of deleted index pages on {p1}
cs: Kompaktace seznamu vymazaných stránek indexů v {p1}

source: Compacting clusters on {p1}
cs: Kompaktace klastrů v {p1}

source: Compacting list of deleted clusters on {p1}
cs: Kompaktace seznamu vymazaných klastrů v {p1}

source: Compacting index {p1}
cs: Kompaktace indexu {p1}

source: Extra properties stream has been repaired
cs: Tok extra vlastností byl opraven

source: The table of relations has been repaired
cs: Tabulka vztahů byla opravena

source: The index definition has been repaired
cs: Definice indexu byla opravena

source: Compacting records of table {p1}
cs: Kompaktace záznamů tabulky {p1}

source: Compacting BLOBs of table {p1}
cs: Kompaktace BLOBů tabulky {p1}

source: Indexing
cs: Indexování

source: Create record
cs: Vytvořit záznam

source: Modify record
cs: Upravit záznam

source: Delete record
cs: Vymazat záznam

source: Start transaction
cs: Start transakce

source: Commit transaction
cs: Uložit transakci

source: Rollback transaction
cs: Storno transakce

source: Open data
cs: Otevřít data

source: Close data
cs: Uzavřít data

source: Create context with User ID
cs: Vytvořit kontext s ID uživatele

source: Create context with extra
cs: Vytvořit kontext s extra

source: Close context
cs: Uzavřít kontext

source: Create blob
cs: Vytvořit blob

source: Modify blob
cs: Upravit blob

source: Delete blob
cs: Vymazat blob

source: Start backup
cs: Start zálohy

source: Truncate table
cs: Oříznout tabulku

source: Save seqnum
cs: Uůožit seqnum

source: Converting journal operations
cs: Konvertování operací žurnálu
