Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DCS.xlf
Languages: cs

# ERR_dbmg_1001
source: No column to import in table {TableName}
cs: Žádný sloupec k importu do tabulky {TableName}

# ERR_dbmg_1002
source: Wrong table to import
cs: Špatná tabulka k importu

# ERR_dbmg_1003
source: No column to export in table {TableName}
cs: Žádný sloupec k importu do tabulky {TableName}

# ERR_dbmg_1004
source: Wrong table to export
cs: Špatná tabulka k exportu

# ERR_dbmg_1006
source: Cannot save structure of database {BaseName}
cs: Nelze uložit strukturu databáze {BaseName}

# ERR_dbmg_1007
source: Cannot create data file of database: {BaseName}
cs: Nelze vytvořit soubor dat databáze: {BaseName}

# ERR_dbmg_1008
source: Wrong data segment in database {BaseName}
cs: Špatný datový segment v databázi {BaseName}

# ERR_dbmg_1009
source: Memory is full
cs: Paměť je zaplněna

# ERR_dbmg_1010
source: Cannot load a table definition of database {BaseName}
cs: Nelze zavést definice tabulek databáze {BaseName}

# ERR_dbmg_1011
source: Cannot open data file of database {BaseName}
cs: Nelze otevřít soubor dat databáze {BaseName}

# ERR_dbmg_1012
source: Data segment is full in database: {BaseName}
cs: Byl zaplněn segment dat databáze: {BaseName}

# ERR_dbmg_1013
source: Cannot save data segment in database {BaseName}
cs: Nelze uložit segment dat databáze {BaseName}

# ERR_dbmg_1014
source: Cannot read data segment of database {BaseName}
cs: Nelze číst segment dat databáze {BaseName}

# ERR_dbmg_1015
source: Wrong database header in database {BaseName}
cs: Špatná hlavička databáze v databázi {BaseName}

# ERR_dbmg_1016
source: Cannot create table in database {BaseName}
cs: Nelze vytvořit tabulku v databázi {BaseName}

# ERR_dbmg_1017
source: Cannot read index list of database {BaseName}
cs: Nelze přečíst seznam indexů databáze {BaseName}

# ERR_dbmg_1018
source: Cannot write index list of database {BaseName}
cs: Nelze zapsat seznam indexů databáze {BaseName}

# ERR_dbmg_1019
source: Wrong table reference in database {BaseName}
cs: Špatný odkaz na tabulku v databázi {BaseName}

# ERR_dbmg_1020
source: Wrong field reference in database {BaseName}
cs: Špatný odkaz na pole v databázi {BaseName}

# ERR_dbmg_1021
source: Invalid index type in database {BaseName}
cs: Neplatný typ indexu v databázi {BaseName}

# ERR_dbmg_1022
source: Invalid field name in table {TableName} of database {BaseName}
cs: Nesprávný název pole v tabulce {TableName} databáze {BaseName}

# ERR_dbmg_1023
source: Invalid database name
cs: Neplatný název databáze

# ERR_dbmg_1024
source: Cannot open structure of database {BaseName}
cs: Nelze otevřít soubor struktury databáze {BaseName}

# ERR_dbmg_1025
source: Cannot create structure of database {BaseName}
cs: Nelze vytvořit strukturu databáze {BaseName}

# ERR_dbmg_1026
source: Cannot load bit selection of database {BaseName}
cs: Nelze zavést bitový výběr databáze {BaseName}

# ERR_dbmg_1027
source: Cannot load set of database {BaseName}
cs: Nelze zavést sadu databáze {BaseName}

# ERR_dbmg_1028
source: Cannot modify set of database {BaseName}
cs: Nelze upravit sadu databáze {BaseName}

# ERR_dbmg_1029
source: Cannot save set of database {BaseName}
cs: Nelze uložit sadu databáze {BaseName}

# ERR_dbmg_1030
source: Cannot save BLOB {BlobNum} in table {TableName} of database {BaseName}
cs: Nelze uložit BLOB {BlobNum} tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1031
source: Cannot load BLOB {BlobNum} in table {TableName} of database {BaseName}
cs: Nelze zavést BLOB {BlobNum} tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1032
source: Cannot allocate BLOB {BlobNum} in table {TableName} of database {BaseName}
cs: Nelze alokovat BLOB {BlobNum} tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1033
source: Cannot load data bit table of database {BaseName}
cs: Nelze zavést bitovou tabulku dat databáze {BaseName}

# ERR_dbmg_1034
source: Cannot save data bit table of database {BaseName}
cs: Nelze uložit bitovou tabulku dat databáze {BaseName}

# ERR_dbmg_1035
source: Cannot load table of data bit tables of database {BaseName}
cs: Nelze zavést tabulku bitových tabulek dat databáze {BaseName}

# ERR_dbmg_1036
source: Cannot save table of data bit tables in database {BaseName}
cs: Nelze uložit tabulku bitových tabulek dat databáze {BaseName}

# ERR_dbmg_1037
source: Cannot close data segment of database {BaseName}
cs: Nelze uzavřít segment dat databáze {BaseName}

# ERR_dbmg_1038
source: Cannot delete data segment of database {BaseName}
cs: Nelze vymazat segment dat databáze {BaseName}

# ERR_dbmg_1039
source: Cannot open data segment of database {BaseName}
cs: Nelze otevřít segment dat databáze {BaseName}

# ERR_dbmg_1040
source: Cannot create data segment of database {BaseName}
cs: Nelze vytvořit segment dat databáze {BaseName}

# ERR_dbmg_1041
source: Cannot allocate space in data segment
cs: Nelze alokovat místo v segmentu dat

# ERR_dbmg_1042
source: Cannot free space in data segment of database {BaseName}
cs: Nelze uvolnit místo v segmentu dat databáze {BaseName}

# ERR_dbmg_1043
source: File is write protected
cs: Soubor chráněn proti zápisu

# ERR_dbmg_1044
source: Cannot access field in record {RecNum} in table {TableName} of database {BaseName}
cs: Nlze zpřístupnit pole v záznamu {RecNum} tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1045
source: Field definition code is missing in record {RecNum} in table {TableName} of database {BaseName}
cs: Kód definice pole chybí v záznamu {RecNum} tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1046
source: Cannot save record {RecNum} in table {TableName} of database {BaseName}
cs: Nelze uložit záznam {RecNum} tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1047
source: Cannot load record {RecNum} in table {TableName} of database {BaseName}
cs: Nelze zavést záznam {RecNum} tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1048
source: Cannot allocate record in table {TableName} of database {BaseName}
cs: Nlze alokovat záznam tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1049
source: Cannot update record {RecNum} in table {TableName} of database {BaseName}
cs: Nelze aktualizovat záznam {RecNum} tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1050
source: Wrong header for record {RecNum} in table {TableName} of database {BaseName}
cs: Špatná hlavička záznamu {RecNum} tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1051
source: Cannot save definition of table {TableName} of database {BaseName}
cs: Nelze uložit definici tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1052
source: Cannot update definition of table {TableName} of database {BaseName}
cs: Nelze aktualizovat definici {TableName} databáze {BaseName}

# ERR_dbmg_1053
source: Field name already exists
cs: Název pole již existuje

# ERR_dbmg_1055
source: Cannot update index values while saving a record in table {TableName} of database {BaseName}
cs: Nelze aktualizovat hodnoty indexů při ukládání záznamu tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1056
source: Cannot update BLOBs while saving a record in table {TableName} of database {BaseName}
cs: Nelze aktualizovat BLOBs při ukládání záznamu tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1057
source: Cannot delete BLOBs while saving or deleting a record in table {TableName} of database {BaseName}
cs: Nelze mazat BLOBs při ukládání nebo mazání záznamu tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1058
source: Cannot add field in table {TableName} of database {BaseName}
cs: Nelze přidat pole tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1059
source: Cannot allocate table in memory
cs: Nelze alokovat tabulku v paměti

# ERR_dbmg_1061
source: Cannot allocate record in memory
cs: Nelze alokovat záznam v paměti

# ERR_dbmg_1062
source: Cannot completely delete table {TableName} of database {BaseName}
cs: Nelze trvale vymazat tabulku {TableName} databáze {BaseName}

# ERR_dbmg_1063
source: Cannot lock record {RecNum} in table {TableName} of database {BaseName}
cs: Nelze uzamknout záznam {RecNum} tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1064
source: Cannot unlock record {RecNum} in table {TableName} of database {BaseName}
cs: Nelze odemknout záznam {RecNum} tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1065
source: Cannot delete record {RecNum} in table {TableName} of database {BaseName}
cs: Nelze vymazat záznam {RecNum} tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1066
source: Record {RecNum} is locked in table {TableName} of database {BaseName}
cs: Uzamčený záznam {RecNum} tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1067
source: Sequential search could not be completed in table {TableName} of database {BaseName}
cs: Nelze dokončit sekvenční hlednání v tabulce {TableName} databáze {BaseName}

# ERR_dbmg_1068
source: Cannot save header for table {TableName} of database {BaseName}
cs: Nelze uložit hlavičku tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1069
source: Cannot import data in table {TableName} of database {BaseName}
cs: Nelze importovat data tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1070
source: Cannot load index header of database {BaseName}
cs: Nelze zavést hlavičku indexu databáze {BaseName}

# ERR_dbmg_1071
source: Cannot save header for index {IndexName} of database {BaseName}
cs: Nelze uložit hlavičku pro index {IndexName} databáze {BaseName}

# ERR_dbmg_1072
source: Cannot get page address for index {IndexName} of database {BaseName}
cs: Nelze získat adresu stránky pro index {IndexName} databáze {BaseName}

# ERR_dbmg_1073
source: Cannot set page address for index {IndexName} of database {BaseName}
cs: Nelze nastavit adresu stránky pro index {IndexName} databáze {BaseName}

# ERR_dbmg_1074
source: Cannot drop index {IndexName} of database {BaseName}
cs: Nelze pustit index {IndexName} databáze {BaseName}

# ERR_dbmg_1075
source: Cannot sort index {IndexName} of database {BaseName}
cs: Nelze třídit index {IndexName} databáze {BaseName}

# ERR_dbmg_1076
source: Cannot load page for index {IndexName} of database {BaseName}
cs: Nelze zavést stránku pro index {IndexName} databáze {BaseName}

# ERR_dbmg_1077
source: Cannot save page for index {IndexName} of database {BaseName}
cs: Nelze uložit stránku pro index {IndexName} databáze {BaseName}

# ERR_dbmg_1078
source: Cannot insert key into index {IndexName} of database {BaseName}
cs: Nelze vložit klíč do indexu {IndexName} databáze {BaseName}

# ERR_dbmg_1079
source: Cannot delete key from index {IndexName} of database {BaseName}
cs: Nelze vymazat klíč z indexu {IndexName} databáze {BaseName}

# ERR_dbmg_1080
source: Cannot completely delete index {IndexName} of database {BaseName}
cs: Nelze kompletně vymazat index {IndexName} of database {BaseName}

# ERR_dbmg_1081
source: Cannot complete scan on index {IndexName} of database {BaseName}
cs: Nelze dokončit sken indexu {IndexName} databáze {BaseName}

# ERR_dbmg_1082
source: Cannot complete sort of index {IndexName} of database {BaseName}
cs: Nelze dokončit třídění indexu {IndexName} databáze {BaseName}

# ERR_dbmg_1083
source: Cannot insert key into page of index {IndexName} of database {BaseName}
cs: Nelze vložit klíč do stránky indexu {IndexName} databáze {BaseName}

# ERR_dbmg_1084
source: Cannot delete key from page of index {IndexName} of database {BaseName}
cs: Nelze vymazat klíč ze stránky indexu {IndexName} databáze {BaseName}

# ERR_dbmg_1085
source: Cannot load index cluster of database {BaseName}
cs: Nelze zavést indexový klastr databáze {BaseName}

# ERR_dbmg_1086
source: Cannot add to index cluster of database {BaseName}
cs: Nelze přidat do indexového klastru databáze {BaseName}

# ERR_dbmg_1087
source: Cannot delete from index cluster of database {BaseName}
cs: Nelze mazat z indexového kastru databáze {BaseName}

# ERR_dbmg_1088
source: Index {IndexName} is invalid or missing
cs: Index {IndexName} je neplatný nebo chybí

# ERR_dbmg_1089
source: SQL syntax error (Obsolete)
cs: Chyba syntaxe SQL (opuštěno)

# ERR_dbmg_1090
source: SQL token not found (Obsolete)
cs: Token SQL nenalezen (opuštěno)

# ERR_dbmg_1091
source: Not implemented
cs: Neimplementováno

# ERR_dbmg_1092
source: Cannot register code
cs: Nelze registrovat kód

# ERR_dbmg_1093
source: Operation in progress cancelled by user
cs: Běžící operace stornována uživatelem

# ERR_dbmg_1094
source: Transaction conflict
cs: Konflikt tansakce

# ERR_dbmg_1095
source: Invalid table name in database {BaseName}
cs: Neplatný název tabulky databáze {BaseName}

# ERR_dbmg_1096
source: Table {TableName} is locked in database {BaseName}
cs: Uzamčená tabulka {TableName} databáze {BaseName}

# ERR_dbmg_1097
source: Database {BaseName} is locked
cs: Databáze {BaseName} je uzamčena

# ERR_dbmg_1098
source: Data address is invalid in database {BaseName}
cs: Neplatná adresa dat v databázi {BaseName}

# ERR_dbmg_1099
source: Record is empty
cs: Záznam je prázdný

# ERR_dbmg_1100
source: Wrong source field
cs: Špatné zdrojové pole (sloupec)

# ERR_dbmg_1101
source: Wrong destination field
cs: Špatné cílové pole (sloupec)

# ERR_dbmg_1102
source: Invalid relation name
cs: Neplatný název vztahu

# ERR_dbmg_1103
source: Field types do not match
cs: Typy polí si neodpovídají

# ERR_dbmg_1104
source: Relation is empty
cs: Vztah je prázdný

# ERR_dbmg_1105
source: Cannot load relations list from database {BaseName}
cs: Nelze zavést seznam vztahů databáze {BaseName}

# ERR_dbmg_1106
source: Cannot save relations list into database {BaseName}
cs: Nelze uložit seznam vztahů databáze {BaseName}

# ERR_dbmg_1107
source: Query and lock not completed; at least one record locked somewhere else
cs: Query and lock (Dotaz a uzamknout) nedokončeny; nejméně jeden záznam uzamčen někde jinde

# ERR_dbmg_1108
source: Invalid record
cs: Neplatný záznam

# ERR_dbmg_1109
source: Wrong record ID
cs: Špatné ID záznamu

# ERR_dbmg_1110
source: Relation already exists in database {BaseName}
cs: Již existující vztah v databázi {BaseName}

# ERR_dbmg_1111
source: Index already exists in database {BaseName}
cs: Již existující index v databázi {BaseName}

# ERR_dbmg_1112
source: Wrong comparison operator
cs: Špatný operátor porovnáví

# ERR_dbmg_1113
source: End of data buffer
cs: Konec bufferu dat

# ERR_dbmg_1114
source: Wrong DB4D version number
cs: Špatné číslo verze DB4D

# ERR_dbmg_1115
source: Duplicated key
cs: Zdvojený klíč

# ERR_dbmg_1116
source: Mandatory field is Null in record {RecNum} in table {TableName}
cs: Prázdné povinné pole v záznamu {RecNum} tabulky {TableName}

# ERR_dbmg_1117
source: Cannot set field to mandatory for table {TableName}
cs: Pole nelze nastavit jako povinné pro tabulku {TableName}

# ERR_dbmg_1118
source: Cannot get exclusive access to table {TableName}
cs: Nelze získat výhradní přístup k tabulce {TableName}

# ERR_dbmg_1119
source: Cannot check referential integrity of table {TableName}
cs: Nelze zkontrolovat referenční integritu tabulky {TableName}

# ERR_dbmg_1120
source: Reference integrity: some foreign keys still exist matching primary key on record {RecNum} in table {TableName}
cs: Referenční integrita: stále existují nějaké cizí klíče odpovídající primárnímu klíči v záznamu {RecNum} tabulky {TableName}

# ERR_dbmg_1121
source: Cannot delete all records in selection of table {TableName}
cs: Nelze vymazat všechny záznamy výběru z tabulky {TableName}

# ERR_dbmg_1122
source: BLOB is Null
cs: BLOB je prázdný

# ERR_dbmg_1123
source: Invalid database context
cs: Noplatný kontext databáze

# ERR_dbmg_1124
source: Invalid relation reference
cs: Neplatný odkaz vztahu

# ERR_dbmg_1125
source: Invalid record name in table {TableName}
cs: Neplatný název záznamu v tabulce {TableName}

# ERR_dbmg_1126
source: Wrong field type
cs: Špatný typ pole

# ERR_dbmg_1127
source: Cannot load extra properties
cs: Nelze zavést extra vlastnosti

# ERR_dbmg_1128
source: Cannot save extra properties
cs: Nelze uložit extra vlastnosti

# ERR_dbmg_1129
source: Subrecord ID is out of range
cs: ID podzáznamu je mimo rozsah

# ERR_dbmg_1130
source: Duplicate name for index {IndexName} in database {BaseName}
cs: Zdvojený název pro index {IndexName} v databázi {BaseName}

# ERR_dbmg_1131
source: Invalid name for index {IndexName} in database {BaseName}
cs: Neplatný název pro index {IndexName} v databázi {BaseName}

# ERR_dbmg_1132
source: Wrong key value on index {IndexName}
cs: Špatná hodnota klíče v indexu {IndexName}

# ERR_dbmg_1133
source: Wrong type for index {IndexName}
cs: Špatný typ pro klíč {IndexName}

# ERR_dbmg_1134
source: Invalid accessor
cs: Neplatný accessor (přistupovač)

# ERR_dbmg_1135
source: Accessor is read only
cs: Accessor (přistupovač) je pouze pro čtení

# ERR_dbmg_1136
source: Null value not accepted
cs: Prázdná hodnota je nepřijetelná

# ERR_dbmg_1137
source: THIS is Null
cs: TOTO je Null (prázdné)

# ERR_dbmg_1138
source: Selection is Null
cs: Výběr je prázdný

# ERR_dbmg_1139
source: Database {BaseName} is write protected
cs: Databáze {BaseName} je chráněna proti zápisu

# ERR_dbmg_1140
source: Database {BaseName} is closing
cs: Databáze {BaseName} se uzavírá

# ERR_dbmg_1141
source: Invalid transaction
cs: Neplatná transakce

# ERR_dbmg_1142
source: Array limit is exceeded
cs: Limit array byl překročen

# ERR_dbmg_1143
source: Creator of array values is missing
cs: Chybí creator hodnot pole (kdo,co)

# ERR_dbmg_1144
source: Cannot build selection of table {TableName}
cs: Nelze vytvořit výběr z tabulky {TableName}

# ERR_dbmg_1145
source: Busy object
cs: Zaneprázdněný objekt

# ERR_dbmg_1146
source: Data file does not match structure file
cs: Soubor dat neodpovídá souboru struktury

# ERR_dbmg_1147
source: Cannot start listener
cs: Nelze nastartovat Listener

# ERR_dbmg_1148
source: Cannot start server
cs: Nelze nastartovat server

# ERR_dbmg_1149
source: No listener
cs: Žádný Listener

# ERR_dbmg_1150
source: Task is dying
cs: Úloha kolabuje

# ERR_dbmg_1151
source: Invalid request tag
cs: Neplatný tag požadavku

# ERR_dbmg_1152
source: Invalid context ID
cs: Neplatné ID kontextu

# ERR_dbmg_1153
source: Not enough temporary space on disk
cs: Není dost dočasného prostoru na disku

# ERR_dbmg_1154
source: Data set is Null
cs: Sada dat je prázdná

# ERR_dbmg_1155
source: No primary key matching the foreign key
cs: Žádný primární klíč odpovídající cizímu klíči

# ERR_dbmg_1156
source: Type of field {FieldName} of table {TableName} does not support being set to Unique
cs: Typ pole {FieldName} tabulky {TableName} nepodporuje nastavení na Jedinečné

# ERR_dbmg_1157
source: Type of field {FieldName} of table {TableName} does not support being set to NEVER NULL
cs: Typ pole {FieldName} tabulky {TableName} nepodporuje nastavení na Nikdy prázdné (NEVER NULL)

# ERR_dbmg_1158
source: Cannot alter primary key definition of table {TableName}
cs: Nelze změnit definici primárního klíče tabulky {TableName}

# ERR_dbmg_1159
source: Maximum number of records has been reached for table {TableName}
cs: Byl dosažen maximální počet záznamů tabulky {TableName}

# ERR_dbmg_1160
source: Maximum number of BLOBs has been reached for table {TableName}
cs: Byl dosažen maximální počet BLOBů v tabulce {TableName}

# ERR_dbmg_1161
source: Indice is out of range
cs: Ukazatel je mimo rámec

# ERR_dbmg_1162
source: Query is invalid
cs: Neplatný dotaz

# ERR_dbmg_1163
source: Record is NULL
cs: Záznam je prázdný

# ERR_dbmg_1164
source: Object is NULL
cs: Objekt je prázdný

# ERR_dbmg_1165
source: Wrong owner for this object
cs: Špatný vlastník tohoto objektu

# ERR_dbmg_1166
source: Object was not locked
cs: Objekt nebyl uzamčen

# ERR_dbmg_1167
source: Object is locked by another context
cs: Objekt je uzamčen z jiného kontextu

# ERR_dbmg_1168
source: Internal error on remote connection
cs: Vnitřní chyba na vzdáleném připojení

# ERR_dbmg_1169
source: Invalid table number
cs: Neplatné číslo tabulky

# ERR_dbmg_1170
source: Invalid field number
cs: Neplatné číslo záznamu

# ERR_dbmg_1171
source: Invalid Database ID
cs: Neplatné ID databáze

# ERR_dbmg_1172
source: Invalid Parameter
cs: Neplatný parametr

# ERR_dbmg_1173
source: Cache Flushing did not complete
cs: Uvolňování vyrovnávací paměti nebylo dokončeno

# ERR_dbmg_1174
source: Data Flushing did not complete
cs: Uvolňování dat nebylo dokončeno

# ERR_dbmg_1175
source: Structure Flushing did not complete
cs: Uvolňování struktury nebylo dokončeno

# ERR_dbmg_1176
source: Log file is invalid for database {BaseName}
cs: Neplatný Log soubor pro databázi {BaseName}

# ERR_dbmg_1177
source: Log file cannot be found for database {BaseName}
cs: Nelze nalézt log soubor pro databázi {BaseName}

# ERR_dbmg_1178
source: Last operation in log file does not match the one in database {BaseName}
cs: Poslední operace v log souboru neodpovídá té v databázi {BaseName}

# ERR_dbmg_1179
source: Log file does not match database {BaseName}
cs: Log soubor neodpovídá databázi {BaseName}

# ERR_dbmg_1180
source: Data Table has been deleted
cs: Tabulka dat byla vymazána

# ERR_dbmg_1181
source: Keys are not unique in index {IndexName}
cs: Nejedinečné klíče v indexu {IndexName}

# ERR_dbmg_1182
source: Cannot create log file for database {BaseName}
cs: Nelze vytvořit log soubor pro databázi {BaseName}

# ERR_dbmg_1183
source: Cannot write into log file of database {BaseName}
cs: Nelze zapsat do log souboru databáze {BaseName}

# ERR_dbmg_1184
source: Cannot drop table {TableName} in database {BaseName}
cs: Nelze pustit tabulku {TableName} v databázi {BaseName}

# ERR_dbmg_1185
source: Remote database cannot be opened
cs: Vzdálená databáze nemůže být otevřena

# ERR_dbmg_1186
source: Log file cannot be integrated into database {BaseName}
cs: Log sooubor nemůže být integrován do databáze {BaseName}

# ERR_dbmg_1187
source: Internal Computation on Set cannot be completed
cs: Vnitřní výpočet pro sadu nelze dokončit

# ERR_dbmg_1188
source: Array cannot be saved
cs: Array nelze uložit

# ERR_dbmg_1189
source: Array cannot be loaded
cs: Array nelze zavést

# ERR_dbmg_1190
source: Sequence number header cannot be loaded
cs: Hlavičku sekvenčního čísla nelze zavést

# ERR_dbmg_1191
source: Cannot select record
cs: Záznam nemůže být vybrán

# ERR_dbmg_1192
source: Record cannot be created
cs: Záznam nemůže být vytvořen

# ERR_dbmg_1193
source: Cannot complete selection to array in table {TableName} of database {BaseName}
cs: Nelze dokončit selectioin to array v tabulce {TableName} databáze {BaseName}

# ERR_dbmg_1194
source: Cannot complete array to selection in table {TableName} of database {BaseName}
cs: Nelze dokončit array to selection v tabulce {TableName} databáze {BaseName}

# ERR_dbmg_1195
source: Cannot complete sequential sort
cs: Nelze dokončit sekvenční třídění

# ERR_dbmg_1196
source: Selection cannot be locked
cs: Výběr nemůže být uzamčen

# ERR_dbmg_1197
source: Index key cannot be loaded
cs: Indexový klíč nemůže být zaveden

# ERR_dbmg_1198
source: Index key cannot be saved
cs: Indexový klíč nemůže být uložen

# ERR_dbmg_1199
source: Index key cannot be built
cs: Indexový klíč nemůže být vytvořen

# ERR_dbmg_1200
source: Query cannot be completed
cs: Dotaz nemůže být dokončen

# ERR_dbmg_1201
source: Query cannot be analyzed
cs: Dotaz nemůže být anylyzován

# ERR_dbmg_1202
source: Formula could not be processed on this column
cs: Výraz nemůže být nad tímto sloupcem zpracován

# ERR_dbmg_1203
source: Query could not be completed
cs: Dotaz nemůže být dokončen

# ERR_dbmg_1204
source: Query could not be analyzed
cs: Dotaz nemůže být analyzován

# ERR_dbmg_1205
source: Could not get all distinct values of table {TableName} of database {BaseName}
cs: Nelze dostat všechny rozdílné hodnoty tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1206
source: Cannot build array of values in table {TableName} of database {BaseName}
cs: Nelze sestavit array hodnot tabulky {TableName} databáze {BaseName}

# ERR_dbmg_1207
source: Selection cannot be loaded
cs: Výběr nenůže být zaveden
