Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DPT-*.xlf
Languages: pt_br

source: Address of BLOB address directory is invalid
pt_br: O endereço do diretório de endereços do BLOB é incorreto

source: Tag header of record address directory is invalid
pt_br: O cabeçalho do marcador do diretório de endereços de registros é incorreto

source: Tag header of BLOB address directory is invalid
pt_br: O cabeçalho do marcador do diretório de endereços do BLOB é incorreto

source: Cannot read data for record address directory
pt_br: Não é possível ler os dados do diretório de endereços dos registros

source: Cannot read data for BLOB address directory
pt_br: Não é possível ler os dados do diretório de endereços do BLOB

source: Checksum of record address directory is invalid
pt_br: Checksum do diretório de endereços de registros é incorreto

source: Checksum of BLOB address directory is invalid
pt_br: Checksum do diretório de endereços dos BLOBs é incorreto

source: Length of address directory is invalid
pt_br: O comprimento do diretório de endereços é incorreto

source: BLOB address is invalid
pt_br: O endereço do BLOB é incorreto

source: Cannot read BLOB data
pt_br: Os dados do BLOB não podem ser lidos

source: BLOB checksum is invalid
pt_br: Checksum do BLOB é incorreto

source: BLOB tag header is invalid
pt_br: O cabeçalho do marcador do BLOB é incorreto

source: BLOB length is invalid
pt_br: O comprimento do BLOB é incorreto

source: BLOB length does not match the one in the address directory
pt_br: O comprimento do BLOB não corresponde do do diretório de endereços

source: Record address is invalid
pt_br: O endereço do registro é incorreto

source: Cannot read record data
pt_br: Não é possível ler os dados dos registros

source: Record checksum is invalid
pt_br: Checksum do registro é incorreto

source: Record length does not match the one in the address directory
pt_br: O comprimento do registro não corresponde ao do diretório de endereços

source: Record length is invalid
pt_br: O comprimento do registro é incorreto

source: Record tag header is invalid
pt_br: O cabeçalho do marcador de registro é incorreto

source: Number of fields invalid
pt_br: Número de campos incorreto

source: Invalid data field type
pt_br: Tipo de campo incorreto

source: Invalid data field offset in record
pt_br: Offset de campo incorreto no registro

source: Invalid data field length
pt_br: Comprimento de campo incorreto

source: BLOB reference is invalid in this data field
pt_br: A referência do BLOB para este campo é incorreta

source: BLOB is deleted in this data field
pt_br: BLOB foi excluído neste campo

source: BLOB is invalid in this data field
pt_br: BLOB é incorreto neste campo

source: BLOB reference of this data field is already used in another record
pt_br: A referência do BLOB para este campo já foi utilizada em outro registro

source: The chained list of deleted BLOBs is circular
pt_br: A lista encadeada de eliminação de BLOBs é circular

source: The chained list of deleted BLOBs is invalid
pt_br: A lista encadeada de eliminação de BLOBs é incorreta

source: The chained list of deleted records is circular
pt_br: A lista encadeada de eliminação de registros é circular

source: The chained list of deleted records is invalid
pt_br: A lista encadeada de registros eliminados é incorreta

source: Some BLOBs are orphans in this data table
pt_br: Alguns BLOBs são orfãos nesta tabela de dados

source: Address of primary address directory is invalid
pt_br: O endereço do diretório de endereços primários é incorreto

source: The number of entries is invalid
pt_br: O número de entradas é incorreto

source: The chained list of deleted entries is invalid
pt_br: A lista encadeada de eliminação de entradas é incorreta

source: Address is invalid
pt_br: O endereço não é válido

source: Address of address directory is invalid
pt_br: O endereço de diretório de endereços não é válido

source: Tag header of address directory is invalid
pt_br: O cabeçalho do marcador do diretório de endereços não é válido

source: Cannot read data for address directory
pt_br: Não é possível ler os dados do diretório de endereços

source: Checksum of address directory is invalid
pt_br: Checksum do diretório de endereços é incorreto

source: Length is invalid
pt_br: Comprimento incorreto

source: Address is invalid
pt_br: O endereço não é válido

source: Checksum is invalid
pt_br: Checksum não é válido

source: Cannot read data
pt_br: Não é possível ler os dados

source: Tag header is invalid
pt_br: O cabeçalho do marcador é incorreto

source: Length of table name is invalid
pt_br: O comprimento do nome da tabela é incorreto

source: Length of record class name is invalid
pt_br: O comprimento do nome da clase de registro é incorreto

source: Length of field name is invalid
pt_br: O comprimento do nome do campo é incorreto

source: Type of Table is invalid
pt_br: O tipo da tabela é incorreto

source: The number of fields is invalid
pt_br: O número de campos é incorreto

source: The number of Fields does not match the size of the table definition
pt_br: O número de campos não corresponde ao tamanho de definição da tabela

source: The UUIDs are the same
pt_br: Os UUIDs são idênticos

source: Field type is invalid
pt_br: O tipo de campo é incorreto

source: Length stored in tag header does not match
pt_br: O comprimento armazenado no cabeçalho do marcador não corresponde

source: Extra properties stream seems to be damaged
pt_br: O fluxo das propriedades extras parece estar danificado

source: Auto sequence number type is invalid
pt_br: O tipo de número de auto-sequência não é válido

source: Auto sequence number ID is invalid
pt_br: A identificação do número de sequência automática não é válida

source: Type of relation is invalid
pt_br: O tipo de relação é incorreto

source: The number of relations is invalid
pt_br: O número de relação é incorreto

source: The relation type does not match
pt_br: O tipo de relação não corresponde

source: The relation source field ID cannot be found
pt_br: Não é possível encontrar a identificação do campo fonte da relação

source: The relation destination field ID cannot be found
pt_br: Não é possível encontrar a identificação do campo de destino da relação

source: The table of relations is damaged
pt_br: A tabela de relações está danificada

source: The number of fields for the source is not equal to the number of fields for the destination
pt_br: O número de campos para a fonte não é igual ao número de campos para o destino

source: The index definition is damaged
pt_br: A definição do índice está danificada

source: Index type is invalid
pt_br: O tipo de índice é incorreto

source: Field reference is invalid
pt_br: A referência do campo é incorreta

source: Table reference is invalid
pt_br: A referência da tabela é incorreta

source: Index header type is invalid
pt_br: O tipo de cabeçalho do índice é incorreto

source: Address of primary directory of index pages is invalid
pt_br: Os endereços do diretório primário das páginas de índice é incorreto

source: The number of index pages is invalid
pt_br: O número de páginas do índice é incorreto

source: The chained list of deleted index pages is invalid
pt_br: A lista encadeada de eliminação das páginas do índice é incorreta

source: Primary page number is invalid
pt_br: O número da página primária é incorreto

source: Address of primary directory of index clusters is invalid
pt_br: O endereço do diretório primário de índices agrupados é incorreto

source: The number of index clusters is invalid
pt_br: O número de grupos de índice é incorreto

source: The chained list of deleted index clusters is invalid
pt_br: A lista encadeada de índices agrupados excluídos é incorreta

source: Extra property length is invalid
pt_br: O comprimento das propriedades adicionais é incorreta

source: Extra property address is invalid
pt_br: O endereço das propriedades adicionais é incorreto

source: Extra property checksum is invalid
pt_br: CheckSum de propriedades adicionais é incorreto

source: Cannot read extra property data
pt_br: Não é possível ler os dados das propriedades adicionais

source: Extra property tag header is invalid
pt_br: O cabeçalho do marcador das propriedades adicionais é incorreto

source: Extra property length stored in tag header does not match
pt_br: O comprimento da propriedade adicional armazenada no cabeçalho do marcador não corresponde

source: Address of page address directory is invalid
pt_br: O endereço da página de endereços não é válido

source: Address of cluster address directory is invalid
pt_br: O endereço do diretório do grupo de endereços é incorreto

source: Tag header of page address directory is invalid
pt_br: O cabeçalho do marcador do diretório da pàgina é incorreto

source: Tag header of cluster address directory is invalid
pt_br: O cabeçalho do marcador do diretório de endereços dos grupos é incorreto

source: Cannot read data for page address directory
pt_br: Não é possível ler os dados do diretório de páginas

source: Cannot read data for cluster address directory
pt_br: Não é possível ler os dados do diretório de grupos

source: Checksum of page address directory is invalid
pt_br: Checksum do diretório de páginas é incorreto

source: Checksum of cluster address directory is invalid
pt_br: Checksum do diretório de grupos é incorreto

source: Cluster type is invalid
pt_br: O tipo de grupo é incorreto

source: The number of records in cluster is invalid
pt_br: O número de registros no grupo é incorreto

source: Cluster contains invalid record references
pt_br: O grupo contém as referências dos registros incorretos

source: Cluster contains deleted record references
pt_br: O grupo contém as referências dos registros excluídos

source: Cluster bits count is invalid
pt_br: O contador de bits do grupo é incorreto

source: The number of index keys is invalid
pt_br: O número de chaves de índices é incorreto

source: Cluster contains duplicated record references
pt_br: O grupo contém referências de registros duplicados

source: Subpage reference is invalid
pt_br: A referência da subpágina não é válida

source: Subpage reference is deleted
pt_br: A referência da subpágina foi excluída

source: The keys directory is invalid
pt_br: O diretório de chaves é incorreto

source: Key references an invalid record number
pt_br: A chave referencia um número de registro incorreto

source: Key references a deleted record number
pt_br: A chave referencia um número de registro eliminado

source: Key references a duplicated record number
pt_br: A chave referencia um número de registro duplicado

source: The keys are not in the right order
pt_br: As chaves não estão em ordem correta

source: Invalid key
pt_br: Chave incorreta

source: Some record references are missing
pt_br: Faltam algumas referências de registros

source: This index page is used in a circular reference
pt_br: Esta página de índice é utilizada em uma referência circular

source: Checksum of data table header is invalid
pt_br: Checksum do cabeçalho da tabela é incorreto

source: Length of data table header is invalid
pt_br: O comprimentodo do cabeçalho da tabela é incorreto

source: Tag header of data table header is invalid
pt_br: O cabeçalho do marcador de cabeçalho da tabela é incorreto

source: Cannot read data of data table header
pt_br: Não é possível ler os dados do cabeçalho da tabela

source: Address of data table header is invalid
pt_br: O endereço do cabeçalho da tabela é incorreto

source: Wrong data type number in index
pt_br: Número de tipo de dados incorreto no índice

source: The structure and data file do not match
pt_br: Os arquivos de estrutura e de dados não são compatíveis

source: Missing Index file .4DIndx or .4DIndy
pt_br: Está faltando arquivo de índice .4DIndx ou .4DIndy

source: Last database flush did not complete.
pt_br: A última escritura de cache do banco de dados não terminou.

source: Address overlaps
pt_br: Superposição de endereços

source: Index is flagged to be rebuilt
pt_br: O índice está marcado para ser reconstruído

source: External BLOB file is missing
pt_br: O arquivo BLOB externo está faltando

source: Problem on the database
pt_br: Problema no banco de dados

source: Problem on the data segment # {SegNum}
pt_br: Problema no segmento de dados # {SegNum}

source: Problem on the secondary directory # {BittableTable} of bit tables in the data segment # {SegNum}
pt_br: Problema no diretório secundário # {BittableTable} da tabela de bits no segmento de dados # {SegNum}

source: Problem on the bit table # {Bittable} in the secondary directory # {BittableTable} of bit tables in the data segment # {SegNum}
pt_br: Problema na tabela de bits # {Bittable} no segundo diretório # {BittableTable} das tabelas de bits no segmento de dados # {SegNum}

source: Problem on the {TableName} data table
pt_br: Problema na tabela {TableName}

source: Problem on record address directory # {RecordAddressTableNum} in the {TableName} data table
pt_br: Problema no diretório de endereços de registros # {RecordAddressTableNum} na tabela {TableName}

source: Problem on BLOB address directory # {BlobAddressTableNum} in the {TableName} data table
pt_br: Problema no diretório de endereços dos BLOBs # {BlobAddressTableNum} na tabela {TableName}

source: Problem on BLOB # {BlobNum} in the {TableName} data table
pt_br: Problema com o BLOB # {BlobNum} na tabela {TableName}

source: Problem on record # {RecordNum} in the {TableName} data table
pt_br: Problema com o registro # {RecordNum} na tabela {TableName}

source: Problem on field {FieldName} in record # {RecordNum} in the {TableName} data table
pt_br: Problema com o campo {FieldName} no registro # {RecordNum} na tabela {TableName}

source: Problem on directory of table definitions
pt_br: Problema no diretório de definição das tabelas

source: Problem on {TableName} table definition
pt_br: Problema na definição da tabela {TableName}

source: Problem on directory of relation definitions
pt_br: Problema no diretório de definição das relações

source: Problem on relation definition # {RelationNum}
pt_br: Problema na definição da relação # {RelationNum}

source: Problem on directory of sequence numbers
pt_br: Problema no diretório de números automáticos

source: Problem on sequence number # {SeqNum}
pt_br: Problema no número de sequência # {SeqNum}

source: Problem on directory of index definitions
pt_br: Problema no diretório de definição de índices

source: Problem on index definition {IndexName}
pt_br: Problema na definição do índice {IndexName}

source: Problem on directory of backup index definitions
pt_br: Problema no diretório de definição dos índices de backup

source: Problem on backup index definition {IndexName}
pt_br: Problema na definição dos ínidices de backup {IndexName}

source: UUID Conflict between {ObjType1}:{ObjName1} and {ObjType2}:{ObjName2}
pt_br: Conflito UUID entre {ObjType1}:{ObjName1} e {ObjType2}:{ObjName2}

source: Problem on field definition {FieldName} in {TableName} table
pt_br: Problema na definição do campo {FieldName} na tabela {TableName}

source: Problem on page address directory # {IndexPageAddressTable} in {IndexName} index
pt_br: Problema no diretório de endereços de páginas # {IndexPageAddressTable} no índice {IndexName}

source: Problem on page # {IndexPageNum} in {IndexName} index
pt_br: Problema na página # {IndexPageNum} no índice {IndexName}

source: Problem on {IndexName} index
pt_br: Problema no índice {IndexName}

source: Problem on cluster # {IndexClusterNum} in {IndexName} index
pt_br: Problema no grupo # {IndexClusterNum} no índice {IndexName}

source: Problem on cluster address directory # {IndexClusterAddressTable} in {IndexName} index
pt_br: Problema no diretório de endereços do grupo # {IndexClusterAddressTable} no índice {IndexName}

source: Problem on bit page # {BitPageNum} in cluster # {IndexClusterNum} in {IndexName} index
pt_br: Problema na página de bits # {BitPageNum} no grupo # {IndexClusterNum} no índice {IndexName}

source: Problem on directory of data table headers
pt_br: Problema no diretório dos cabeçalhos de tabelas

source: Problem in NULLS cluster of {IndexName} index
pt_br: Problema no grupo NULLS no índice {IndexName}

source: Problem on bit page # {BitPageNum} in NULLS cluster of {IndexName} index
pt_br: Problema na página de bits # {BitPageNum} no grupo NULLS do índice {IndexName}

source: Overlapping {ObjType} at offset {ObjAddr} with length {ObjLen} in data segment # {SegNum}
pt_br: Superposição de {ObjType} na posição {ObjAddr} de Comprimento {ObjLen} no segmento # {SegNum}

source: Overlapping Objects in data segment # {SegNum}
pt_br: Superposição de objetos no segmento de dados # {SegNum}

source: Table
pt_br: Tabela

source: Field
pt_br: Campo

source: Index
pt_br: Índice

source: Automatic Sequence Number
pt_br: Número de sequência automático

source: Relation
pt_br: Relação

source: Loading data tables
pt_br: Carregando tabelas de dados

source: Checking data table definitions
pt_br: Verificando as definiçãoes de tabelas de dados

source: Checking chained list of deleted table definitions
pt_br: Verificando a lista encadeada de definiçãoes de tabelas eliminadas

source: Checking index definitions
pt_br: Verificando as definiçãoes do índice

source: Checking chained list of deleted index definitions
pt_br: Verificando lista encadeada de definições de índices excluídos

source: Checking backup index definitions
pt_br: Verificando definições de índice de backup

source: Checking chained list of deleted backup index definitions
pt_br: Verificando a lista encadeada de definições do índice de backups excluídos

source: Checking relation definitions
pt_br: Verificando as definições de relações

source: Checking chained list of deleted relation definitions
pt_br: Verificando a lista encadeada de definições de relações eliminadas

source: Checking auto sequence number definitions
pt_br: Verificando as definições da numeração automática

source: Checking chained list of deleted auto sequence number definitions
pt_br: Verificando a lista encadeada de definições da numeração automática excluída

source: Checking data table headers
pt_br: Verificando cabeçalhos da tabela de dados

source: Checking chained list of deleted data table headers
pt_br: Verificando a lista encadeada de cabeçalhos da tabela de dados excluídos

source: Checking BLOBs in table {p1}
pt_br: Verificando os BLOBs na tabela {p1}

source: Checking list of deleted BLOBs in table {p1}
pt_br: Verificando a lista dos BLOBs excluídos na tabela {p1}

source: Checking records in table {p1}
pt_br: Verificando registros na tabela {p1}

source: Checking list of deleted records in table {p1}
pt_br: Verificando a lista de registros excluídos na tabela {p1}

source: Check bit tables for segment {SegNum}
pt_br: Verificando tabelas de bit para o segmento {SegNum}

source: Checking index pages on {p1}
pt_br: Verificando páginas de índice de {p1}

source: Checking index page addresses on {p1}
pt_br: Verificando páginas de indice de {p1}

source: Checking list of deleted index pages on {p1}
pt_br: Verificando lista de páginas de índice excluídas em {p1}

source: Checking clusters on {p1}
pt_br: Verificando grupos (clusters) em {p1}

source: Checking list of deleted clusters on {p1}
pt_br: Verificando a lista de grupos (clusters) excluídos em {p1}

source: on
pt_br: sobre

source: Keywords Index
pt_br: Índice de palabras chaves

source: B-tree Index
pt_br: Índice Árvore-B

source: Cluster Index
pt_br: Índice agrupado

source: Index
pt_br: Índice

source: Composite Index
pt_br: Índice composto

source: Scanning data
pt_br: Leitura de dados

source: Recovering records
pt_br: Recuperação de registros

source: Recovering BLOBs
pt_br: Recuperação dos BLOBs

source: (Table# {p1} out of {p2} tables)
pt_br: (Tabela# {p1} de {p2} tabelas)

source: Checking index {p1}
pt_br: Verificando índice {p1}

source: Object Index
pt_br: Índice do objeto

source: Loading data
pt_br: Carregando dados

source: Integrating journal: {curValue} of {maxValue} entries
pt_br: Integração de histórico: {curValue} de {maxValue} entradas

source: Sequential sorting on {TableName}: {curValue} of {maxValue} records
pt_br: Ordenação sequencial em {TableName}: {curValue} de {maxValue} registros

source: Sequential searching on {TableName}: {curValue} of {maxValue} records
pt_br: Pesquisa sequencial em {TableName}: {curValue} de {maxValue} registros

source: Exporting a selection of records: {curValue} of {maxValue} records
pt_br: Exportando uma seleção de registros: {curValue} de {maxValue} registros

source: Indexing calculation formulas: {curValue} of {maxValue} pages
pt_br: Indexando fórmulas de cálculo: {curValue} de {maxValue} páginas

source: Computing distinct indexed values: {curValue} of {maxValue} pages
pt_br: Calculando valores distintos indexados: {curValue} de {maxValue} páginas

source: Indexed sorting: {curValue} of {maxValue} keys
pt_br: Ordenamento indexado: {curValue} de {maxValue} chaves

source: Building of
pt_br: Criação de

source: Building index on one field: {curValue} of {maxValue} records
pt_br: Construindo índice em um campo: {curValue} de {maxValue} registros

source: Building full text index on one field: {curValue} of {maxValue} records
pt_br: Construindo índice de texto completo em um campo: {curValue} de {maxValue} registros

source: Building composite index: {curValue} of {maxValue} records
pt_br: Construindo índice composto: {curValue} de {maxValue} registros

source: Merging items
pt_br: Mesclando os elementos

source: Building selection
pt_br: Construindo a seleção

source: Generating index pages
pt_br: Gerando páginas de índice

source: Generating clusters
pt_br: Geração de páginas de índice

source: Generating clusters
pt_br: Geração de páginas de índice

source: Generating index clusters
pt_br: Geração de índices agrupados

source: Sequential sorting
pt_br: Ordenação sequencial

source: Sorting data
pt_br: Ordenação dos dados

source: Deleting address table: {curValue} of {maxValue} entries
pt_br: Excluindo a tabela de endereços: {curValue} de {maxValue} entradas

source: Flushing Data
pt_br: Escritura de dados

source: Deleting records: {curValue} of {maxValue}
pt_br: Exluindo registros: {curValue} de {maxValue}

source: Analyzing Log file
pt_br: Analisando arqivo de histórico

source: Selection to array: {curValue} of {maxValue}
pt_br: Seleção para array: {curValue} de {maxValue}

source: Array to selection: {curValue} of {maxValue}
pt_br: Array para seleção: {curValue} de {maxValue}

source: Indexing calculation formulas: {curValue} of {maxValue} keys
pt_br: Indexando fórmula de cálculo: {curValue} de {maxValue} chaves

source: Index searching: {curValue} of {maxValue} pages
pt_br: Pesquisa de índices: {curValue} de {maxValue} páginas

source: Index scanning: {curValue} of {maxValue} pages
pt_br: Rastreamento de índices: {curValue} de {maxValue} páginas

source: Computing statistics: {curValue} of {maxValue} records
pt_br: Calculando estatísticas: {curValue} de {maxValue} registros

source: Exporting {TableName} as SQL: {curValue} of {maxValue} records
pt_br: Exportando {TableName} como SQL: {curValue} de {maxValue} registros

source: Exporting database: {curValue} of {maxValue} tables
pt_br: Exportando do banco: {curValue} de {maxValue} tabelas

source: Cleaning destination folder...
pt_br: Limpando o conteúdo da pasta de destino...

source: Checking uniqueness
pt_br: Verificação da exclusividade

source: Checking primary keys for {TableName}: {curValue} of {maxValue} records
pt_br: Verificação de chaves primárias em {TableName}: {curValue} de {maxValue} registros

source: data segment header
pt_br: cabeçalho do segmento de dados

source: primary directory of bit table
pt_br: diretório primário da tabela de bits

source: secondary directory # {param2} of bit table
pt_br: diretório secundário # {param2} da tabela de bits
