Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DES.xlf
Languages: es

# ERR_dbmg_1188
source: Array cannot be saved
es: El array no puede guardarse

# ERR_dbmg_1189
source: Array cannot be loaded
es: El array no puede cargarse

# ERR_dbmg_1190
source: Sequence number header cannot be loaded
es: El encabezado de número de secuencia no puede cargarse

# ERR_dbmg_1191
source: Cannot select record
es: No es posible seleccionar el registro

# ERR_dbmg_1192
source: Record cannot be created
es: No es posible crear el registro

# ERR_dbmg_1193
source: Cannot complete selection to array in table {TableName} of database {BaseName}
es: No es posible completar selección a array en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1194
source: Cannot complete array to selection in table {TableName} of database {BaseName}
es: No es posible completar array a selección en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1195
source: Cannot complete sequential sort
es: No es posible realizar la ordenación secuencial

# ERR_dbmg_1196
source: Selection cannot be locked
es: No es posible bloquear la selección

# ERR_dbmg_1197
source: Index key cannot be loaded
es: No puede cargarse la llave del índice

# ERR_dbmg_1198
source: Index key cannot be saved
es: No puede guardarse la llave del índice

# ERR_dbmg_1199
source: Index key cannot be built
es: No puede construirse la llave del índice

# ERR_dbmg_1200
source: Query cannot be completed
es: No se puede completar la búsqueda

# ERR_dbmg_1201
source: Query cannot be analyzed
es: No se puede analizar la búsqueda

# ERR_dbmg_1202
source: Formula could not be processed on this column
es: No se pudo procesar la fórmula en esta columna

# ERR_dbmg_1203
source: Query could not be completed
es: No se pudo terminar la búsqueda

# ERR_dbmg_1204
source: Query could not be analyzed
es: No se pudo analizar la búsqueda

# ERR_dbmg_1205
source: Could not get all distinct values of table {TableName} of database {BaseName}
es: No se pudieron obtener todos los valores distintos de la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1206
source: Cannot build array of values in table {TableName} of database {BaseName}
es: No es posible construir arrays de valores de la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1207
source: Selection cannot be loaded
es: No se puede cargar la selección

# ERR_dbmg_1208
source: Cannot send data
es: No es posible enviar datos

# ERR_dbmg_1209
source: Cannot receive request reply
es: No es posible solicitud de respuesta

# ERR_dbmg_1210
source: Cannot send request
es: No es posible enviar solicitud

# ERR_dbmg_1211
source: Cannot create connection
es: No es posible crear conexión

# ERR_dbmg_1212
source: Index {IndexName} cannot be quickly created in database {BaseName}
es: El índice {IndexName} no puede crearse rápidamente en la base {BaseName}

# ERR_dbmg_1213
source: Cannot build distinct index keys
es: No es posible construir llaves de índices diferentes

# ERR_dbmg_1214
source: Selection cannot be sorted in table {TableName} of database {BaseName}
es: La selección no puede ordenarse en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1215
source: Address table cannot loaded
es: La tabla de la direcciones no puede cargarse

# ERR_dbmg_1216
source: Address table cannot modified
es: La tabla de la direcciones no puede modificarse

# ERR_dbmg_1217
source: Cannot allocate new entry into address table
es: No es posible asignar una nueva entrada a la tabla de direcciones

# ERR_dbmg_1218
source: Cannot allocate free entry from address table
es: No es posible asignar una entrada vacía de la tabla de direcciones

# ERR_dbmg_1219
source: Transaction temporary record cannot be saved
es: No se puede guardar el registro temporal de la transacción

# ERR_dbmg_1220
source: Transaction temporary blob cannot be saved
es: No se puede guardar el blob temporal de la transacción

# ERR_dbmg_1221
source: Transaction temporary record cannot be loaded
es: No se puede cargar el registro temporal de la transacción

# ERR_dbmg_1222
source: Transaction temporary blob cannot be loaded
es: No se puede cargar el blob temporal de la transacción

# ERR_dbmg_1223
source: Transaction cannot be started
es: No se puede iniciar la transacción

# ERR_dbmg_1224
source: Transaction cannot be commited
es: La transacción no puede ser validada

# ERR_dbmg_1225
source: Cannot get extra property
es: No es posible leer la propiedad adicional

# ERR_dbmg_1226
source: Cannot set extra property
es: No es posible escribir la propiedad adicional

# ERR_dbmg_1227
source: Table name is already used
es: El nombre de la tabla ya ha sido utilizado

# ERR_dbmg_1228
source: Cannot get list of NULL keys from index {IndexName}
es: No es posible leer la lista de llaves NULL del índice {IndexName}

# ERR_dbmg_1229
source: Cannot modify list of NULL keys of index {IndexName}
es: No es posible modificar la lista de llaves NULAS del índice {IndexName}

# ERR_dbmg_1230
source: Invalid key for index {IndexName}
es: Llave incorrecta para el índice {IndexName}

# ERR_dbmg_1231
source: Cannot set log file
es: No es posible escribir el archivo de historial

# ERR_dbmg_1232
source: Context is NULL
es: El contexto es NULL

# ERR_dbmg_1233
source: Database {BaseName} cannot be locked
es: La base {BaseName} no puede bloquearse

# ERR_dbmg_1234
source: Wrong field reference in record# {RecNum} of table: {TableName} of database: {BaseName}
es: Referencia de campo incorrecta en el registro# {RecNum} de la tabla: {TableName} de la base: {BaseName}

# ERR_dbmg_1235
source: Wrong field reference in table: {TableName} of database: {BaseName}
es: Referencia de campo incorrecta en la tabla: {TableName} de la base: {BaseName}

# ERR_dbmg_1236
source: Cannot read data from temporary transaction file
es: No es posible leer los datos del archivo de transacciones temporales

# ERR_dbmg_1237
source: Cartesian Product failed
es: Falló el producto cartesiano

# ERR_dbmg_1238
source: Cannot merge selections
es: No es posible fusionar selecciones

# ERR_dbmg_1239
source: The format of the {BaseName} database cannot be upgraded in read only mode
es: El formato de la base {BaseName} no puede actualizarse en modo lectura

# ERR_dbmg_1240
source: Wrong Header
es: Encabezado incorrecto

# ERR_dbmg_1241
source: Wrong CheckSum
es: Suma de verificación incorrecta

# ERR_dbmg_1243
source: Cannot load data tables of database: {BaseName}
es: No es posible cargar tablas de datos de la base: {BaseName}

# ERR_dbmg_1244
source: The list of foreign key constraints is not empty for table: {TableName} of database: {BaseName}
es: La lista de restricciones de llaves foráneas no está vacía para la tabla: {TableName} de la base: {BaseName}

# ERR_dbmg_1245
source: Address entry is not empty
es: La entrada de dirección no está vacía

# ERR_dbmg_1246
source: Cannot pre-allocate address
es: No es posible pre-asignar direcciones

# ERR_dbmg_1247
source: Cannot update new record in table {TableName} of database {BaseName}
es: No es posible actualizar el nuevo registro en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1248
source: Cannot save new record in table {TableName} of database {BaseName}
es: No es posible guardar el nuevo registro en la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1249
source: Cannot save subrecord
es: No es posible guardar el subregistro

# ERR_dbmg_1250
source: Cannot save record
es: No es posible guardar el registro

# ERR_dbmg_1251
source: Cannot lock structure object definition
es: No es posible bloquear la definición de objeto de estructura

# ERR_dbmg_1252
source: Cannot unlock structure object definition
es: No es posible desbloquear la definición de objeto de estructura

# ERR_dbmg_1253
source: Invalid relation number
es: Número inválido de relación

# ERR_dbmg_1254
source: Circular Reference in records address table of table {TableName} of database {BaseName}
es: Referencia circular de la tabla de direcciones en los registros de la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1255
source: Circular Reference in blobs address table of table {TableName} of database {BaseName}
es: Referencia circular de la tabla de direcciones en los BLOBs de la tabla {TableName} de la base {BaseName}

# ERR_dbmg_1256
source: Duplicated Schema Name in database {BaseName}
es: Nombre de esquema duplicado en la base {BaseName}

# ERR_dbmg_1257
source: Schema cannot be saved in database {BaseName}
es: No se puede guardar el esquema en la base {BaseName}

# ERR_dbmg_1258
source: Schema cannot be deleted in database {BaseName}
es: No se puede eliminar el esquema en la base {BaseName}

# ERR_dbmg_1259
source: Schema cannot be renamed in database {BaseName}
es: No se puede renombrar el esquema en la base {BaseName}

# ERR_dbmg_1260
source: Selected log file is too recent for database {BaseName}
es: El historial seleccionado es muy reciente para la base {BaseName}

# ERR_dbmg_1261
source: Selected log file is too old for database {BaseName}
es: El historial seleccionado es muy antiguo para la base {BaseName}

# ERR_dbmg_1262
source: Some DataTables do not have matching table definitions for database {BaseName}
es: Algunas tablas de datos no tienen una tabla de definiciones correspondientes para la base {BaseName}

# ERR_dbmg_1263
source: Given stamp does not match current one for record# {RecNum} of table {TableName}
es: La estampa dada no corresponde a la actual del registro# {RecNum} de la tabla {TableName}

# ERR_dbmg_1264
source: A primary key is needed and missing in table {TableName}
es: Se necesita una llave primaria, falta en la tabla {TableName}

# ERR_dbmg_1265
source: Invalid field
es: Campo inválido

# ERR_dbmg_1266
source: Unknown field type (this version of 4D is perhaps too old)
es: Tipo de campo desconocido (quizás esta versión de 4D es muy antigua)

# ERR_dbmg_1267
source: Stack Overflow
es: Desbordamiento de pila

# ERR_dbmg_1268
source: DataTable cannot be regenerated for database {BaseName}
es: La tabla de datos no puede regenerarse para la base {BaseName}

# ERR_dbmg_1269
source: DataTable cannot be found
es: No se encuentra la tabla de datos

# ERR_dbmg_1270
source: Missing structure could not be rebuild
es: La estructura faltante no puede reconstruirse

# ERR_dbmg_1271
source: Invalid REST request handler
es: Manejador de petición REST inválido

# ERR_dbmg_1272
source: Some records are still locked in table {tableName} in database {BaseName}
es: Algunos registros de la tabla {tableName} en la base {BaseName} siguen bloqueados

# ERR_dbmg_1273
source: Cannot drop table {TableName} in database {BaseName}
es: No se puede borrar la tabla {TableName} en la base {BaseName}

# ERR_dbmg_1274
source: The current journal file of database {BaseName} is not available. For data security reasons, write operations are stopped. Please contact your administrator as soon as possible.
es: El archivo de historial actual de la base {BaseName} no está disponible. Por razones de seguridad las operaciones de escritura están detenidas. Por favor contacte su administrador lo más pronto posible.

# ERR_dbmg_1275
source: "(" is missing at the beginning of the Javascript statement in this query.
es: Falta "(" al inicio de la instrucción Javascript en esta petición.

# ERR_dbmg_1276
source: Datastream has an invalid header.
es: El flujo de datos tiene un encabezado inválido.

# ERR_dbmg_1277
source: The database journal integration failed at entry# {Param1} (operation id {Param2}).
es: La integración del historial de la base falló en la entrada# {Param1} (operación número {Param2}).

# ERR_dbmg_1278
source: Javascript code not allowed in the query.
es: No se permite código Javascript en la petición.

# ERR_dbmg_1279
source: The query placeholder {Param1} is missing or null.
es: El contenedor de búsqueda {Param1} falta o es nulo

# ERR_dbmg_1280
source: The query placeholder {Param1} is not a valid type.
es: El tipo del contenedor de búsqueda {Param1} es inválido.

# ERR_dbmg_1281
source: Table {TableName} needs a primary key in order to be logged.
es: La tabla {TableName} necesita una llave primaria para registrarla en el historial.

# ERR_dbmg_1282
source: Cannot find any record with that primary key in table {TableName}.
es: No se puede encontrar ningún registro con esa llave primaria en la tabla {TableName}.

# ERR_dbmg_1283
source: A primary key definition is missing for table {TableName}.
es: No hay una definición de llave primaria para la tabla {TableName}.

# ERR_dbmg_1284
source: The given primary key of table {TableName} is malformed.
es: La llave primaria de la tabla {TableName} está malformada.

# ERR_dbmg_1285
source: Non-unique primary key found in table {TableName}.
es: La llave primaria en la tabla {TableName} no es única.

# ERR_dbmg_1286
source: Null primary key found in table {TableName}.
es: Llave primaria nula encontrada en la tabla {TableName}.

# ERR_dbmg_1287
source: Log file was created with an older version of the database {BaseName}
es: El historial se creó con una versión anterior de la base de datos {BaseName}

# ERR_dbmg_1288
source: Constraints on database {BaseName} cannot be disabled while journaling is active.
es: Las restricciones en la base de datos {BaseName} no se pueden desactivar mientras el historial esté activo.

# ERR_dbmg_1300
source: Invalid Selection Type
es: Tipo de selección inválido

# ERR_dbmg_1301
source: Array is too big
es: Array es demasiado grande

# ERR_dbmg_1302
source: Array size does not match
es: Tamaño de Array no corresponde

# ERR_dbmg_1303
source: Invalid Selection ID
es: ID de selección inválido

# ERR_dbmg_1304
source: Invalid Selection Part
es: Parte de selección inválido

# ERR_dbmg_1550
source: Script statement is empty
es: Instrucción de script vacía

# ERR_dbmg_1551
source: Script kind is missing
es: Falta el tipo de script

# ERR_dbmg_1552
source: Script kind is unknown
es: Tipo de script desconocida

# ERR_dbmg_1553
source: Wrong permission reference
es: Referencia de permiso errada

# ERR_dbmg_1555
source: Users and Groups directory is missing
es: Falta el directorio de usuarios y grupos

# ERR_dbmg_1563
source: Method name is missing
es: Falta el nombre del método

# ERR_dbmg_1564
source: Method type is invalid
es: Tipo de método inválido

# ERR_dbmg_1565
source: Method definition is invalid
es: Definición del método inválida

# ERR_dbmg_1566
source: Method statement is empty
es: Instrucción del método vacía

# ERR_dbmg_1567
source: Method parameter name is invalid
es: Nombre del parámetro del método inválido

# ERR_dbmg_1570
source: Entity fails validation
es: La entidad falla la validación

# ERR_dbmg_1576
source: The relation based on "{Param1}" is not N-to-1
es: La relación basada en "{Param1}" no es N a 1

# ERR_dbmg_1577
source: The relation based on "{Param1}" is not 1-to-N
es: La relación basada en "{Param1}" no es 1 a N

# ERR_dbmg_1578
source: The {Param1} attribute is not a relation attribute
es: El atributo {Param1} no es un atributo de relación

# ERR_dbmg_1579
source: "{Param1}" is not a valid relation
es: "{Param1}" no es una relación válida

# ERR_dbmg_1580
source: The relation path is empty
es: La ruta de la relación está vacía

# ERR_dbmg_1581
source: Cannot resolve "{Param1}" as a relation path
es: No es posible resolver "{Param1}" como una ruta de relación

# ERR_dbmg_1582
source: Event's kind is missing or invalid
es: El tipo del evento falta o es inválido

# ERR_dbmg_1583
source: Event's method is missing or invalid
es: El método del evento falta o es inválido

# ERR_dbmg_1584
source: Alias attributes can only return scalar values
es: Los atributos alias sólo pueden devolver los valores escalares

# ERR_dbmg_1585
source: An error occurred during JavaScript execution
es: Ocurrió un error durante la ejecución JavaScript

# ERR_dbmg_1586
source: Not a valid entity collection
es: Esta no es una colección de entidades válida

# ERR_dbmg_1587
source: The entity collections come from incompatible datastore classes
es: Las colecciones de entidades provienen de clases de datos incompatibles

# ERR_dbmg_1588
source: The "{Param1}" attribute is duplicated
es: El atributo "{Param1}" está duplicado

# ERR_dbmg_1589
source: The "{Param1}" attribute is from another datastore class
es: El atributo "{Param1}" es de otra clase de datos

# ERR_dbmg_1594
source: The "{Param1}" attribute in the "{EntityModelName}" datastore class cannot be used for sorting
es: El atributo "{Param1}" de la clase "{EntityModelName}" no se puede utilizar para ordenar

# ERR_dbmg_1595
source: The "{Param1}" remote datastore class cannot be created locally
es: La clase "{Param1}" no se puede crear localmente

# ERR_dbmg_1596
source: The command "addRemoteStore" or "openRemoteStore" cannot be used in that context
es: Los comandos "addRemoteStore" o " openRemoteStore" no se pueden utilizar en ese contexto

# ERR_dbmg_1610
source: A remote request to host: "{Param1}" has failed
es: Una solicitud remota al host: "{Param1}" falló

# ERR_dbmg_1611
source: You must log into the Admin group to obtain information regarding your project.
es: Debe iniciar sesión en el grupo de administración para obtener información respecto a su proyecto.

# ERR_dbmg_1806
source: URL is not well formed
es: El URL no está bien formado

# ERR_dbmg_1807
source: Received a '&' and was expecting a '?' in the URL
es: Se recibió un '&' y se esperaba un '?' en el URL

# ERR_dbmg_1808
source: Opening single quote does not have a matching closing one in the URL
es: Falta el apóstrofe de cierre correspondiente en el URL

# ERR_dbmg_1809
source: Opening double quote does not have a matching closing one in the URL
es: Falta la comilla doble de cierre correspondiente en el URL

# ERR_dbmg_1811
source: "{Param1}" is an unknown REST keyword
es: "{Param1}" es una palabra clave REST desconocida

# ERR_dbmg_1812
source: "{Param1}" is an unknown REST method
es: "{Param1}" es un método REST desconocido

# ERR_dbmg_1813
source: "{Param1}" REST method is not applicable here
es: "{Param1}" El método REST no es aplicable aquí

# ERR_dbmg_1815
source: "$subentityset" cannot be applied to the REST request
es: "$subentityset" no se puede aplicar a la solicitud REST

# ERR_dbmg_1816
source: At least one attribute must be specified
es: Se debe especificar al menos un atributo

# ERR_dbmg_1817
source: "{Param1}" is not a valid compute action
es: "{Param1}" no es una acción válida de cálculo

# ERR_dbmg_1818
source: "{Param1}" is not a valid logical operator
es: "{Param1}" n’est pas un opérateur logique valide

# ERR_dbmg_1819
source: Second collection reference is missing
es: La segunda referencia de la colección falta

# ERR_dbmg_1820
source: "{Param1}" is not a valid collection reference
es: "{Param1}" no es una referencia válida de colección

# ERR_dbmg_1821
source: "{Param1}" is not a valid transaction command
es: "{Param1}" no es uncomando válido de transacción

# ERR_dbmg_1822
source: REST login failed
es: Error en la conexión REST

# ERR_dbmg_1823
source: Maximum number of sessions has been reached
es: Se ha alcanzado el número máximo de sesiones

# ERR_dbmg_3000
source: The replication database is not valid
es: La base de datos de replicación no es válida

# ERR_dbmg_3001
source: The replication database is missing a table and is not valid
es: Falta una tabla en la base de datos de replicación y no es válida

source: Fully wrong
es: Totalmente incorrecto

source: Partially wrong
es: Parcialmente incorrecto

source: Invalid checksum
es: Suma de verificación incorrecta

source: Invalid header
es: Encabezado incorrecto

source: Invalid header version
es: Versión de encabezado incorrecta

source: Data segment directory header is invalid
es: El encabezado del directorio del segmento de datos es incorrecto

source: Data segment end of file is invalid
es: El final del archivo del segmento de datos es incorrecto

source: Address of primary directory of bit table is invalid
es: La dirección del directorio primario de la tabla de bits es incorrecta

source: Primary directory of bit table is invalid
es: El directorio primario de la tabla de bits es incorrecto

source: Address of secondary directory of bit table is invalid
es: La dirección del directorio secundario de la tabla de bits es incorrecta

source: Secondary directory of bit table is invalid
es: El directorio secundario de la tabla de bits es incorrecto

source: Address of bit table is invalid
es: La dirección de la tabla de bits es incorrecta

source: Bit table is invalid
es: La tabla de bits es incorrecta

source: Cannot open data segment
es: No es posible abrir el segmento de datos

source: Directory of data tables is invalid
es: El directorio de tablas de datos es incorrecto

source: Number of records is invalid
es: El número de registros es incorrecto

source: Address of primary directory of record addresses is invalid
es: La dirección del directorio primario de direcciones de registros es incorrecta

source: List of deleted records is invalid
es: La lista de registros eliminados es incorrecta

source: Number of BLOBs is invalid
es: El número de BLOBs es incorrecto

source: Address of primary directory of BLOBs addresses is invalid
es: La dirección del directorio primario de direcciones de BLOBs es incorrecta

source: List of deleted BLOBs is invalid
es: La lista de BLOBs eliminados es incorrecta

source: Address of record address directory is invalid
es: La dirección del directorio de direcciones de registros es incorrecta

source: Address of BLOB address directory is invalid
es: La dirección del directorio de direcciones del BLOB es incorrecta

source: Tag header of record address directory is invalid
es: El encabezado del marcador del directorio de direcciones de registros es incorrecto

source: Tag header of BLOB address directory is invalid
es: El encabezado del marcador del directorio de direcciones del BLOB es incorrecto

source: Cannot read data for record address directory
es: No es posible leer los datos del directorio de direcciones de los registros

source: Cannot read data for BLOB address directory
es: No es posible leer los datos del directorio de direcciones del BLOB

source: Checksum of record address directory is invalid
es: La suma de verificación del directorio de direcciones de registros es incorrecta

source: Checksum of BLOB address directory is invalid
es: La suma de verificación del directorio de direcciones de los BLOBs es incorrecta

source: Length of address directory is invalid
es: La longitud del directorio de direcciones es incorrecta

source: BLOB address is invalid
es: La dirección del BLOB es incorrecta

source: Cannot read BLOB data
es: Los datos del BLOB no pueden ser leídos

source: BLOB checksum is invalid
es: La suma de verificación del BLOB es incorrecta

source: BLOB tag header is invalid
es: El encabezado del marcador del BLOB es incorrecto

source: BLOB length is invalid
es: La longitud del BLOB es incorrecta

source: BLOB length does not match the one in the address directory
es: La longitud del BLOB no corresponde a la del directorio de direcciones

source: Record address is invalid
es: La dirección del registro es incorrecta

source: Cannot read record data
es: No es posible leer los datos de los registros

source: Record checksum is invalid
es: La suma de verificación del registro es incorrecta

source: Record length does not match the one in the address directory
es: La longitud del registro no corresponde a la del directorio de direcciones

source: Record length is invalid
es: La longitud del registro es incorrecta

source: Record tag header is invalid
es: El encabezado del marcador del registro es incorrecto

source: Number of fields invalid
es: Número de campos incorrecto

source: Invalid data field type
es: Tipo de campo incorrecto

source: Invalid data field offset in record
es: Offset de campo incorrecto en el registo

source: Invalid data field length
es: Longitud de campo incorrecta
