Repository: StephaneH/core-Components
Catalog: DB4D/Resources/*.lproj/DB4DDE.xlf
Languages: de

# ERR_dbmg_1001
source: No column to import in table {TableName}
de: Keine Spalte für den Import in Tabelle {TableName}

# ERR_dbmg_1002
source: Wrong table to import
de: Falsche Tabelle für den Import

# ERR_dbmg_1003
source: No column to export in table {TableName}
de: Keine Spalte für den Export für Tabelle {TableName}

# ERR_dbmg_1004
source: Wrong table to export
de: Falsche Tabelle für den Export

# ERR_dbmg_1006
source: Cannot save structure of database {BaseName}
de: Struktur für Anwendung {BaseName} kann nicht gesichert werden

# ERR_dbmg_1007
source: Cannot create data file of database: {BaseName}
de: Daten für Datenbank: {BaseName} können nicht erzeugt werden

# ERR_dbmg_1008
source: Wrong data segment in database {BaseName}
de: Falsches Datensegment für Datenbank {BaseName}

# ERR_dbmg_1009
source: Memory is full
de: Hauptspeicher reicht nicht aus

# ERR_dbmg_1010
source: Cannot load a table definition of database {BaseName}
de: Tabellendefinition für Datenbank {BaseName} kann nicht geladen werden

# ERR_dbmg_1011
source: Cannot open data file of database {BaseName}
de: Daten für Datenbank {BaseName} kann nicht geöffnet werden

# ERR_dbmg_1012
source: Data segment is full in database: {BaseName}
de: Datensegment für Datenbank: {BaseName} ist voll

# ERR_dbmg_1013
source: Cannot save data segment in database {BaseName}
de: Datensegement für Datenbank {BaseName} kann nicht gespeichert werden

# ERR_dbmg_1014
source: Cannot read data segment of database {BaseName}
de: Datensegment für Datenbank {BaseName} kann nicht gelesen werden

# ERR_dbmg_1015
source: Wrong database header in database {BaseName}
de: Ungültiger Datenbank-Header in Datenbank {BaseName}

# ERR_dbmg_1016
source: Cannot create table in database {BaseName}
de: Tabelle in Datenbank {BaseName} kann nicht erzeugt werden

# ERR_dbmg_1017
source: Cannot read index list of database {BaseName}
de: Indexliste in Datenbank {BaseName} kann nicht gelesen werden

# ERR_dbmg_1018
source: Cannot write index list of database {BaseName}
de: Indexliste in Datenbank {BaseName} kann nicht geschrieben werden

# ERR_dbmg_1019
source: Wrong table reference in database {BaseName}
de: Ungültige Tabellenreferenz in Datenbank {BaseName}

# ERR_dbmg_1020
source: Wrong field reference in database {BaseName}
de: Ungültige Feldreferenz in Datenbank {BaseName}

# ERR_dbmg_1021
source: Invalid index type in database {BaseName}
de: Ungültiger Indextyp in Datenbank {BaseName}

# ERR_dbmg_1022
source: Invalid field name in table {TableName} of database {BaseName}
de: Ungültiger Feldername in Tabelle {TableName} in Datenbank {BaseName}

# ERR_dbmg_1023
source: Invalid database name
de: Ungültiger Datenbankname

# ERR_dbmg_1024
source: Cannot open structure of database {BaseName}
de: Struktur für Datenbank {BaseName} kann nicht geöffnet werden

# ERR_dbmg_1025
source: Cannot create structure of database {BaseName}
de: Struktur für Datenbank {BaseName} kann nicht erzeugt werden

# ERR_dbmg_1026
source: Cannot load bit selection of database {BaseName}
de: Bit Selection für Datenbank {BaseName} kann nicht geladen werden

# ERR_dbmg_1027
source: Cannot load set of database {BaseName}
de: Menge für Datenbank {BaseName} kann nicht geladen werden

# ERR_dbmg_1028
source: Cannot modify set of database {BaseName}
de: Menge für Datenbank {BaseName} kann nicht geändert werden

# ERR_dbmg_1029
source: Cannot save set of database {BaseName}
de: Menge für Datenbank {BaseName} kann nicht gespeichert werden

# ERR_dbmg_1030
source: Cannot save BLOB {BlobNum} in table {TableName} of database {BaseName}
de: BLOB {BlobNum} in Tabelle {TableName} in Datenbank {BaseName} kann nicht gesichert werden

# ERR_dbmg_1031
source: Cannot load BLOB {BlobNum} in table {TableName} of database {BaseName}
de: BLOB {BlobNum} in Tabelle {TableName} in Datenbank {BaseName} kann nicht geladen werden

# ERR_dbmg_1032
source: Cannot allocate BLOB {BlobNum} in table {TableName} of database {BaseName}
de: Speicherplatz für BLOB {BlobNum} in Tabelle {TableName} in Datenbank {BaseName} kann nicht bereitgestellt werden

# ERR_dbmg_1033
source: Cannot load data bit table of database {BaseName}
de: Bit-Tabelle für Datenbank {BaseName} kann nicht geladen werden

# ERR_dbmg_1034
source: Cannot save data bit table of database {BaseName}
de: Bit-Tabelle für Datenbank {BaseName} kann nicht gespeichert werden

# ERR_dbmg_1035
source: Cannot load table of data bit tables of database {BaseName}
de: Tabelle der Bit-Tabellen für Datenbank {BaseName} kann nicht geladen werden

# ERR_dbmg_1036
source: Cannot save table of data bit tables in database {BaseName}
de: Tabelle der Bit-Tabellen für Datenbank {BaseName} kann nicht gespeichert werden

# ERR_dbmg_1037
source: Cannot close data segment of database {BaseName}
de: Datensegment für Datenbank {BaseName} kann nicht geschlossen werden

# ERR_dbmg_1038
source: Cannot delete data segment of database {BaseName}
de: Datensegment für Datenbank {BaseName} kann nicht gelöscht werden

# ERR_dbmg_1039
source: Cannot open data segment of database {BaseName}
de: Datensegment für Datenbank {BaseName} kann nicht geöffnet werden

# ERR_dbmg_1040
source: Cannot create data segment of database {BaseName}
de: Datensegment für Datenbank {BaseName} kann nicht erzeugt werden

# ERR_dbmg_1041
source: Cannot allocate space in data segment
de: Es kann kein Speicherplatz im Datensegment bereitgestellt werden

# ERR_dbmg_1042
source: Cannot free space in data segment of database {BaseName}
de: Speicherplatz in Datensegment der Datenbank {BaseName} kann nicht freigegeben werden

# ERR_dbmg_1043
source: File is write protected
de: Datei ist schreibgeschützt

# ERR_dbmg_1044
source: Cannot access field in record {RecNum} in table {TableName} of database {BaseName}
de: Feld in Datensatz {RecNum} in Tabelle {TableName} in Datenbank {BaseName} kann nicht angesprochen werden

# ERR_dbmg_1045
source: Field definition code is missing in record {RecNum} in table {TableName} of database {BaseName}
de: Felddefinition fehlt: Datensatz {RecNum} in Tabelle {TableName} in Datenbank {BaseName}

# ERR_dbmg_1046
source: Cannot save record {RecNum} in table {TableName} of database {BaseName}
de: Datensatz {RecNum} in Tabelle {TableName} in Datenbank {BaseName} kann nicht gespeichert werden

# ERR_dbmg_1047
source: Cannot load record {RecNum} in table {TableName} of database {BaseName}
de: Datensatz {RecNum} in Tabelle {TableName} in Datenbank {BaseName} kann nicht geladen werden

# ERR_dbmg_1048
source: Cannot allocate record in table {TableName} of database {BaseName}
de: Speicherplatz für Datensatz {RecNum} in Tabelle {TableName} in Datenbank {BaseName} kann nicht bereitgestellt werden

# ERR_dbmg_1049
source: Cannot update record {RecNum} in table {TableName} of database {BaseName}
de: Datensatz {RecNum} in Tabelle {TableName} in Datenbank {BaseName} kann nicht geändert werden

# ERR_dbmg_1050
source: Wrong header for record {RecNum} in table {TableName} of database {BaseName}
de: Ungültiger Header für Datensatz {RecNum} in Tabelle {TableName} in Datenbank {BaseName}

# ERR_dbmg_1051
source: Cannot save definition of table {TableName} of database {BaseName}
de: Definition der Tabelle {TableName} in Datenbank {BaseName} kann nicht gespeichert werden

# ERR_dbmg_1052
source: Cannot update definition of table {TableName} of database {BaseName}
de: Definition der Tabelle {TableName} in Datenbank {BaseName} kann nicht geändert werden

# ERR_dbmg_1053
source: Field name already exists
de: Feldname existiert bereits

# ERR_dbmg_1055
source: Cannot update index values while saving a record in table {TableName} of database {BaseName}
de: Beim Speichern eines Datensatzes in {TableName} in Datenbank {BaseName} können die Indexwerte nicht aktualisiert werden

# ERR_dbmg_1056
source: Cannot update BLOBs while saving a record in table {TableName} of database {BaseName}
de: Beim Speichern eines Datensatzes in {TableName} in Datenbank {BaseName} können die BLOBs nicht aktualisiert werden

# ERR_dbmg_1057
source: Cannot delete BLOBs while saving or deleting a record in table {TableName} of database {BaseName}
de: Beim Speichern oder Löschen eines Datensatzes in {TableName} in Datenbank {BaseName} können die BLOBs nicht gelöscht werden

# ERR_dbmg_1058
source: Cannot add field in table {TableName} of database {BaseName}
de: Feld für Tabelle {TableName} in Datenbank {BaseName} kann nicht hinzugefügt werden

# ERR_dbmg_1059
source: Cannot allocate table in memory
de: Speicherplatz für Tabelle kann nicht bereitgestellt werden

# ERR_dbmg_1061
source: Cannot allocate record in memory
de: Speicherplatz für Datensatz kann nicht bereitgestellt werden

# ERR_dbmg_1062
source: Cannot completely delete table {TableName} of database {BaseName}
de: Tabelle {TableName} in Datenbank {BaseName} kann nicht vollständig gelöscht werden

# ERR_dbmg_1063
source: Cannot lock record {RecNum} in table {TableName} of database {BaseName}
de: Datensatz {RecNum} in {TableName} in Datenbank {BaseName} kann nicht gesperrt werden

# ERR_dbmg_1064
source: Cannot unlock record {RecNum} in table {TableName} of database {BaseName}
de: Datensatz {RecNum} in {TableName} in Datenbank {BaseName} kann nicht freigegeben werden

# ERR_dbmg_1065
source: Cannot delete record {RecNum} in table {TableName} of database {BaseName}
de: Datensatz {RecNum} in {TableName} in Datenbank {BaseName} kann nicht gelöscht werden

# ERR_dbmg_1066
source: Record {RecNum} is locked in table {TableName} of database {BaseName}
de: Datensatz {RecNum} in {TableName} in Datenbank {BaseName} ist gesperrt

# ERR_dbmg_1067
source: Sequential search could not be completed in table {TableName} of database {BaseName}
de: Sequentielle Suche konnte für {TableName} in Datenbank {BaseName} nicht ausgeführt werden

# ERR_dbmg_1068
source: Cannot save header for table {TableName} of database {BaseName}
de: Header für Tabelle {TableName} in Datenbank {BaseName} konnte nicht gesichert werden

# ERR_dbmg_1069
source: Cannot import data in table {TableName} of database {BaseName}
de: Import für Tabelle {TableName} in Datenbank {BaseName} nicht möglich

# ERR_dbmg_1070
source: Cannot load index header of database {BaseName}
de: Indexheader für Datenbank {BaseName} kann nicht geladen werden

# ERR_dbmg_1071
source: Cannot save header for index {IndexName} of database {BaseName}
de: Indexheader für Datenbank {BaseName} kann nicht gespeichert werden

# ERR_dbmg_1072
source: Cannot get page address for index {IndexName} of database {BaseName}
de: Seitenadressen für Index {IndexName} in Datenbank {BaseName} kann nicht geladen werden

# ERR_dbmg_1073
source: Cannot set page address for index {IndexName} of database {BaseName}
de: Seitenadressen für Index {IndexName} in Datenbank {BaseName} kann nicht gespeichert werden

# ERR_dbmg_1074
source: Cannot drop index {IndexName} of database {BaseName}
de: Index {IndexName} in Datenbank {BaseName} kann nicht gelöscht werden

# ERR_dbmg_1075
source: Cannot sort index {IndexName} of database {BaseName}
de: Sortierung auf Index {IndexName} in Datenbank {BaseName} nicht möglich

# ERR_dbmg_1076
source: Cannot load page for index {IndexName} of database {BaseName}
de: Seite für Index {IndexName} in Datenbank {BaseName} kann nicht geladen werden

# ERR_dbmg_1077
source: Cannot save page for index {IndexName} of database {BaseName}
de: Seite für Index {IndexName} in Datenbank {BaseName} kann nicht gespeichert werden

# ERR_dbmg_1078
source: Cannot insert key into index {IndexName} of database {BaseName}
de: Eintrag in Index {IndexName} in Datenbank {BaseName} kann nicht hinzugefügt werden

# ERR_dbmg_1079
source: Cannot delete key from index {IndexName} of database {BaseName}
de: Eintrag in index {IndexName} in Datenbank {BaseName} kann nicht gelöscht werden

# ERR_dbmg_1080
source: Cannot completely delete index {IndexName} of database {BaseName}
de: Vollständiges Löschen von index {IndexName} in Datenbank {BaseName} nicht möglich

# ERR_dbmg_1081
source: Cannot complete scan on index {IndexName} of database {BaseName}
de: Vollständiger Scan des Index {IndexName} in Datenbank {BaseName} nicht möglich

# ERR_dbmg_1082
source: Cannot complete sort of index {IndexName} of database {BaseName}
de: Vollständige Sortierung nach index {IndexName} in Datenbank {BaseName} nicht möglich

# ERR_dbmg_1083
source: Cannot insert key into page of index {IndexName} of database {BaseName}
de: Eintrag in Indexseite von {IndexName} in Datenbank {BaseName} kann nicht hinzugefügt werden

# ERR_dbmg_1084
source: Cannot delete key from page of index {IndexName} of database {BaseName}
de: Eintrag in Indexseite von {IndexName} in Datenbank {BaseName} kann nicht gelöscht werden

# ERR_dbmg_1085
source: Cannot load index cluster of database {BaseName}
de: Cluster Index in Datenbank {BaseName} kann nicht geladen werden

# ERR_dbmg_1086
source: Cannot add to index cluster of database {BaseName}
de: Hinzufügen zu Indexcluster in Datenbank {BaseName} nicht möglich

# ERR_dbmg_1087
source: Cannot delete from index cluster of database {BaseName}
de: Löschen von Indexcluster in Datenbank {BaseName} nicht möglich

# ERR_dbmg_1088
source: Index {IndexName} is invalid or missing
de: Index {IndexName} ist ungültig oder fehlt

# ERR_dbmg_1090
source: SQL token not found (Obsolete)
de: SQL Token nicht gefunden (Obsolete)

# ERR_dbmg_1091
source: Not implemented
de: Nicht implementiert

# ERR_dbmg_1092
source: Cannot register code
de: Code kann nicht registriert werden

# ERR_dbmg_1093
source: Operation in progress cancelled by user
de: Operation von Anwender abgebrochen

# ERR_dbmg_1094
source: Transaction conflict
de: Transaktionskonflikt

# ERR_dbmg_1095
source: Invalid table name in database {BaseName}
de: Ungültiger Tabellenname in Datenbank {BaseName}

# ERR_dbmg_1096
source: Table {TableName} is locked in database {BaseName}
de: Tabelle {TableName} in Datenbank {BaseName} ist gesperrt

# ERR_dbmg_1097
source: Database {BaseName} is locked
de: Datenbank {BaseName} ist gesperrt

# ERR_dbmg_1098
source: Data address is invalid in database {BaseName}
de: Ungültige Datenadresse in Datenbank {BaseName}

# ERR_dbmg_1099
source: Record is empty
de: Datensatz ist leer

# ERR_dbmg_1100
source: Wrong source field
de: Ungültiges Quellfeld

# ERR_dbmg_1101
source: Wrong destination field
de: Ungültiges Zielfeld

# ERR_dbmg_1102
source: Invalid relation name
de: Ungültiger Verknüpfungsname

# ERR_dbmg_1103
source: Field types do not match
de: Feldtypen stimmen nicht überein

# ERR_dbmg_1104
source: Relation is empty
de: Verknüpfung ist leer

# ERR_dbmg_1105
source: Cannot load relations list from database {BaseName}
de: Verknüpfungsliste von Datenbank {BaseName} kann nicht geladen werden

# ERR_dbmg_1106
source: Cannot save relations list into database {BaseName}
de: Verknüpfungsliste von Datenbank {BaseName} kann nicht gespeichert werden

# ERR_dbmg_1107
source: Query and lock not completed; at least one record locked somewhere else
de: Suche und Sperre nicht erfolgreich, mindestens ein Datensatz ist bereits gesperrt

# ERR_dbmg_1108
source: Invalid record
de: Ungültiger Datensatz

# ERR_dbmg_1109
source: Wrong record ID
de: Ungültige Datensatz-ID

# ERR_dbmg_1110
source: Relation already exists in database {BaseName}
de: Verknüpfung existiert bereits in Datenbank {BaseName}

# ERR_dbmg_1111
source: Index already exists in database {BaseName}
de: Index existiert bereits in Datenbank {BaseName}

# ERR_dbmg_1112
source: Wrong comparison operator
de: Ungültiger Vergleichsoperator

# ERR_dbmg_1113
source: End of data buffer
de: Ende des Datenbuffers

# ERR_dbmg_1114
source: Wrong DB4D version number
de: Ungültige DB4D Versionsnummer

# ERR_dbmg_1115
source: Duplicated key
de: Doppelter Schlüssel (nicht einmalig)

# ERR_dbmg_1116
source: Mandatory field is Null in record {RecNum} in table {TableName}
de: Zwingendes Feld ist NULL in Datensatz {RecNum} in Tabelle {TableName}

# ERR_dbmg_1117
source: Cannot set field to mandatory for table {TableName}
de: Feld in Tabelle {TableName} kann nicht auf zwingend gesetzt werden

# ERR_dbmg_1118
source: Cannot get exclusive access to table {TableName}
de: Exklusiver Zugriff auf Tabelle {TableName} nicht möglich

# ERR_dbmg_1119
source: Cannot check referential integrity of table {TableName}
de: Referentielle Integritätsprüfung für Tabelle {TableName} nicht möglich

# ERR_dbmg_1120
source: Reference integrity: some foreign keys still exist matching primary key on record {RecNum} in table {TableName}
de: Referentielle Integritätsprüfung: einige Fremdschlüssel entsprechen immer noch dem Primärschlüssel für Datensatz {RecNum} in Tabelle {TableName}

# ERR_dbmg_1121
source: Cannot delete all records in selection of table {TableName}
de: Es können nicht alle ausgewählten Datensätze für Tabelle {TableName} gelöscht werden

# ERR_dbmg_1122
source: BLOB is Null
de: BLOB ist Null

# ERR_dbmg_1123
source: Invalid database context
de: Ungültiger Datenbankkontext

# ERR_dbmg_1124
source: Invalid relation reference
de: Ungültige Verknüpfungsreferenz

# ERR_dbmg_1125
source: Invalid record name in table {TableName}
de: Ungültiger Datensatzname in Tabelle {TableName}

# ERR_dbmg_1126
source: Wrong field type
de: Ungültiger Feldtyp

# ERR_dbmg_1127
source: Cannot load extra properties
de: Zusätzliche Eigenschaften können nicht geladen werden

# ERR_dbmg_1128
source: Cannot save extra properties
de: Zusätzliche Eigenschaften können nicht gespeichert werden

# ERR_dbmg_1129
source: Subrecord ID is out of range
de: Unterdatensatz-ID ist außerhalb des gültigen Bereichs

# ERR_dbmg_1130
source: Duplicate name for index {IndexName} in database {BaseName}
de: Bereits vorhandener Name für Index {IndexName} in Datenbank {BaseName}

# ERR_dbmg_1131
source: Invalid name for index {IndexName} in database {BaseName}
de: Ungültiger Name für Index {IndexName} in Datenbank {BaseName}

# ERR_dbmg_1132
source: Wrong key value on index {IndexName}
de: Ungültiger Schlüsselwert für index {IndexName}

# ERR_dbmg_1133
source: Wrong type for index {IndexName}
de: Ungültiger Typ für Index {IndexName}

# ERR_dbmg_1134
source: Invalid accessor
de: Ungültiger accessor

# ERR_dbmg_1135
source: Accessor is read only
de: Accessor ist Nur Lesen

# ERR_dbmg_1136
source: Null value not accepted
de: Null-Wert nicht erlaubt

# ERR_dbmg_1137
source: THIS is Null
de: THIS ist Null

# ERR_dbmg_1138
source: Selection is Null
de: Auswahl ist Null

# ERR_dbmg_1139
source: Database {BaseName} is write protected
de: Datenbank {BaseName} ist schreibgeschützt

# ERR_dbmg_1140
source: Database {BaseName} is closing
de: Datenbank {BaseName} wird geschlossen

# ERR_dbmg_1141
source: Invalid transaction
de: Ungültige Transaktion

# ERR_dbmg_1142
source: Array limit is exceeded
de: Arraybegrenzung wurde überschritten

# ERR_dbmg_1143
source: Creator of array values is missing
de: Erzeugung von Arraywerten fehlt

# ERR_dbmg_1144
source: Cannot build selection of table {TableName}
de: Auswahl für Tabelle {TableName} kann nicht erzeugt werden

# ERR_dbmg_1145
source: Busy object
de: Objekt wird benutzt

# ERR_dbmg_1146
source: Data file does not match structure file
de: Datendatei paßt nicht zur Struktur

# ERR_dbmg_1147
source: Cannot start listener
de: Listenerprogramm kann nicht gestartet werden

# ERR_dbmg_1148
source: Cannot start server
de: Server kann nicht gestartet werden

# ERR_dbmg_1149
source: No listener
de: Listenerprogramm existiert nicht

# ERR_dbmg_1150
source: Task is dying
de: Task wird beendet

# ERR_dbmg_1151
source: Invalid request tag
de: Ungültiger Anfrage-Tag

# ERR_dbmg_1152
source: Invalid context ID
de: Ungültige Kontext-ID

# ERR_dbmg_1153
source: Not enough temporary space on disk
de: Nicht genügend temporärer Speicherplatz auf Festplatte

# ERR_dbmg_1154
source: Data set is Null
de: Datenset ist Null

# ERR_dbmg_1155
source: No primary key matching the foreign key
de: Kein primärer Schlüssel entspricht dem Fremdschlüssel

# ERR_dbmg_1156
source: Type of field {FieldName} of table {TableName} does not support being set to Unique
de: Typ des Feldes {FieldName} in Tabelle {TableName} kann nicht einmalig sein

# ERR_dbmg_1157
source: Type of field {FieldName} of table {TableName} does not support being set to NEVER NULL
de: Typ des Feldes {FieldName} in Tabelle {TableName} kann nicht auf NEVER NULL gesetzt werden

# ERR_dbmg_1158
source: Cannot alter primary key definition of table {TableName}
de: Definition des Primärschlüssels für Tabelle {TableName} kann nicht geändert werden

# ERR_dbmg_1159
source: Maximum number of records has been reached for table {TableName}
de: Maximale Anzahl Datensätze für Tabelle {TableName} erreicht

# ERR_dbmg_1160
source: Maximum number of BLOBs has been reached for table {TableName}
de: Maximale Anzahl BLOBs für Tabelle {TableName} erreicht

# ERR_dbmg_1161
source: Indice is out of range
de: Index ist außerhalb Bereich

# ERR_dbmg_1162
source: Query is invalid
de: Ungültige Suche

# ERR_dbmg_1163
source: Record is NULL
de: Datensatz ist NULL

# ERR_dbmg_1164
source: Object is NULL
de: Objekt ist NULL

# ERR_dbmg_1165
source: Wrong owner for this object
de: Ungültiger Eigentümer für das Objekt

# ERR_dbmg_1166
source: Object was not locked
de: Objekt war nicht gesperrt

# ERR_dbmg_1167
source: Object is locked by another context
de: Objekt wird von einem anderen Kontext gesperrt

# ERR_dbmg_1168
source: Internal error on remote connection
de: Interner Fehler bei Fernverbindung

# ERR_dbmg_1169
source: Invalid table number
de: Ungültige Tabellennummer

# ERR_dbmg_1170
source: Invalid field number
de: Ungültige Feldnummer

# ERR_dbmg_1171
source: Invalid Database ID
de: Ungültige Datenbank-ID

# ERR_dbmg_1172
source: Invalid Parameter
de: Ungültiger Parameter

# ERR_dbmg_1173
source: Cache Flushing did not complete
de: Sichern des Caches nicht erfolgreich

# ERR_dbmg_1174
source: Data Flushing did not complete
de: Sichern der Daten nicht erfolgreich

# ERR_dbmg_1175
source: Structure Flushing did not complete
de: Sichern der Struktur nicht erfolgreich

# ERR_dbmg_1176
source: Log file is invalid for database {BaseName}
de: Ungültiges Logbuch für Datenbank {BaseName}

# ERR_dbmg_1177
source: Log file cannot be found for database {BaseName}
de: Logbuch für Datenbank {BaseName} kann nicht gefunden werden

# ERR_dbmg_1178
source: Last operation in log file doest not match the one in database {BaseName}
de: Letzte Operation in Logbuch entspricht nicht der letzten Operation in Datenbank {BaseName}

# ERR_dbmg_1179
source: Log file does not match database {BaseName}
de: Falsches Logbuch für Datenbank {BaseName}

# ERR_dbmg_1180
source: Data Table has been deleted
de: Datentabelle wurde gelöscht

# ERR_dbmg_1181
source: Keys are not unique in index {IndexName}
de: Einträge in Index {IndexName} nicht einmalig

# ERR_dbmg_1182
source: Cannot create log file for database {DataBase}
de: Logbuch für Datenbank {BaseName} kann nicht angelegt werden

# ERR_dbmg_1183
source: Cannot write into log file of database {DataBase}
de: In Logbuch für Datenbank {BaseName} kann nicht geschrieben werden

# ERR_dbmg_1184
source: Cannot drop table {TableName} in database {DataBase}
de: Tabelle {TableName} in Datenbank {BaseName} kann nicht gelöscht werden

# ERR_dbmg_1185
source: Remote database cannot be opened
de: Remote Datenbank kann nicht geöffnet werden

# ERR_dbmg_1186
source: Log file cannot be integrated into database {DataBase}
de: Logbuch kann nicht in Datenbank {BaseName} integriert werden

# ERR_dbmg_1187
source: Internal Computation on Set cannot be completed
de: Interne Berechnung auf Menge kann nicht ausgeführt werden

# ERR_dbmg_1188
source: Array cannot be saved
de: Array kann nicht gespeichert werden

# ERR_dbmg_1189
source: Array cannot be loaded
de: Array kann nicht geladen werden
