Repository: StephaneH/core-Components
Catalog: HTTPServer/Resources/*.lproj/HTTPServerDE.xlf
Languages: de

# ERR_HTTP_1000
source: Error description is not available.
de: Fehlerbeschreibung ist nicht verfügbar.

# ERR_HTTP_1001
source: Access denied.
de: Zugriff verweigert.

# ERR_HTTP_1002
source: Invalid internal state.
de: Ungültiger interner Zustand.

# ERR_HTTP_1003
source: Memory error.
de: Speicherfehler.

# ERR_HTTP_1004
source: Invalid argument.
de: Ungültiges Argument.

# ERR_HTTP_1005
source: HTTP request handler already exists.
de: HTTP Request Handler existiert bereits.

# ERR_HTTP_1006
source: Base64 decoding failed.
de: Base64 Decoding fehlgeschlagen.

# ERR_HTTP_1007
source: Base64 encoding failed.
de: Base64 Encoding fehlgeschlagen.

# ERR_HTTP_1008
source: HTTP request handler does not exists.
de: HTTP Request Handler existiert nicht.

# ERR_HTTP_1009
source: HTTP Server is being turned off.
de: HTTP Server ist abgeschaltet.

# ERR_HTTP_1010
source: HTTP Server Project does not exist.
de: HTTP Server Projekt existiert nicht.

# ERR_HTTP_1011
source: Virtual Host already exists.
de: Virtual Host existiert bereits.

# ERR_HTTP_1012
source: String not found.
de: String nicht gefunden.

# ERR_HTTP_1013
source: Authentication referee already exists.
de: Authentication Referenz existiert bereits.

# ERR_HTTP_1014
source: Cache rule already exists.
de: Cache-Regel existiert bereits.

# ERR_HTTP_1015
source: Cache rule expires.
de: Cache-Regel läuft ab.

# ERR_HTTP_1023
source: Some HTTP Server Project Settings are already used. Check Port ({p1}), SSLPort ({p2}) or Hostname Settings ({p3}).
de: Einige HTTP Server Projekt-Einstellungen werden bereits verwendet. Prüfen Sie ({p1}), SSLPort ({p2}) und Hostname ({p3}).

# ERR_HTTP_1024
source: Virtual Folder already exists.
de: Der virtuelle Ordner existiert bereits.

# ERR_HTTP_1025
source: Hostname is missing in Project Settings.
de: Hostname fehlt in Projekt-Einstellungen.

# HTTP_SPARE_THREAD
source: Spare task
de: Reservertask
