Repository: StephaneH/core-Components
Catalog: HTTPServer/Resources/*.lproj/HTTPServerPT-*.xlf
Languages: pt_br

# ERR_HTTP_1000
source: Error description is not available.
pt_br: Descrição do erro não disponível

# ERR_HTTP_1001
source: Access denied.
pt_br: Acesso negado.

# ERR_HTTP_1002
source: Invalid internal state.
pt_br: Estado interno inválido

# ERR_HTTP_1003
source: Memory error.
pt_br: Erro na memória

# ERR_HTTP_1004
source: Invalid argument.
pt_br: Argumento inválido

# ERR_HTTP_1005
source: HTTP request handler already exists.
pt_br: O manejador de requisições HTTP já existe

# ERR_HTTP_1006
source: Base64 decoding failed.
pt_br: A decodificação base64 falhou.

# ERR_HTTP_1007
source: Base64 encoding failed.
pt_br: A codificação base64 falhou

# ERR_HTTP_1008
source: HTTP request handler does not exists.
pt_br: O manejador de requisições HTTP não existe

# ERR_HTTP_1009
source: HTTP Server is being turned off.
pt_br: Servidor de HTTP está sendo desligado

# ERR_HTTP_1010
source: HTTP Server Project does not exist.
pt_br: Servidor de Projeto HTTP não existe

# ERR_HTTP_1011
source: Virtual Host already exists.
pt_br: Host Virtual já existe

# ERR_HTTP_1012
source: String not found.
pt_br: String não encontrada

# ERR_HTTP_1013
source: Authentication referee already exists.
pt_br: Juiz de autentificação já existe

# ERR_HTTP_1014
source: Cache rule already exists.
pt_br: Regra de cache já existe

# ERR_HTTP_1015
source: Cache rule expires.
pt_br: Vencimento de cache

# ERR_HTTP_1023
source: Some HTTP Server Project Settings are already used. Check Port, SSLPort or Hostname Settings.
pt_br: Algumas propriedades do servidor HTTP já estão em uso. Verifique a porta, a porta SSL ou hostname.

# ERR_HTTP_1024
source: Virtual Folder already exists.
pt_br: A pasta virtual já existe.

# ERR_HTTP_1025
source: Hostname is missing in Project Settings.
pt_br: O nome do host não é encontrado nas configurações do projeto.

# ERR_HTTP_1026
source: Virtual Folder does not exist.
pt_br: A pasta virtual não existe.

# HTTP_WORKER_THREAD
source: HTTP connection handler
pt_br: Manejador de conexão HTTP

# HTTP_SPARE_THREAD
source: Spare task
pt_br: Tarefa sobressalente

# SNET_CONNECTION_LISTENER
source: TCP connection listener
pt_br: Porta de conexão TCP

# SNET_SELECT_IO_HANDLER
source: TCP select I/O handler
pt_br: Selecione manejador E/S para TCP

# SNET_SHARED_WORKER
source: Shared pool worker
pt_br: Pool worker compartilhado

# SNET_EXCLUSIVE_WORKER
source: Exclusive pool worker
pt_br: Pool worker exclusivo

# SNET_SHARED_LOAD_BALANCER
source: TCP shared load balancer
pt_br: Balanceador de carga compartilhadaTCP
